Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/application-help/batch_runner.po
Languages: id

source: *Batch Runner*
id: *InaSAFE Batch Runner*

source: With this tool you can set up numerous scenarios and run them all in one go. For example, in a typical use case you might define a number of flood impact scenarios all using a standard dataset, such as :file:`flood.shp`. As new flood data becomes available you replace :file:`flood.shp` and rerun the scenarios using the batch runner. Using this approach you can quickly produce regional contingency plans as your understanding of hazards changes. When you run the batch of scenarios, PDF reports are generated automatically and all placed in a single common directory making it easy for you to browse and disseminate the reports produced.
id: Dengan *tool* ini, Anda dapat mengatur berbagai skenario dan menjalankan mereka semua sekaligus. Misalnya dalam sebuah kasus, Anda dapat menetapkan sejumlah skenario dampak banjir dengan menggunakan sebuah dataset standar, misalnya :file:`flood.shp`. Begitu data banjir yang baru telah tersedia, Anda menimpa/mengganti :file:`flood.shp` dan kembali menjalankan skenario menggunakan *batch runner*. Dengan menggunakan pendekatan ini, Anda dapat dengan cepat menghasilkan rencana kontinjensi daerah disertai dengan pemahaman Anda akan perubahan-perubahan ancaman. Ketika Anda menjalankan *batch* skenario, sebuah laporan dalam bentuk *file* PDF akan dihasilkan secara otomatis dan semua ditempatkan dalam sebuah direktori umum sehingga memudahkan Anda untuk mencari dan menyebarkan laporan tersebut.

source: Steps for using the Batch Runner
id: Tahap untuk menggunakan *Batch Runner*

source: Create a normal scenario. Run the scenario to make sure it is valid.
id: Buat sebuah skenario normal. Jalankan skenario untuk memastikan bahwa skenario tersebut valid.

source: Save the scenario :ref:`tb_save_scenario` use an easily accessible folder.
id: Simpan skenario :ref:`tb_save_scenario` simpan di direktori yang mudah diakses.

source: Repeat the previous step until a few scenarios have been saved.
id: Ulangi tahap tersebut sampai beberapa skenario telah tersimpan.

source: Go to the Window menu --> Plugins --> InaSAFE --> Batch Runner you should see a dialog box like below
id: Pergi ke menu ---> Plugins --> InaSAFE --> Batch Runner anda akan melihat jendela seperti dibawah ini

source: *Batch Runner Directory*
id: *Direktori Batch Runner*

source: Set the scenario directory to the one used in step 2. If this is done correctly the results table will list your saved scenarios.
id: Atur agar direktori skenario mengarah ke direktori yang diatur pada tahap 2. Jika hal ini diatur dengan benar, sebuah tabel dibawah akan memunculkan skenario yang anda simpan.

source: Set output destination to an easily accessible directory, this is where all your reports will go.
id: Atur destinasi keluaran ke direktori yang mudah diakses, ini adalah direktori dimana semua report anda akan dihasilkan.

source: Run all your scenarios it should look like below
id: Jalankan semua skenario dan akan terlihat seperti dibawah ini

source: *Batch Runner Busy*
id: *Bath Runner sedang Berjalan*

source: look in the output destination. You should see all the reports and a batch report confirmation.
id: lihat pada direktori hasil. Anda akan melihat semua hasil dan konfirmasi *batch runner*.

source: *Batch Runner Results*
id: *Hasil Batch Runner*
