Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/application-help/impact_layer_merge_tool.po
Languages: id

source: The Impact Layer Merge Tool
id: Tool Menggabungkan Layer Dampak

source: In some cases you may wish to create a report containing the combined output of two impact functions for the same area for the **same hazard** but **different exposures**. For example, you may carry out an assessment of the impact of a flood on population and on buildings and combine the results into a single report. The Impact Layer Merge tool allows you to do this.
id: Dalam beberapa kasus, Anda mungkin ingin membuat sebuah laporan yang mengkombinasikan hasil analisis dari dua fungsi dampak di satu area yang sama untuk **ancaman yang sama** namun **keterpaparan yang berbeda**. Sebagai contoh, Anda mungkin ingin melihat hasil kajian dari dampak banjir terhadap populasi dan bangunan dan menggabungkan keduanya ke dalam satu laporan. *Tool* Menggabungkan Layer Dampak memungkinkan Anda untuk melakukan hal ini.

source: *Opened impact merge dialog*
id: *Tampilan kotak dialog Menggabungkan Layer Dampak yang telah terbuka*

source: Prerequisites
id: Prasyarat

source: In order to use this tool, please bear in mind the following requirements:
id: Untuk menggunakan tool ini, harap diperhatikan beberapa persyaratan berikut:

source: Both impact layers should be loaded in your current project
id: Kedua layer dampak harus dimuat dalam proyek yang sedang Anda buka saat ini.

source: Both impact layers should have been created for the same geographic region
id: Kedua layer dampak harus dibuat pada wilayah geografis yang sama.

source: The same aggregation area should be used for both assessments
id: Daerah agregrasi yang sama harus digunakan untuk kedua penilaian.

source: Procedure
id: Prosedur

source: To use this tool, follow this procedure:
id: Untuk menggunakan alat ini, ikuti langkah berikut:

source: Run an impact assessment for an area using aggregation. such as flood impact on buildings aggregated by municipal boundaries.
id: Jalankan penilaian dampak untuk suatu wilayah menggunakan agregasi, misalnya dampak banjir terhadap bangunan diagregasi berdasarkan batas kabupaten/kota.

source: Run a second impact assessment for the same area using the same aggregation. e.g. flood impact on people aggregated by municipal boundaries.
id: Jalankan penilaian dampak kedua untuk daerah yang sama menggunakan agregasi yang sama, misalnya jumlah penduduk terdampak banjir diagregasi berdasarkan batas kabupaten/kota.

source: Open the Impact Merge tool and select each impact layer from the pick lists provided.
id: Buka *tool* Menggabungkan Layer Dampak InaSAFE dan pilih *layer* dampak dari daftar yang tersedia.

source: Select the aggregation layer that was used to generate the first and second impact layer.
id: Pilih layer agregasi yang digunakan untuk menghasilkan layer terdampak pertama dan kedua.

source: Select an output directory.
id: Pilih direktori output.

source: Check the box next to :guilabel:`Use customized report template` and select the report template file if you want to use your own template. Note that all the map composer components that are needed must be completed.
id: Centang kotak di samping "Gunakan template laporan terkostumisasi" dan pilih *file* template laporan jika Anda ingin menggunakan template sendiri. Sebagai catatan, seluruh komponen komposer peta yang dibutuhkan harus telah tersedia dengan lengkap.

source: Click :guilabel:`OK` to generate the per aggregation area combined summaries.
id: Klik :guilabel:`OK` untuk menghasilkan ringkasan gabungan kedua layer dampak per area agregasi.

source: Generated outputs
id: *Output* yang dihasilkan

source: The tool will generate a PDF per aggregation area. The PDFs will be placed in the designated output directory after completion of the merge process. The output will consist of a map page and a table page. These are illustrated below:
id: *Tool* ini akan membuat PDF untuk setiap daerah agregrasi. PDF yang dibentuk akan di tempatkan pada direktori yang dituju setelah selesai proses penggabungan. *Output* yang dihasilkan akan terdiri dari halaman peta dan halaman tabel. Seperti yang diilustrasikan dibawah ini:

source: *Map page generated by the impact merge tool*
id: *Halaman peta yang dihasilkan oleh *tool* Penggabungan *Layer* Dampak InaSAFE*

source: *Table page generated by the impact merge tool*
id: *Halaman tabel yang dihasilkan oleh *tool* Penggabungan *Layer* Dampak InaSAFE*.

source: In the case of impact assessments where no aggregation has been used, only a single PDF report is generated. In the case of impact assessments where aggregation has been used, one PDF is generated per aggregation area.
id: Jika dalam suatu penilaian dampak tidak ada agregrasi yang digunakan, hanya akan dihasilkan satu *file* PDF. Namun, jika dalam suatu penilaian dampak terdapat agregrasi, satu *file* PDF akan dihasilkan untuk setiap area agregrasi.

source: After report generation completes, the output directory will be opened automatically.
id: Setelah pembuatan laporan selesai, direktori *output* akan terbuka secara otomatis.

source: Using customised templates
id: Menggunakan *Template* Terkostumisasi

source: The default template report is located in :file:`/resources/qgis-composer-templates/merged-report.qpt`. If that template does not satisfy your needs, you can use your own report template. Before using your own report template, make sure that your template contains all of these elements with id:
id: *Template* laporan bawaan berada di :file:`/resources/qgis-composer-templates/merged-report.qpt`. Jika *template* tersebut tidak dapat memenuhi kebutuhan anda, anda dapat menggunakan *template* laporan anda sendiri. Sebelum menggunakan *template* laporan anda sendiri, pastikan bahwa *template* Anda terdiri dari elemen-elemen berikut dengan ID:

source: **impact-map**, a QgsComposerMap
id: **impact-map**, berjenis QgsComposerMap

source: **safe-logo**, a QgsComposerPicture
id: **safe-logo**, berjenis QgsComposerPicture

source: **summary-report**, a QgsComposerLabel
id: **summary-report**, berjenis QgsComposerLabel

source: **aggregation-area**, a QgsComposerLabel
id: **aggregation-area**, berjenis QgsComposerLabel

source: **map-scale**, a QgsComposerScaleBar
id: **map-scale**, berjenis QgsComposerScaleBar

source: **map-legend**, a QgsComposerLegend
id: **map-legend**, berjenis QgsComposerLegend

source: **organisation-logo**, a QgsComposerPicture
id: **organisation-logo**, berjenis QgsComposerPicture

source: **merged-report-table**, a QgsComposerHTML
id: **merged-report-table**, sebuah QgsComposerHTML

source: If any of those elements does not exist on the report template, the tools will tell you what element is missing on the template.
id: Jika salah satu dari elemen tersebut tidak tersedia di dalam *template* laporan, QGIS akan memberi Anda informasi tentang elemen apa yang belum tersedia dari *template* tersebut.

source: You can arrange those elements in any position you want.
id: Anda dapat mengatur elemen-elemen tersebut di segala posisi yang Anda inginkan.

source: Map template elements
id: Elemen *Template* Peta

source: In terms of value replacement, there are three groups of elements on the template:
id: Dalam ketentuan penggantian, ada tiga kelompok elemen didalam *template*:

source: 1. Elements that can be changed with the |project_name| Options tool. To change the value of these elements, please go to **InaSAFE Options** and change the value of the related field. Those elements are:
id: 1. Elemen yang dapat diganti dengan *tool* Pilihan |project_name|. Untuk mengubah nilai dari elemen tersebut, pergi ke **InaSAFE Option** dan ganti nilai dari *field* terkait. Elemen tersebut adalah:

source: **organisation-logo**. It corresponds to the :guilabel:`Organisation logo` field in InaSAFE Options. If you do not fill this field, then the default one, :file:`supporters.png`, will be used.
id: **logo-organisasi**. Ini bersesuaian dengan *field* :guilabel:`Logo Organisasi` pada *tool* InaSAFE Option. Jika Anda tidak mengisi *field* ini, maka logo bawaan yaitu :file:`supporters.png`, akan digunakan.

source: **disclaimer**. This corresponds to the :guilabel:`Disclaimer text` field in InaSAFE Options. If you do not fill in this field the default text will be used: "InaSAFE has been jointly developed by Indonesian Government-BPNB, Australian Govenment-AIFDR and the World Bank-GFDRR. These agencies and the individual software developers of InaSAFE take no responsibility for the correctness of outputs from InaSAFE or decisions derived as a consequence."
id: **Penolakan**. Berpengaruh pada *field* :guilabel:`Teks Penolakan` pada *tool* InaSAFE Options. Jika Anda tdak mengisi *field* ini, maka pengaturan bawaan akan digunakan: "InaSAFE telah dikembangkan secara bersama-sama oleh Pemerintah Indonesia-BNPB, Pemerintah Australia-AIFDR, dan World Bank-GFDRR. Instansi-instansi tersebut dan pengembang perangkat lunak InaSAFE tidak bertanggung jawab atas kebenaran *output* dari InaSAFE serta keputusan yang diberikan sebagai konsekuensinya."

source: 2. Elements containing tokens. The id of these elements is not significant, only the token it contains. At render time, these tokens will be replaced. If you want to have a label containing the value of these elements, enclose these elements with [] on a label i.e **[impact-title]** or **[hazard-title]**. The elements are listed below:
id: 2. Elemen yang mengadung *token*. Identitas dari elemen ini tidak signifikan, hanya terdiri dari *token*. Saat me-*render*, *token* tersebut akan diganti. Jika Anda ingin memiliki *label* yang mengandung nilai dari elemen ini, tutup elemen tersebut dengan [] pada *label*, contoh **[judul-dampak]** atau **[judul-ancaman]**. Elemen-elemen tersebut dirinci di bawah ini:

source: **impact-title** - indicates the title of two impacts. The value will be "*first_impact_title* and *second_impact_title*"
id: **judul-dampak** - mengindikasikan judul dari dua dampak. Nilainya akan menjadi "*judul_dampak_pertama* dan *judul_dampak_kedua*"

source: **hazard-title** - indicates the hazard title used to generate the impact layer.
id: **judul-ancaman**. Mengindikasikan judul ancaman yang digunakan untuk membuat *layer* dampak.

source: 3. Elements that are direcly updated by the renderer. All of these elements below are generated automatically by the tools.
id: 3. Elemen yang langsung diperbaharui oleh *renderer*. Semua elemen dibawah ini secara otomatis dihasilkan oleh InaSAFE.

source: **impact-map**. This contains the map of two impact layers.
id: **peta-dampak**. Memuat peta dari kedua *layer* dampak.

source: **summary-report**. This contains the summary of the impact from two impact layers.
id: **ringkasan-laporan**. Memuat ringkasan dampak dari kedua *layer* dampak.

source: **aggregation-area**. This contains the name of the aggregation area.
id: **area-agregasi**. Memuat nama area agregasi.

source: **map-scale**. This indicates the scale of the map. To work with any layer projection preferences, we encourage you to use a numeric scale bar.
id: **skala-peta**. Mengindikasikan skala peta. Untuk bekerja dengan segala jenis proyeksi, kami menyarankan Anda untuk menggunakan skala angka.

source: **map-legend**. This shows the legend of merged impact layers. The map legend on default template is set to have 2 columns showing each impact layer legend.
id: **legenda-peta**. Menyajikan legenda dari penggabungan *layer* dampak. Pengaturan bawaan dari *template* legenda peta diatur ke dalam 2 kolom yang menggambarkan masing-masing legenda *layer* dampak.

source: **merged-report-table**. This contains the detailed information of each impact.
id: **tabel-laporan-yang digabung**. Memuat informasi detail dari setiap dampak.
