Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/application-help/impact_functions.po
Languages: id

source: Understand Impact Functions
id: Memahami Fungsi Dampak

source: This document explains the purpose of impact functions and lists the different available impact function and the requirements each has to be used effectively.
id: Dokumen ini menjelaskan tujuan dari fungsi-fungsi dampak dan membuat daftar fungsi dampak berbeda yang tersedia beserta setiap kebutuhannya yang akan digunakan secara efektif.

source: What is an impact function?
id: Apa itu fungsi dampak?

source: An impact function is a software program that computes an impact assessment given a number of inputs. The impact assessment will typically have a *spatial* component (e.g. a GIS layer which can be incorporated into a map) and a *non-spatial* component (e.g. a list of actions you may want to consider carrying out, or a list of estimates of disaster risk reduction elements such as how many bags of rice to make available).
id: Fungsi dampak adalah sebuah program perangkat lunak yang menghitung penilaian dampak diberikan sejumlah masukan. Penilaian dampak biasanya memiliki sebuah komponen *spasial* (misalnya layer SIG yang dapat dimasukkan ke dalam peta) dan sebuah komponen *non-spasial* (misalnya daftar dampak yang ingin dipertimbangkan untuk dimasukkan, atau daftar perkiraan unsur-unsur yang dapat mengurangi resiko bencana seperti berapa banyak karung beras untuk persediaan dalam suatu bencana).

source: Selecting an impact function
id: Memilih fungsi dampak

source: Impact functions are bundled with the |project_name| software. The graphical user interface (provided as a plugin for QGIS) will offer a list of impact functions that can be used based on the layers you have loaded and their :doc:`keywords <keywords>`.
id: Fungsi dampak yang digabungkan dengan perangkat lunak |project_name|. Tampilan grafis pengguna (tersedia sebagai plugin untuk QGIS) akan menawarkan daftar fungsi dampak yang dapat digunakan berdasarkan layer yang Anda muat dan :doc:`keywords <keywords>` mereka.

source: Exploring impact functions
id: Menjelajahi fungsi dampak

source: You can use the impact function table to explore all of the possible impact functions that can be used. They are listed in a table with a series of pick-lists (combo boxes) above which can be used to filter the functions based on different criteria as illustrated below.
id: Anda dapat menggunakan tabel fungsi dampak untuk mengeksplorasi seluruh kemungkinan fungsi dampak yang dapat digunakan. Semuanya telah terdaftar pada sebuah tabel dengan sebuah seri daftar pilihan (kotak kombo) di atas yang dapat digunakan untuk menyaring fungsi berdasarkan pada kriteria sebagaimana yang telah diilustrasikan di bawah ini.

source: *Unfiltered impact function table*
id: *Tabel fungsi dampak yang tidak disaring*

source: When applying a filter set, the list of available functions that meet those criteria is updated as shown below.
id: Ketika mengaplikasikan sebuah set penyaringan, daftar fungsi yang tersedia yang memenuhi kriteria akan diperbaharui sebagaimana yang ditunjukan di bawah ini.

source: *Filtered impact function table*
id: *Tabel fungsi dampak yang disaring*

source: The impact function table is simply a browser to help you to familiarise yourself with the functions available. For the actual usage of the functions you need to have layers available (i.e. loaded in QGIS) with the appropriate keywords for your target function.
id: Tabel fungsi dampak sederhananya adalah sebuah penjelajah untuk membantu Anda agar memahami fungsi-fungsi yang tersedia. Untuk penggunaan fungsi sebenarnya Anda memerlukan layer-layer yang tersedia (termuat dalam QGIS) dengan kata kunci yang sesuai untuk target fungsi Anda.

source: Configurable impact functions
id: Fungsi dampak yang dapat diatur

source: Some impact functions can be configured before use. For example if you have a raster flood hazard layer where each pixel represents flood depth, you can set depth thresholds (low / medium / high).
id: Beberapa fungsi dampak dapat diatur sebelum digunakan. Misalnya jika Anda memiliki sebuah layer raster ancaman banjir dimana setiap piksel menunjukkan kedalaman banjir, Anda dapat mengatur ambang batas kedalaman (rendah/sedang/tinggi).

source: Creating impact functions
id: Membuat fungsi dampak

source: If you feel there is an important impact function which is missing, there are two avenues you can follow:
id: Jika Anda merasa terdapat fungsi dampak yang tidak tercantum, ada dua langkah yang bisa Anda ikuti:

source: If you have basic python programming skills, you could implement a new impact function yourself.
id: Jika anda memiliki kemampuan dasar pemrograman dengan bahasa python, anda dapat mengimplementasikan sebuah fungsi dampak anda sendiri.

source: You can file a ticket on our `issue tracking system <https://github.com/AIFDR/inasafe/issues>`_, and if time and resources allow we will implement it for you.
id: Anda dapat melaporkan sebuah tiket pada `sistem pengecekan masalah <https://github.com/AIFDR/inasafe/issues>`_, dan jika terdapat waktu dan sumber daya, kami akan mengimplementasikannya untuk anda.
