Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/application-help/keywords_wizard.po
Languages: id

source: Keywords Wizard
id: Wizard Kata Kunci

source: This wizard will lead you through the process of defining keywords for an exposure, hazard or aggregation layer. Unlike the :ref:`keywords editor <keywords_editor>`, the keywords wizard understands the constraints and rules that determine which keywords can be applied to any given layer. For example, if you have a raster layer, the keywords wizard will use impact function metadata to prevent you from declaring that the layer contains road exposure data since by definition, such data must be vector line data.
id: Wizard ini akan mengarahkan Anda melalui proses mendefinisikan kata kunci untuk *layer* keterpaparan, ancaman atau agregasi. Berbeda dengan :ref:`penyunting kata kunci <keywords_editor>`, kata kunci wizard 'memahami' kendala dan aturan yang menentukan kata kunci dapat diterapkan untuk setiap *layer* yang diberikan. Misalnya, jika Anda memiliki *layer* raster, kata kunci wizard akan menggunakan metadata fungsi dampak untuk mencegah Anda menyatakan bahwa *layer* berisi data keterpaparan jalan sejak didefinisikan, data tersebut seharusnya data vektor garis.

source: Each impact function includes metadata that defines what rules should apply to data that will be used with that impact function. At startup, the wizard scans this metadata and uses it to define its rules.
id: Setiap fungsi dampak termasuk metadata yang mendefinisikan aturan apa yang harus diterapkan pada data yang akan digunakan dengan fungsi dampak. Pada startup, wizard memindai metadata ini dan menggunakannya untuk menentukan aturannya.

source: For more general discussion on the keywords system used by |project_name|, see the :ref:`keywords system <keywords_system>` documentation.
id: Untuk diskusi yang lebih umum pada sistem kata kunci yang digunakan oleh InaSAFE, silakan lihat dokumentasi :ref:`sistem kata kunci <keywords_system>`.

source: Invoking the wizard
id: Membuka wizard

source: You can run the wizard by clicking on the icon in the InaSAFE toolbar that looks like this:
id: Anda dapat menjalankan wizard dengan mengklik icon di toolbar InaSAFE yang terlihat seperti ini:

source: You should have at least one layer loaded and active in QGIS before attempting to launch the keywords wizard.
id: Anda harus memiliki setidaknya satu layer yang dimuat dan aktif dalam QGIS sebelum mencoba untuk menjalankan kata kunci wizard.

source: Once loaded the wizard will appear:
id: Setelah dimuat wizard akan muncul:

source: If the layer already has keywords assigned to it, the wizard will default to existing keywords on each step (where applicable).
id: Jika layer sudah memiliki kata kunci yang didefinisikan untuk layer tersebut, wizard secara default akan mengacu ke kata kunci yang ada pada setiap langkah (jika ada).

source: Cancelling the wizard
id: Membatalkan wizard

source: The wizard can be cancelled at any time by clicking the :guilabel:`Cancel` button at the bottom of the wizard. No changes will be written to the keywords file if the wizard is cancelled.
id: Wizard dapat dibatalkan setiap saat dengan menekan tombol :guilabel:`Batal` di bagian bawah wizard. Tidak ada perubahan akan ditulis pada *file* kata kunci jika wizard dibatalkan.

source: Using the wizard
id: Menggunakan wizard

source: To use the wizard, simply follow the prompts presented on each page of the wizard. There are three standard forms of user input expected:
id: Untuk menggunakan wizard, caranya sederhana dengan mengikuti petunjuk yang ditampilkan pada setiap halaman wizard. Ada tiga bentuk standar dari *input* pengguna yang diharapkan dalam wizard:

source: 1.) **List selection** - In this case options are provided in a list. Clicking on an item will usually display additional helpful text in the information area of the dialog.
id: 1.) **Daftar pilihan** - Dalam hal ini pilihan tersedia dalam daftar. Mengklik pada item biasanya akan menampilkan teks tambahan membantu dalam bidang informasi dari dialog.

source: 2) **Field selection** - Whilst it appears to look like the list selection above, in this case the list is automatically generated from the available attributes of the layer.
id: 2) **Temukan Field** - Sementara tampaknya terlihat seperti daftar pilihan di atas, dalam hal ini daftar secara otomatis dihasilkan dari atribut yang tersedia dari *layer*.

source: 3) **Free form text** - In some cases you may be prompted to enter free form text in order to define some additional metadata.
id: 3) **Bentuk teks bebas** - Dalam beberapa kasus, Anda mungkin akan diminta untuk memasukkan bentuk teks bebas dalam rangka untuk menentukan beberapa metadata tambahan.

source: 4) **Drag and drop list** - In this context the user should make concept mappings by dragging items from the left list (represented by unique field values from the attributes table) onto concepts in the right hand tree. For example, below we see the user mapping all polygons that have their 'floodprone' field value as 'YES' or 'yes' onto the 'wet' concept in the tree view on the right.
id: 4) **Daftar geser dan taruh**. Dalam konteks ini pengguna harus membuat konsep pemetaan dengan menggeser item dari daftar kiri (diwakili oleh *field value* yang unik dari tabel atribut) ke konsep di sebelah kanan. Sebagai contoh, di bawah ini kita lihat pengguna memetakan semua poligon yang memiliki 'floodprone' *field value* sebagai 'YA' atau 'ya' ke konsep 'basah' dalam tampilan struktur pohon di sebelah kanan.

source: Completing the wizard
id: Menyelesaikan wizard

source: On completion of the keywords wizard, a :file:`.keywords` file will be written to disk and the keywords for the layer will be displayed in the dock area when that layer is active in QGIS.
id: Setelah menyelesaikan kata kunci wizard, :file:`.keywords` akan ditulis ke disk dan kata kunci untuk layer akan ditampilkan di area dock ketika layer tersebut aktif di QGIS.

source: The keywords wizard generates keywords that are not compatible with versions of |project_name| older than 2.1.
id: Kata kunci wizard akan menghasilkan kata kunci dengan catatan kompatibel dengan InaSAFE versi yang lebih lama dari 2.1.
