Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/application-help/keywords_editor.po
Languages: id

source: Keywords Editor
id: Editor Kata kunci (keyword editor)

source: The keywords editor provides an interface for creating |project_name| keywords. If you are a new user, you should probably use the :ref:`Keywords Wizard <keywords_wizard>` rather than the keywords editor as it makes it easy to specify correct keywords if you are not familiar with the system.
id: Editor kata kunci menyediakan antarmuka pengguna untuk membuat kata kunci. Jika Anda adalah pengguna baru, Anda mungkin sebaiknya menggunakan :ref:`Wizard Pembuat Kata Kunci InaSAFE <keywords_wizard>` daripada menggunakan editor kata kunci, karena dengan menggunakan wizard pembuatan kata kunci menjadi lebih mudah, terlebih jika Anda belum mengenal/mamahami sistem yang ada.

source: For more general discussion on the keywords system used by |project_name|, see the :ref:`keywords system <keywords_system>` documentation.
id: Untuk diskusi yang lebih umum pada sistem kata kunci yang digunakan oleh InaSAFE, silakan lihat dokumentasi :ref:`sistem kata kunci <keywords_system>`.

source: The keywords editor graphical user interface
id: Editor kata kunci (keyword) di layar pengguna

source: The graphical user interface for keywords may appear in one of two modes:
id: Halaman antarmuka untuk kata kunci dapat tampil dalam salah satu dari dua mode:

source: **Minimal mode**: In this mode, only the following options are provided:
id: **Mode minimal**: Pada mode ini, hanya pilihan-pilihan berikut yang disediakan:

source: **Title** - a friendly name for the dataset which will be displayed in reports, the user interface and so on.
id: **Judul** - nama yang mudah diingat untuk dataset yang akan ditampilkan dalam laporan, halaman antarmuka, dan sebagainya.

source: **Source** - a field to inform from whom/where the dataset is obtained.
id: **Sumber** - kolom untuk menginformasikan dari siapa / dari mana dataset tersebut diperoleh

source: **Category** - A mandatory choice between 'hazard' and 'exposure'.
id: **Kategori** - Pilihan wajib antara 'ancaman' dan 'keterpaparan'.

source: **Subcategory** - An amalgamated subcategory/units picklist (in the case of hazard) or amalgamated subcategory/datatype (in the case of exposure). In this case, the secondary characteristic (units or datatype) are shown in square brackets after the subcategory name e.g. :samp:`flood [m]` is used for subcategory 'flood', units 'm'.
id: **Subkategori** - Sebuah daftar subkategori/unit-unit yang tergabung (jika kasusnya ancaman) atau subkategori/tipe data yang tergabung (jika kasusnya paparan). Pada kasus ini, karakteristik sekunder (unit atau tipe data) ditunjukan pada kurung persegi setelah nama subkategori contohnya :samp:`banjir [m]` digunakan untuk subkategori 'banjir', unit 'm'

source: This is an example of the keywords editor in minimal mode:
id: Berikut ini adalah contoh editor kata kunci dalam mode minimal:

source: *Opened keyword editor window*
id: *Tampilan jendela editor kata kunci yang telah terbuka*

source: **Advanced mode**: In this mode several extra options are provided in addition to the minimal mode options. Unlike minimal mode, in advanced mode only basic validation is performed and the user is given more flexibility to manually define and remove key/value pairs. Three additional sections are available:
id: **Mode lanjutan**: Pada mode ini, disediakan beberapa pilihan tambahan sebagai tambahan untuk pilihan pada mode minimal. Tidak seperti mode minimal, pada mode lanjutan hanya validasi dasar yang dilakukan dan pengguna diberikan lebih banyak keleluasaan untuk mendefinisikan dan menghapus pasangan kunci/nilai secara manual. Tiga bagian tambahan yang disediakan yaitu:

source: **Predefined** - In this section, the user selects from a constrained list of keywords, enters any value and then adds the key/value pair to the keywords list (see below).
id: **Yang Telah Ditentukan** - Pada bagian ini, pengguna memilih dari daftar kata kunci terkendala, memasukkan nilai dan kemudian menambahkan pasangan kunci/nilai ke dalam daftar kata kunci (lihat dibawah ini).

source: **User defined** - In this section, there is no constraint on the keywords entered - any single lower case word will be accepted for both the key and the value components.
id: **User defined** - Pada bagian ini, tidak ada kendala pada kata kunci yang dimasukkan - setiap kata dalam huruf kecil akan diterima untuk kedua komponen baik kunci dan nilai.

source: **Current keywords** - In this area a complete list of all the keywords for the dataset is displayed. The keywords list here is updated when any changes are made in both the simple and advanced mode editors. It is also possible in this area to manually remove unwanted keywords using the :guilabel:`Remove selected` button. Multiple keywords can be removed in a single operation by holding :kbd:`CTRL` and clicking on multiple keyword entries in the current keywords list and then clicking :guilabel:`Remove selected`.
id: **Kata Kunci Saat Ini** - Pada bagian ini, telah ditampilkan daftar semua kata kunci yang lengkap untuk dataset. Daftar kata kunci disini telah diperbarui seketika setiap terjadi perubahan yang dibuat pada mode editor sederhana maupun lanjutan. Pada bagian ini juga dimungkinkan untuk menghapus kata kunci yang tidak diinginkan secara manual dengan menggunakan tombol :guilabel:`Hilangkan yang dipilih'. Beberapa kata kunci dapat dihapus dalam satu operasi dengan menekan :kbd:`CTRL` kemudian klik pada beberapa kata kunci dalam daftar kata kunci saat ini, dan selanjutnya klik :guilabel:`Hilangkan yang dipilih`.

source: *Advanced mode of keyword editor*
id: *Editor kata kunci mode lanjutan*

source: Switching from hazard to exposure will clear parts of the GUI since most keywords are category dependent. In particular, selecting **'hazard'** will remove the **'datatype'** key/value pair, and selecting **'exposure'** will remove the **'units'** key value pair.
id: Beralih dari ancaman ke keterpaparan akan membersihkan beberapa bagian dari GUI karena pada umumnya sebagian besar kata kunci tergantung pada kategorinya. Secara khusus, pemilihan **'ancaman'** akan menghapus pasangan kunci/nilai **'datatype'**, dan pemilihan **'keterpaparan'** akan menghapus pasangan kunci/nilai **'unit'** .

source: Invoking the keywords editor
id: Membuka editor kata kunci (keyword editor)

source: The keywords editor can be invoked by selecting any layer in the QGIS Layers panel and then going to :menuselection:`Plugins ‣ InaSAFE ‣ Keyword Editor`. Alternatively, you may click the :guilabel:`Keywords Editor` button on the toolbar:
id: Editor kata kunci dapat dipanggil dengan memilih suatu *layer* pada panel daftar *layer* QGIS dan kemudian menggunakan :menuselection:`Plugins --> InaSAFE --> Editor Kata Kunci InaSAFE`. Atau, Anda juga dapat mengklik :guilabel:`Editor Kata Kunci InaSAFE` pada *toolbar*:

source: *InaSAFE toolbar*
id: *Toolbar InaSAFE*

source: If you have not selected a layer, the keyword editor icon in the toolbar and menus will be disabled and appear greyed out.
id: Jika Anda belum memilih salah satu *layer*, ikon editor kata kunci pada *toolbar* dan menu akan nampak tidak aktif dan bewarna abu-abu.

source: Saving your edits
id: Menyimpan hasil editan Anda

source: To save your keyword edits, click the :guilabel:`OK` button and the :file:`*.keywords` file will be written to disk.
id: Untuk menyimpan perubahan keyword Anda, klik tombol :guilabel:`OK`, maka *file* :file:`*.keywords` akan ditulis dalam *disk*.

source: Cancelling your edits
id: Membatalkan hasil editan Anda

source: Cancel your changes at any time by clicking the :guilabel:`Cancel` button. No changes will be written to disk and the :file:`*.keywords` file will remain in its original state.
id: Anda dapat membatalkan perubahan Anda kapan saja dengan mengklik tombol :guilabel:`Cancel`. Tidak ada perubahan yang akan ditulis dalam *disk* dan *file* :file:`*.keywords` akan tetap dalam keadaan semula.
