Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/application-help/minimum_needs.po
Languages: id

source: Minimum Needs Tool
id: Alat kebutuhan minimum

source: The purpose of the minimum needs tool is to provide a quick method of calculating support requirements (in terms of food, water, etc.) for displaced persons.
id: Tujuan dibuatnya *tool* kebutuhan minimum adalah untuk memberikan metode yang cepat untuk menghitung kebutuhan pendukung (dalam hal ini seperti makanan, air, dll) untuk para pengungsi.

source: The minimum needs are based on 'Perka 7/2008' according to the following default formulas:
id: Kebutuhan minimum dibuat berdasarkan 'Perka 7/2008' dengan rumus berikut:

source: 400g rice per person per day (2.8kg per week)
id: 400g nasi per orang per hari (2.8kg per minggu)

source: 2.5l drinking water per person per day (17.5l per week)
id: 2.5l air minum per orang per hari (17.5l per minggu)

source: 15l clean water per person per day (105l per week)
id: 15l air bersih per orang per hari (105l per minggu)

source: one family kit per family per week (assumes five people per family which is not specified in perka)
id: 1 perlengkapan keluarga untuk setiap 1 keluarga per minggu (diasumsikan satu keluarga terdiri dari 5 orang, namun hal ini tidak ditentukan dalam perka)

source: 20 people per toilet
id: 20 orang per toilet

source: In the current version of |project_name|, these guidelines cannot be adjusted by the user. In a future version we will provide this facility.
id: Dalalm versi |project_name| sekarang, panduan ini tidak dapat disesuaikan oleh pengguna. Untuk versi selanjutnya kami akan menyediakan fasilitas tersebut.

source: In order to use this tool, you must first load a polygon layer in QGIS that contains areas (e.g. administrative areas) with an attribute that represents the number of displaced people in each area.
id: Untuk menggunakan alat ini, pertama Anda harus memuat *layer* poligon pada QGIS yang mana *layer* tersebut memiliki area (misalnya batas administrasi) dengan sebuah atribut yang merepresentasikan jumlah pengungsi di setiap area.

source: When the layer is loaded, click on the :guilabel:`Minimum Needs` tool in the toolbar:
id: Ketika layer sudah dimuat, klik pada alat :guilabel:`Kebutuhan Minimum` pada toolbar:

source: *Minimum Needs Tool*
id: *Tool Kebutuhan Minimum InaSAFE*

source: In the dialog that appears, choose the QGIS layer that contains the administrative boundaries and then select the attribute in that layer that represents the number of displaced people.
id: Pada dialog yang muncul, pilih layer QGIS yang memiliki batas administrasi dan lalu pilih atribut pada layer yang memiliki jumlah pengungsi.

source: When you are ready, click the :guilabel:`OK` button in the dialog.
id: Ketika Anda siap, klik tombol :guilabel:`OK` pada kotak dialog.

source: After the analysis is completed, new keywords will be associated with the layer that indicate the needs according to the formulas defined above.
id: Setelah analisis selesai, kata kunci baru akan terkait dengan layer yang mengindikasikan kebutuhan sesuai dengan formula yang didefinisikan di atas.
