Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/application-help/user_extents.po
Languages: id

source: User Extents
id: Jangkauan Pengguna

source: As of version 2.2, it is possible to explicitly define the extents that should be used for the analysis. You can use the new :menuselection:`Plugins-->InaSAFE-->Set the analysis area for InaSAFE` to invoke the extents selection dialog.
id: Semenjak versi 2.2, memungkinkan untuk menentukan jangkauan yang digunakan untuk analisis. Anda bisa menggunakan alat :menuselection:`Plugins-->InaSAFE-->Mengatur Area analysis untuk InaSAFE` untuk membuka dialog area analisis InaSAFE.

source: User extents dialog
id: Dialog jangkauan pengguna

source: It is important do understand the logical workflow for your custom defined extents and their relation to the layer and viewport extents. There are three possible permutations for the basic extents clipping behaviour:
id: Penting untuk mengerti alur logika untuk area jangkauan sesuai dengan keinginan sendiri dan kaitannya pada layer dan tampilan jangkauan. Terdapat tiga permutasi yang memungkinkan untuk perilaku dari pemotongan jangkauan dasar:

source: **No clipping**: use full extents of the union of the hazard and exposure
id: **Tanpa pemotongan**: menggunakan jangkauan tampilan penuh dari penggabungan bencana dan paparan

source: datasets regardless of your current viewport (where you are zoomed to on the map. You can enable this behaviour in the options dialog by unticking :guilabel:`Clip datasets to visible extents before analysis`.
id: Dataset tanpa memperhatikan tampilan peta anda (dimana anda memperbesar di peta). Anda dapat mengaktifkan perilaku ini melalui dialog pengaturan dengan menghilangkan tanda centang :guilabel:`Potong dataset ke tampilan jangkauan sebelum analisis`.

source: **Clip to visible viewport extents**: use the common overlapping area of
id: **Potong ke tampilan yang terlihat**: menggunakan luasan perpotongan hasil singgungan dari

source: hazard, exposure and the current extents for the analysis (enable this behaviour by ticking :guilabel:`Clip datasets to visible extents before analysis`).
id: ancaman, paparan dan luasan jangkauan analisis sekarang (untuk mengaktifkan perilaku ini, centang :guilabel:`Potong dataset ke tampilan yang terlihat sebelum analisis`)

source: **Clip to the user defined extents**: use the common overlapping area of
id: **Potong sesuai luasan pengguna**: menggunakan luasan perpotongan hasil singgungan dari

source: hazard, exposure and the user defined extents for the analysis (enable this behaviour by using :menuselection:`Plugins-->InaSAFE-->Set the analysis area for InaSAFE`).
id: ancaman, paparan, dan dan luasan pengguna untuk analisis (aktifkan perilaku ini dengan menggunakan :menuselection:`Plugins-->InaSAFE-->Mengatur area analisis untuk InaSAFE`).

source: When you select an area using the user extents dialog (either by pressing the :guilabel:`Select on map` button, or by manually typing the extents coordinates) the user extent will be shown with a blue rectangle on the map if you have rubber band previews enabled. Creating a user defined analysis extent will enable the third behaviour described above, and any analysis done will disregard the current viewport extents and only consider the intersection of the user defined analysis ares and the hazard and exposure layers.
id: Ketika Anda memilih luasan dengan menggunakan dialog luasan pengguna (baik dengan menekan tombol :guilabel:`Pilih pada peta` , atau dengan mengetik koordinat luasan secara manual) luasan pengguna akan ditampilkan dengan segiempat biru pada peta jika Anda mengaktifkan *rubber band previews*. Membuat luasan analisis pengguna akan mengaktifkan perilaku ke tiga yang dijelaskan di atas, dan analisis apapun yang dilakukan akan mengabaikan luasan tampilan saat ini dan hanya mempertimbangkan perpotongan dari yang ditetapkan luasan pengguna analisis dan lapisan bahaya dan lapisan paparan.

source: **Note:** To disable user defined extents, :menuselection:`Plugins-->InaSAFE-->Set the analysis area for InaSAFE` then click the :guilabel:`clear` button.
id: **Catatan:** Untuk menonaktifkan jangkauan luasan pengguna, :menuselection:`Plugins-->InaSAFE-->Mengatur area analisis untuk InaSAFE` dan kemudian klik tombol :guilabel:`hapus`.
