Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/intermediate/osm/304-creating-josm-file-presets.po
Languages: id

source: When the preset we create is selected, we will also automatically add the tag **building=yes**, and we will create a tag with the key name that the user can fill in with using a text box.
id: Ketika preset yang kita buat telah dipilih kita dapat dengan otomatis menambahkan tag **building=yes**, dan kita akan membuat sebuah tag dengan key name yang dapat kita isi dengan menggunakan sebuah text box seperti gambar di bawah.

source: Now look at the possible tags we have described in the table above. What is the best way to represent each of these on the form? For name, we want to create a text box, because the user can fill in any name that they want for this tag.
id: Sekarang coba lihat pada tag yang memungkinkan untuk kita gunakan dari tabel yang telah dijelaskan di atas. Apa cara terbaik untuk merepresentasikannya? Untuk name, kita mau membuat sebuah text box, karena kita dapat mengisinya dengan nama apapun yang kita inginkan untuk tag ini.

source: For **utility:water**, **utility:phone**, and **utility:internet**, there are four possible values that the user can select from on our form, so the best way to add this is with a combo box - that is, a drop-down menu where the user can select one of the options. The tag **utility:electrical** only has two possible values, yes or no, so the best way to show this on our form is with a checkbox, although we could use a drop-down box if we wanted as well. When we are finished our form should look like this:
id: Untuk **utility:water**, **utility:phone**, dan **utility:internet**, terdapat empat value yang memungkinkan yang dapat kita pilih dari form kita, jadi cara terbaik untuk menambahkannya adalah dengan menggunakan combo box – yaitu sebuah menu dropdown yang bisa dipilih ke bawah seperti ini. Tag **utility:electrical** hanya memiliki dua value yang memungkinkan, yes atau no, jadi cara terbaik untuk menunjukkannya pada form adalah dengan menggunakan checkbox/lihat kotak kecil di samping tulisan Akses Listrik pada gambar di bawah, meskipun kita dapat menggunakan sebuah kotak pilihan pula jika kita inginkan. Ketika kita selesai membuatnya maka form akan tampak seperti ini:

source: Open a text editor and follow along as we create the XML for this preset. A simple and common editor to use on Windows is called Notepad. DO NOT use a word processing program like Microsoft Word.
id: Buka sebuah editor text dan ikuti cara-cara berikutnya untuk membuat sebuah XML untuk preset ini. Sebuah editor yang sederhana dan banyak digunakan pada Windows adalah Notepad. JANGAN menggunakan sebuah word processing program seperti Microsoft Word.

source: First, we need to create a root element in our XML so that JOSM knows it is a presets file.
id: Pertama-tama, kita perlu membuat sebuah elemen utama/root element di dalam XML kita sehingga JOSM mengenali nya sebagai sebuah file preset.

source: Next let’s create an element called <group>. This is not actually necessary because we are only creating one preset, but it will demonstrate how we can create submenus with many different options on our presets menu. Don’t forget to add the closing tags **</group>** and **</presets>** to your elements.
id: Berikutnya mari kita membuat sebuah elemen yang disebut <group>. Bagian ini sebenarnya tidak terlalu diperlukan karena kita hanya membuat satu preset, namun ini akan mendemonstrasikan bagaimana kita dapat membuat submenu dengan menggunakan banyak opsi berbeda pada menu preset yang kita miliki. Jangan lupa untuk menambahkan tag penutup **</group>** dan **</presets>** pada elemen Anda.

source: Now we can create an item on our menu. We want to create an <item> element inside of the group element. Add the following text:
id: Sekarang kita dapat membuat sebuah item pada menu kita. Kita ingin membuat sebuah elemen <item> di dalam group elemen tersebut. Tambahkan text seperti berikut:

source: Inside the **<item>** element we will add the text box, combo boxes and check box that we want on our form. Add the following inside your **<item>** element:
id: Di dalam elemen **<item>** kita akan menambahkan text box, combo box, dan check box yang inginkan ke dalam form. Tambahkan text berikut ini ke dalam elemen **<item>** Anda:

source: When you are finished your file will look like this:
id: Ketika Anda selesai, file Anda akan terlihat seperti ini:

source: Much of this is similar to what you saw previously. Let’s analyse it. Inside the **<item>** element we have created six more elements:
id: Banyak dari hal-hal berikut ini yang telah Anda lihat sebelumnya. Mari kita analisis. Di dalam elemen **<item>** kita telah membuat enam buah elemen baru:

source: Can you guess what each of these elements do? They create different items on our presets form in JOSM. The first line, **<key key="building" value="yes"/>**, does not display anything on our form, but tells JOSM to automatically apply the tag **building=yes** to an object when this preset is selected.
id: Bisakah Anda menyebutkan apa yang dapat dilakukan setiap elemen tersebut? Mereka membuat item-item berbeda pada form presets di JOSM. Baris pertama, **<key key=”building” value=”yes”/>**, tidak menampilkan apapun pada form, namun memberitahu JOSM untuk secara otomatis memberikan tag **building=yes** pada objek ketika preset ini dipilih.

source: The second line, **<text key="name" text="Name" default=""delete_if_empty="true" />**, creates a text field with the key name, as we saw when we looked at the presets XML in the previous section.
id: Pada baris kedua, **<text key="name" text="Nama" default="" delete_if_empty="true" />**, membuat sebuah field text dengan key name, seperti yang kita saksikan ketika kita melihat pada preset XML di bagian sebelumnya.

source: We have three **<combo>** elements and each element has several attributes. key indicates what key should be created for the tag. Text indicates what text should be displayed on our form. Values are the possible values that the user can select in the drop-down box. And we’ve added something new - the attribute **display_values**, which let’s us show different text in the drop-down boxes than the values that will be created. This is useful if we want the form to be more descriptive about the options a user can select, or if we want the display values to be in a different language from English.
id: Kita memiliki tiga elemen **<combo>** dan tiap elemen memiliki beberapa atribut. *Key* mengindikasikan bahwa *key* seharusnya dibuat untuk *tag*. Text mengindikasikan apa yang seharusnya ditampilkan pada form. *Values* merupakan value-value yang memungkinkan yang dapat kita pilih melalui dropdown box. Dan kita telah menambahkan sesuatu yang baru, yaitu atribut **display_values**, yang dapat menampilkan text berbeda pada dropdown box daripada value yang akan dibuat. Hal ini sangat berguna bila kita ingin form yang dibuat lebih bersifat deskriptif mengenai pilihan-pilihan yang dapat dipilih, atau jika kita mau value yang ditampilkan menggunakan bahasa selain Bahasa Inggris.

source: Lastly, we’ve added one new element, a **checkbox**. The code for this is simple, **<check key="utility:electrical"text="Electricity Access" />**. This creates a check box on our form. When it is selected, JOSM will add a tag to our object that says **utility:electrical=yes**.
id: Terakhir, kita telah menambahkan satu elemen, sebuah **checkbox**. Kode yang digunakan cukup sederhana, **<check key=”utility:electrical” text=”Akses Listrik” />**. Kode tersebut akan membuat sebuah *checkbox* pada form kita. Ketika *checkbox* ini dipilih diberi tanda centang, JOSM akan menambahkan *tag* pada objek yang menandakan **utility:electrical=yes**.

source: Finally, let’s save the XML file so that we can load it into JOSM. In Notepad, go to :menuselection:`File ‣ Save`.
id: Akhirnya, mari kita simpan file XML sehingga kita dapat memasukkannya ke dalam JOSM. Pada Notepad, pilih :menuselection:`File ‣ Simpan`.

source: Type in :kbd:`household_access.xml` as the filename.
id: Ketik :kbd:`Akses_Rumah_Tangga_Preset.xml` sebagai nama file.

source: In the box that says :guilabel:`Save as type:` be sure to select :guilabel:`All Files`, because we don’t want to save the file as a text document, but rather as an XML document.
id: Pada box yang mengatakan :guilabel:`Save as type:` pastikan Anda memilih :guilabel:`All Files`, karena kita tidak ingin menyimpan file sebagai dokumen teks, melainkan sebuah dokumen XML.

source: Click :guilabel:`Save`.
id: Klik :guilabel:`Simpan`.

source: 6. Try It!
id: 6. Cobalah!

source: Now let’s open our presets file in JOSM and see how it looks!
id: Sekarang coba buka file preset tadi menggunakan JOSM dan lihat bagaimana tampilannya!

source: Open the Preferences in JOSM and go to :guilabel:`Tagging Presets`, as you did previously.
id: Buka Preferensi pada JOSM dan pilih :guilabel:`Tagging Presets`, seperti yang telah Anda lakukan sebelumnya.

source: On the right side next to Active presets click on the :guilabel:`+` button.
id: Pada bagian kanan di sebelah Preset yang aktif, klik tombol :guilabel:`+`.

source: Type :kbd:`Household Presets` into the :guilabel:`Name` field.
id: Ketik :kbd:`Preset Rumah Tangga` pada kolom :guilabel:`Nama`.

source: Next to URL / File, open the xml file that you just created.
id: Di sebelah URL/File, buka file XML yang baru saja kita buat.

source: Click :guilabel:`OK`, and :guilabel:`OK` again to save your preferences.
id: Klik :guilabel:`OK`, dan :guilabel:`OK` lagi untuk menyimpan preferensi.

source: Create a new layer and add a point.
id: Buat sebuah layer baru dan tambahkan sebuah titik.

source: Go to the Presets menu. You should see the menu that you just created!
id: Pergi ke menu Presets. Anda sekarang akan dapat melihat menu yang baru saja Anda buat!

source: :ref:`Go to next module --> <using-private-data-store>`
id: :ref:`Modul selanjutnya --> <using-private-data-store>`
