Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/intermediate/osm/304-creating-josm-file-presets.po
Languages: id

source: Module 4: Creating JOSM File Presets
id: Modul 4: Membuat File Preset Pada JOSM

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Understand tags
id: Memahami tags

source: Understand XML
id: Memahami XML

source: Understand keys and values
id: Memahami *keys* dan *values*

source: Make presets
id: Membuat preset

source: Put preset files into JOSM
id: Memasukkan file preset ke dalam JOSM

source: Apply new presets to an object
id: Menerapkan preset baru pada sebuah objek

source: By now you probably have a good understanding of how objects are drawn in JOSM, and how to add information to these objects to describe what they are. You add attributes to a point, line or shape by attaching tags to it. By using the JOSM presets menu, you can easily attach the correct tags to an object by finding the type of object you want to create through a menu, and then filling in information in a form. In this module we will review tags and presets once more, and then learn how we can create our own presets menus to use in JOSM.
id: Sekarang Anda mungkin telah memiliki pemahaman yang baik mengenai bagaimana berbagai objek dapat digambar menggunakan JOSM, dan bagaimana Anda menambahkan informasi ke sebuah objek dan menjelaskan apa objek-objek tersebut. Anda menambahkan atribut kepada titik, gasir, atau berbagai bentuk dengan memberikan tag kepada objek tersebut. Dengan menggunakan menu preset pada JOSM, Anda dapat dengan mudah mencantumkan tag yang benar kepada sebuah objek, kemudian Anda dapat mengisi informasinya ke dalam form yang ada. Pada bab ini kita akan membahas kembali apa itu tag dan preset sekali lagi, dan mempelajari bagaimana kita membuat menu preset kita sendiri pada JOSM.

source: 1. Tags and presets
id: 1. Tags dan presets

source: Remember that after you draw an object on the map in JOSM, you need to attach tags in order to describe what it is, its name and any other attributes. For example when you want to create a clothing shop with the name “Some Clothing Shop”, you need two tags - one to describe the point as a clothing shop, and one to hold the name. In JOSM, the tags are shown in the Properties panel when an object is selected.
id: Anda tentunya ingat bahwa setiap kali Anda selesai menggambar sebuah objek ke dalam peta di JOSM, Anda perlu menambahkan tag kepada objek tersebut agar dapat mendeskripsikan apa objek tersebut, namanya, dan berbagai atribut lainnya. Sebagai contoh ketika Anda mau membuat sebuah toko pakaian dengan nama “Some Clothing Shop”, Anda membutuhkan dua buah tag – satu tag untuk menjelaskan bahwa titik tersebut adalah sebuah toko pakaian, dan satu tag lainnya untuk menempatkan nama dari toko tersebut. Pada JOSM, tag-tag tersebut ditunjukkan pada jendela Properti ketika objek yang dimaksud dipilih.

source: Tags consist of two parts, the **key** and the **value**. The key typically defines the type of information you are attaching, and the value defines the specific object. Here we have two tags, and hence two pairs of keys and values.
id: Tag terdiri dari dua bagian, yaitu **key** dan **value**. Key biasanya mendefinisikan tipe informasi yang Anda berikan, dan value mencantumkan informasi yang lebih spesifik. Contohnya terdapat dua buah tag, yang terdiri dari dua pasang yaitu key dan value.

source: When we create a point with these tags, JOSM knows to display the icon like this:
id: Ketika kita membuat sebuah titik menggunakan tag ini, JOSM akan mengenalinya dengan menampilkan ikon atau simbol seperti ini:

source: And when we look at this on the `OpenStreetMap <http://openstreetmap.org>`_ website, the object looks like this:
id: Dan ketika kita melihat ini pada website `OpenStreetMap <http://openstreetmap.org>`_ , objek tersebut akan tampak seperti ini:

source: The reason this works is because we’ve applied the appropriate **tags**.
id: Hal ini dapat terjadi karena sebelumnya kita telah memasukkan **tag** yang sesuai.

source: Because OSM is so open, anybody can add any tags they want to anything. But what happens when mappers in England disagree with mappers in Japan about the best way to tag something? For example, it is important that all schools have the same tag describing it as a school. If some people tag schools as **amenity=school** but others tag them as **education=school**, it is a problem. Hence, people must agree on how to tag places.
id: Karena OpenStreetMap sangat terbuka bagi umum, siapapun dapat menambahkan tag yang mereka inginkan pada objek manapun. Namun bagaimana jika ada orang di Inggris yang tidak setuju dengan orang di Jepang mengenai cara terbaik dalam memberikan tag pada suatu objek? Sebagai contoh, sangat penting jika semua sekolah memiliki tag yang sama yang mendeskripsikannya sebagai sebuah sekolah. Jika beberapa orang ingin memberikan tag pada sekolah berupa **amenity=school** namun beberapa orang lainnya ingin memberikan tag sebagai **education=school**, ini bisa menjadi masalah. Oleh karena itu, kita semua harus setuju mengenai bagaimana memberikan tag pada sebuah tempat.

source: OSM has been around for many years now, so there is an accepted standard for how to identify most types of locations, and those are listed on the Map Features page on the OSM Wiki.
id: OpenStreetMap telah digunakan selama beberapa tahun terakhir, maka tentunya sudah ada standar mengenai bagaimana mengidentifikasi sebagian besar jenis lokasi, dan yang telah terdaftar dalam halaman Map Features pada Wiki OSM.

source: This web page has grown longer and longer over the years as people have sought to map more and more things and have needed more tags to do so. It is impossible to remember all of these tags, and quite a hassle to look them up every time you need them. Hence, JOSM has a Presets menu which makes it much easier to apply the correct tags to an object. With the Presets menu, we can easily find the entry for school, enter information into a form and not have to worry about whether the correct tag is **amenity=school** or **education=school** or something else entirely.
id: Halaman situs ini telah berkembang selama beberapa tahun ini seiring dengan semakin banyak orang yang memetakan semakin banyak objek dan merasa membutuhkan tag untuk mendukung kegiatannya. Bisa dikatakan tidak mungkin bagi kita untuk dapat mengingat semua tag yang ada, dan cukup merepotkan bila kita harus melihat ke website setiap kali kita ingin memberi tag pada objek. Oleh karena itu, JOSM memiliki sebuah menu Preset yang akan mempermudah kita dalam memberikan tag yang benar kepada sebuah objek. Dengan menu Preset, kita dapat dengan mudah menemukan tag untuk sekolah, memasukkan informasi ke dalam form yang ada, dan tidak perlu khawatir mengenai mana tag yang benar apakah **amenity=school** atau **education=school** atau yang lainnya lagi.

source: Notice that when you add attributes using the presets menu, the correct tags are automatically added in the Properties menu on the right.
id: Kenali bahwa ketika Anda menambahkan atribut menggunakan menu preset, maka tag yang benar secara otomatis ditambahkan pada bagian menu Properti di sebelah kanan layar.

source: JOSM comes with most of the presets that you will need already loaded, but sometimes you may want to add your own presets to create tags for the specific type of data you are collecting. The remainder of this module will explain how to create a custom Presets menu.
id: JOSM telah menyediakan sebagian besar preset yang Anda butuhkan, namun terkadang Anda mungkin mau menambahkan preset yang Anda inginkan untuk membuat tag untuk beberapa tipe data yang spesifik. Pada chapter ini akan dijelaskan mengenai bagaimana membuat sebuah menu Preset sendiri.

source: 2. Introduction to XML
id: 2. Pengenalan XML

source: In order to create our own Presets menu, we first need to understand a language called XML. XML, which stands for *Extensible Mark-up Language*, is a language similar to HTML. The key difference is that XML is designed to carry data, not display it. Many applications on the internet use XML to transmit data, including OSM. XML uses **elements**, and each element can contain child elements inside it. For example, let’s imagine that we want to create an XML file that contains data about a restaurant menu. We must create a **root element** to contain all the data about our menu. Our root element will have an opening and a closing tag, like this: ::
id: Dalam rangka membuat menu Preset Anda sendiri, pertama-tama kita perlu mengerti bahasa XML. XML, yang merupakan kependekan dari *Extensible Mark-up Language*, adalah sebuah bahasa yang mirip dengan HTML. Perbedaan utamanya adalah XML didesain untuk membawa data, bukan menampilkannya. Banyak aplikasi di internet yang menggunakan XML untuk mengirimkan data, termasuk OpenStreetMap. XML menggunakan **elemen**, dan setiap elemen dapat mengandung anak elemen di dalamnya. Sebagai contoh, mari kita bayangkan bahwa kita mau membuat sebuah file XML yang mengandung data mengenai menu restoran. Kita harus membuat sebuah file XML yang mengandung semua data mengenai menu tersebut, yang dikenal sebagai **root element**. Elemen utama kita akan memiliki tag pembuka dan penutup seperti ini: ::

source: Information is contained inside an element, and within each element there can be more elements. ::
id: Informasi terkandung dalam sebuah elemen, dan dalam setiap elemen bisa jadi terdapat elemen-elemen lainnya. ::

source: In this example we have placed two **<item>** elements within our **<menu>** element to describe two different items that are contained in the menu. Each item contains two more elements in them, **<cost>** and **<description>**. Notice also how we have written name=”Hamburger” inside the opening **<item>** tag. This is called an attribute, and adds information about the element.
id: Pada contoh ini kita telah meletakkan dua elemen **<item>** dalam elemen **<menu>** kita untuk menjelaskan dua hal berbeda yang terdapat di dalam menu. Setiap hal mengandung dua lagi elemen di dalamnya, **<cost>** dan **<description>**. Lihat juga bahwa bagaimana kita telah menulis name=”Hamburger” di dalam pembuka tag **<item>**. Hal ini disebut atribut, dan memberi informasi mengenai elemen.

source: XML Terminology
id: Terminologi XML

source: **root element:** the outermost element of an XML document, which describes what is contained
id: **root element:** elemen paling penting dari sebuah dokumen XML, yang mendeskripsikan apa yang ada didalamnya

source: **element:** any XML object, contained by opening and closing tags, such as **<item>...data...</item>**
id: element : objek XML apapun, diisi dengan tag pembuka dan penutup, seperti **<item>...data...</item>**

source: **tag:** something contained in brackets, such as **<item>**. **<item>** is the opening tag of an element, and **</item>** is the closing tag.
id: **tag:** sesuatu yang terdapat di dalam tanda < >, seperti **<item>**. **< item>** adalah tag pembuka pada sebuah elemen, dan **</item>** adalah tag penutup.

source: **attribute:** a piece of information contained inside a tag, such as **name=“Hamburger”**
id: **attribute:** sebuah informasi yang ada di dalam sebuah tag, seperti **name=“Hamburger”**

source: Using XML to hold and transmit data is great because it is easy to understand for computers. To provide one more example, this is what the XML might look like for the point we created in JOSM previously. ::
id: Dengan menggunakan XML untuk menerima dan mengirim/memancarkan data merupakan cara yang baik karena hal tersebut mudah dimengerti untuk komputer. Untuk memberikan satu lagi contoh, beginilah bagaimana tampilan XML untuk titik yang telah kita buat sebelumnya di JOSM:

source: This XML has a root element **<osm>** which indicates that OSM data is contained inside. Then it has one **<node>** element which is the OSM way of describing a **point**. The node has numerous attributes, including a unique id number, the coordinates of the point, the user who created the point, and some additional information which we will not discuss right now. Between the opening **<node>** tag and the closing **</node>** tag there are two more elements of type **<tag>**. Each **<tag>** has an attribute k and an attribute v. These are the keys and values that we added in JOSM. Notice that the **<tag>** elements don’t have a closing **</tag>**. This is because they don’t have any other elements contained within them, but instead have a forward slash indicating that it does not require a closing tag. **<tag ...attributes />**
id: XML ini memiliki elemen utama **<osm>** yang menunjukkan bahwa data OpenStreetMap terkandung di dalamnya. Lalu XML ini juga memiliki suatu elemen **<node>** yang merupakan cara bagi OpenStreetMap untuk mendeskripsikan sebuah **titik**. Node tersebut memiliki sejumlah atribut, termasuk suatu nomor id yang unik, koordinat dari titik tersebut, pengguna yang membuat titik tersebut, dan beberapa informasi tambahan yang tidak akan kita bahas sekarang. Di antara tag pembuka **<node>** dan tag penutup **</node>**, ada dua tipe elemen **<tag>** lagi. Setiap **<tag>** memiliki sebuah atribut k dan sebuah atribut v. Mereka adalah kunci/keys dan nilai/values yang telah kita tambahkan di JOSM. Perhatikan bahwa elemen **<tag>** tersebut tidak memiliki **</tag>** penutup. Hal ini disebabkan karena meraka tidak memiliki elemen lain yang terdapat di dalamnya, melainkan memiliki slash depan yang menandakan bahwa mereka tidak memerlukan tag penutup **<tag...attributes/>**

source: 3. JOSM presets files
id: 3. File preset JOSM

source: As you’ve already discovered, JOSM comes pre-loaded with a presets menu that includes most common types of geographic options. But sometimes you want to add additional presets for specific information that you want to collect. You can create your own presets menu by writing it in XML, and then loading it in JOSM. First, let’s look at how we can load additional presets menus into JOSM.
id: Seperti yang telah anda ketahui, JOSM telah dilengkapi dengan menu yang telah diatur sebelumnya, yang memiliki tipe menu pilihan geografis yang paling umum. Namun kadang, Anda ingin menambahkan menu tambahan untuk informasi spesifik yang ingin Anda kumpulkan. Anda dapat membuat menu Anda sendiri dengan menuliskannya dalam XML, kemudian memuatnya di dalam JOSM. Pertama, mari lihat bagaimana kita dapat memuat menu-menu tambahan ke dalam JOSM.

source: Open JOSM and open the Preferences menu by going to :menuselection:`Edit ‣ Preferences`.
id: Buka JOSM dan buka menu Preferensi dengan cara klik :menuselection:`Edit ‣ Preferensi`.

source: Click on the third icon from the top which looks like this:
id: Klik pada ikon ketiga dari atas yang tampilannya seperti ini:

source: Click on the third tab labelled :guilabel:`Tagging Presets`.
id: Klik pada tab ketiga yang bertuliskan :guilabel:`Tagging Presets`.

source: Select :guilabel:`Buildings by Kate Chapman` and click on the right arrow button to add it to Active presets.
id: Pilih :guilabel:`Buildings by Kate Chapman` dan klik pada anak panah kanan untuk menambahkannya pada Aktif Preset.

source: Click :guilabel:`OK`.
id: Klik :guilabel:`OK`.

source: Create a new layer by going to :menuselection:`File ‣ New Layer`.
id: Buat Layer baru dengan memilih :menuselection:`Berkas ‣ Layer Baru`.

source: Create a point and make sure it is selected.
id: Buat suatu titik dan pastikan titik tersebut terpilih

source: Go to the Presets menu. You should now see the presets that you added at the bottom.
id: Pergi ke menu Presets. Sekarang Anda dapat melihat preset yang Anda tambahkan berada dibagian bawah.

source: Click on :menuselection:`Building` to see the the building presets form.
id: Klik :menuselection:`Building` untuk melihat form pengisian dari preset building.

source: When we added these new presets through the preferences menu, what we were doing is adding an XML file that describes how the new menu should behave. In the next sections, we will learn how to create our own XML presets file that we can load into JOSM.
id: Ketika kita menambahkan menu preset tersebut melalui menu preferensi, yang kita lakukan adalah menambahkan sebuah file XML yang menjelaskan bagaimana perilaku dari menu baru ini. Pada bagian berikutnya, kita akan mempelajari bagaimana membuat file preset XML kita sendiri yang dapat kita muat ke dalam JOSM.

source: 4. A sample presets file
id: 4. Contoh file presets

source: To understand how a presets file is written, let’s first look at the XML for one of the pre-loaded presets in JOSM. When you go to the presets menu and select :menuselection:`Facilities ‣ Culture ‣ Place of Worship` you will see a form like this:
id: Untuk memahami bagaimana suatu file preset ditulis, pertama mari lihat pada XML pada salah satu preset pada JOSM yang telah tersedia. Ketika Anda pada menu Presets memilih :menuselection:`Fasilitas → Budaya → Tempat Beribadah` anda akan melihat form isian seperti berikut:

source: The XML for this form looks like this: ::
id: XML untuk form isian tersebut berbentuk seperti ini: ::

source: This may look complex, but it is not as difficult as it may seem. Let’s walk through it line by line.
id: Mungkin hal ini terlihat rumit, tapi tidak sesulit seperti yang terlihat. Mari kita telusuri baris demi baris.

source: The first line is the opening tag of our root element **<item>**. There are several attributes describing the element.
id: Baris pertama adalah tag pembuka untuk elemen utama kita **<item>**. Ada beberapa atribut yang mendeskripsikan elemen tersebut.

source: The name of what you are creating.
id: Nama dari benda yang Anda buat.

source: The icon of the object. PNGs are the most effective in OSM since they are compressed low-colour graphics with transparent backgrounds.
id: Ikon dari objek tersebut. File PNG merupakan file yang paling efektif dalam OSM karena file tersebut dikompres menjadi grafik berwarna rendah dengan latar tembus pandang.

source: The types of object that this preset can be applied to. Node means it can be applied on a point, way means it can be applied to a line, closedway means it can be applied to a shape, and relation means it can be applied to a relation, which is a type of OSM object we have not discussed. Notice that way is not an option here, because a place of worship cannot be a line - it must be a point or a shape.
id: Tipe dari objek yang dapat diberikan oleh menu preset ini. Node artinya objek ini dapat dinyatakan sebagai titik, way artinya dapat dinyatakan sebagai garis, *closedway* artinya dapat dinyatakan sebagai suatu bentuk tertutup atau polygon , dan relation berarti bahwa objek ini dapat diberlakukan kepada suatu hubungan, yaitu merupakan suatu tipe objek OSM yang belum kita bahas. Perhatikan bahwa garis bukan pilihan di sini, karena tempat ibadah tidak mungkin berupa garis, melainkan pasti berupa titik atau polygon.

source: The second line provides a link to the OSM wiki page for this type of location.
id: Baris kedua menyediakan link ke halaman web wiki OpenStreetMap untuk tipe lokasi seperti ini.

source: The third line has the tag <label> and describes what text should be shown at the top of the form.
id: Baris ketiga memiliki tag <label> dan mendeskripsikan tulisan apa yang harus ditampilkan pada bagian atas dari form isian.

source: **<label text="Edit Place of Worship" />**
id: **<label text="Edit Tempat Beribadah" />**

source: The fourth line describes a tag that will automatically be applied to the object when the preset is selected. In this case, we want the object to have the tag **amenity=place_of_worship**.
id: Baris keempat mendeskripsikan suatu tag yang akan secara otomatis diberlakukan pada objek ketika menu preset dipilih. Dalam kasus ini, kita ingin objek tersebut memiliki tag **amenity=place_of_worship**.

source: The fifth line describes the first thing that will be shown on our form, and how to create a tag when it is filled in. The tag is **<text>** which indicates that the form should have a text box for the user to fill in. The attribute key=“name” describes what key should be used when the tag is created. The value will be whatever the user enters in the text box. The attribute **text=“Name”** describes what should be written on the form next to the text box. The final attribute indicates that no tag should be created if the text box is left empty.
id: Baris kelima mendeskripsikan hal pertama yang akan ditampilkan pada form isian kita, dan bagaimana membuat suatu tag ketika tag tersebut telah diisi. Tag nya adalah **<text>** yang menandakan bahwa form isian tersebut harus memiliki suatu kotak teks untuk diisi oleh pengguna. Atribut key=”name” mendeskripsikan key apa yang harus digunakan ketika tag tersebut telah dibuat. Nilainya akan berupa apapun yang telah dimasukkan oleh pengguna pada kotak teks. Atribut **text=”Name”** menyatakan apa yang seharusnya tertulis pada form di sebelah kotak teks. Atribut yang terakhir menunjukkan bahwa tidak ada tag yang harus dibuat jika kotak teks tidak diisi.

source: The lines after this are similar, but instead of text boxes, drop-down boxes are created where the user can select from different options. The tag used for this is **<combo>**
id: Baris berikutnya serupa, namun bukan berbentuk kotak teks, melainkan sebuah daftar pilihan dimana pengguna dapat memilih dari beberapa pilihan. Tag yang digunakan untuk ini adalah **<combo>**

source: The final line of the XML is the closing tag **</item>**
id: Baris terakhir dari XML ini adalah tag penutup **</item>**

source: 5. Creating your own presets file
id: 5. Membuat file presets Anda sendiri

source: Now follow along as we create our own presets file. We will create an example presets menu which will allow us to tag buildings or points according to the type of utilities access that they have available. For this, let’s invent some new tags:
id: Sekarang ikuti cara kita membuat file preset kita sendiri. Kita akan membuat sebuah contoh menu preset yang bisa membuat kita memberikan tag pada bangunan atau titik tergantung dari tipe fasilitas atau kegunaan yang dimiliki. Untuk itu, mari kita menciptakan beberapa tag baru:

source: Key
id: Kunci

source: Possible Value
id: Nilai yang memungkinkan

source: Does the household have access to water? well indicates it has access to well water. municipal indicates it has pipes running to it. If we want to be less descriptive, we can select yes or no to indicate if the building has water access
id: Apakah rumah tangga memiliki akses terhadap air/water? Well/sumur mengindikasikan rumah tangga memiliki akses terhadap air sumur. municipal mengindikasikan bahwa ada pipa-pipa yang menghubungkannya. Jika kita tidak mau mencantumkan banyak deskripsi, kita dapat memilih 'yes' (ya) atau 'no' (tidak) untuk mengindikasikan apakah bangunan tersebut memiliki akses terhadap air.

source: Does the household have electrical access?
id: Apakah rumah tangga tersebut memiliki akses terhadap listrik?

source: Does the household have phone access? landline indicates that there is a hard phone line in the house. mobile indicates that the household has a mobile phone. If we want to be less descriptive, we can use yes or no
id: Apakah rumah tangga tersebut memiliki akses komunikasi berupa telepon? *Landline* mengindikasikan bahwa ada jaringan telepon yang yang masuk ke rumah. *Mobile* mengindikasikan bahwa rumah tangga tersebut memiliki telepon seluler. Jika kita tidak dapat mencantumkan banyak deskripsi informasi, kita bisa menggunakan yes atau no saja.

source: Same values as for phone, this will indicate if the household has internet access
id: Seperti halnya value untuk telepon, ini akan mengindikasikan apakah rumah tangga tersebut memiliki akses internet.
