Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/old-training/beginner/osm/101-basic-concept-of-osm-website.po
Languages: id

source: Module 1: The OpenStreetMap Website
id: Modul 1: Konsep Dasar Situs *OpenStreetMap*

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Understand the concept of OpenStreetMap
id: Memahami konsep dan pengertian *OpenStreetMap*

source: Understand the definition and objectives of data collection
id: Memahami definisi dan tujuan pengumpulan data

source: Understand the composition of a map
id: Memahami komponen dalam peta

source: Make a hand-drawn sketch of an area
id: Membuat sketsa peta wilayah menggunakan tangan

source: Maps are a good way to convey information. Maps are visual representations of our world. They can often demonstrate an idea better than words. This in turn can also help answer important questions. Where is the closest school or hospital? Who has the least access to these facilities? Where is poverty the most problematic? Questions like these can often best be expressed with maps, and maps can help find solutions to these questions.
id: Peta dapat digunakan dengan baik untuk menyampaikan informasi. Peta merupakan gambaran visual dari dunia kita. Mereka sering dapat mendemonstrasikan sebuah ide lebih baik daripada kata-kata. Ini juga dapat membantu untuk menjawab pertanyaan penting. Dimana sekolah atau rumah sakit? Siapa yang memiliki sedikit akses untuk fasilitas tersebut? Dimanakah lokasi kemiskinan yang paling bermasalah? Pertanyaan seperti ini paling baik diekspresikan dengan peta, dan peta dapat membantu untuk mencari solusi dari pertanyaan-pertanyaan tersebut.

source: Hand-drawn maps
id: Sketsa peta

source: As an exercise, get a pen and paper and draw a map of your town or village. What are the most important things to include on the map? What is the most important information? Spend a few minutes making your map, and when you’re finished, think about why the information you included is important, and who it might be important to.
id: Sebagai sebuah latihan, ambil sebuah alat tulis dan secarik kertas kemudian gambarlah peta kota atau desa tempat tinggal Anda. Hal apakah yang paling penting untuk digambarkan pada peta tersebut? Informasi apa yang paling penting? Silahkan kerjakan peta tersebut dalam beberapa menit, dan ketika sudah selesai, silahkan anda pikirkan kembali kenapa informasi yang ada pada peta anda itu penting untuk diberikan dan kepada siapa saja informasi tersebut dapat berguna.

source: *A village in Indonesia (top), and an example of a hand-drawn map (bottom)*
id: *Sebuah desa di Indonesia (atas), dan sebuah contoh peta yang digambar dengan tangan (bawah)*

source: If your town is like most, you may have drawn some lines to represent roads, possibly a river or stream. Perhaps you added important buildings such as schools and offices, fields, or boundaries. Whatever you drew, you probably used symbols - a line to symbolise a road, a square to symbolise a building, and so on. Your map is a representation of what is on the ground.
id: Jika Anda lebih banyak menggambarkan tentang kota Anda, mungkin Anda menggambarkan beberapa garis untuk merepresentasikan jalanan, atau mungkin juga sebuah aliran sungai. Mungkin Anda juga telah menambahkan bangunan-bangunan penting seperti sekolah dan kantor, lapangan, atau batas wilayah. Apapun yang Anda gambarkan, Anda kemungkinan menggunakan simbol sebuah garis untuk pengaturan simbol jalan, sebuah persegi untuk simbol bangunan, dan seterusnya. Peta Anda merupakan sebuah representasi dari apa yang ada di permukaan bumi.

source: *Examples of Symbols*
id: *Contoh dari simbol-simbol.*

source: Your map is informative. You might use a map like this to explain to someone where different places are, where problems are in your community, or merely to help someone find their way around. The use of your map is limited though. There is only one copy of the map and the way you drew it may make sense to you, but perhaps not to someone else who would have drawn their own map in a different way. Because your map is merely on paper, it is difficult to get that information to others. This is why making your map on a computer, in such a way that anyone can access it, can be much more valuable.
id: Peta Anda bersifat informatif. Anda mungkin akan menggunakan peta seperti ini untuk menjelaskan kepada seseorang dimana tempat-tempat berbeda berada, dimana permasalahan yang terdapat dalam komunitas Anda, atau lebih tepatnya untuk membantu seseorang menemukan tempat tujuannya. Namun, kegunaan peta Anda ini terbatas. Dimana hanya terdapat satu buah salinan dari peta dan dari cara Anda menggambarkannya mungkin Anda memahami isinya, tetapi tidak bagi orang lain yang menggambarkan peta tersebut dengan cara yang berbeda. Karena peta Anda ini digambarkan hanya pada secarik kertas, sangat sulit untuk menyampaikan informasi ini ke orang lain. Inilah mengapa Anda membuat peta pada sebuah komputer, dengan cara seperti itu semua orang dapat mengakses peta tersebut dan membuatnya lebih berharga.

source: Why digital?
id: Kenapa digital?

source: Map making on computers allows us to collect more useful data than on paper. On paper we might draw a school, and even add it’s name and record some information about the school, but on the computer we can attach an endless amount of data about the school, such as the number of students, number of teachers, size of the building, type of structure, and so on. And more importantly, when we add this school to a digital map, we record it’s precise location (longitude and latitude) on the planet. This is invaluable for our future map making and analysis, and we will look more closely at it later on.
id: Pembuatan peta di komputer memungkinkan kita untuk mengumpulkan data yang lebih bermanfaat daripada di atas kertas. Di atas kertas kita mungkin menggambar sekolah, dan bahkan menambah namanya dan merekam beberapa informasi mengenai sekolah tersebut, tetapi di komputer kita dapat melampirkan data mengenai sekolah jumlah tak terbatas, seperti jumlah murid, jumlah guru, ukuran bangunan, jenis struktur bangunan, dan sebagainya. Dan yang lebih penting, ketika kita menambah sekolah ini ke peta digital, kita mencatatnya pada lokasi yang tepat (bujur dan lintang) di Bumi ini. Ini sangat berharga untuk pembuatan peta analisis di masa depan kita.

source: What is OpenStreetMap?
id: Apa itu *OpenStreetMap*?

source: OpenStreetMap is a tool for creating and sharing map information. Anyone can contribute to OSM, and thousands of people add to the project every day. Users draw maps on computers, rather than paper, but as we will see in this guide, drawing a map on a computer is not all that different from drawing on paper. We still draw lines to represent roads, fields, and anything else, and we still represent schools and hospitals with symbols. The important thing is that OSM maps are saved on the internet, and anyone can access them at any time, totally free.
id: OpenStreetMap adalah sebuah alat untuk membuat dan berbagi informasi dalam bentuk peta. Siapapun dapat berkontribusi untuk OSM, dan ribuan orang menambahkan proyek setiap harinya. Para pengguna menggambarkan peta mereka pada komputer, bukan pada kertas, tetapi pada panduan ini, kita akan melihat bahwa menggambar sebuah peta pada sebuah komputer tidak jauh berbeda dengan menggambar peta pada secarik kertas. Kita masih menggambarkan garis untuk merepresentasikan jalan, lapangan, dan lain-lain, dan kita masih merepresentasikan sekolah dan rumah sakit dengan simbol. Hal yang paling penting adalah peta OSM dapat disimpan di dalam internet, dan siapapun dapat mengakses peta tersebut kapanpun, secara gratis.

source: *Digital Maps with OpenStreetMap*
id: Peta digital dengan *OpenStreetMap*

source: OSM is digital, which makes it extremely useful for us, and it is shared, which means that everybody benefits from the work of everybody else.
id: OSM adalah digital, yang membuatnya sangat berguna bagi kita, dan di OSM orang juga berbagi, yang berarti bahwa setiap orang memberikan manfaat untuk orang lain.

source: In this unit, you will learn how to make a digital map. You will learn how to use the OSM platform, and you will make your first edits and additions to the worldwide map.
id: Dalam unit ini, Anda akan belajar bagaimana membuat peta digital. Anda akan belajar bagaimana menggunakan platform OSM, dan Anda akan membuat perubahan pertama Anda dan penambahan pada peta di seluruh dunia.

source: :ref:`Go to next module --> <working-with-osm>`
id: :ref:`Modul selanjutnya --> <working-with-osm>`
