Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/old-training/beginner/osm/104-using-gps.po
Languages: id

source: If **Record Method** is set to *Distance* or *Time*, the options will allow you to set a matching unit of measurement.
id: Jika **Record Method** diatur ke *Distance* atau *Time*, pengaturan yang ada akan memperbolehkan Anda untuk mengatur beberapa unit pengaturan yang sesuai.

source: **Color**: This setting is for defining the colour of the track line as shown on the GPS map page.
id: **Color**: Anda dapat mengubah tampilan warna garis track pada peta.

source: 8. Copying waypoints and tracks to the computer
id: 8. Copy Waypoint dan Track ke Komputer

source: 8.1. Attaching GPS to the computer
id: 8.1 Menghubungkan GPS ke Komputer

source: When you are finished mapping with the GPS you will want to copy the points and tracks to your computer so that you can open them in JOSM.
id: Ketika Anda telah selesai memetakan dengan GPS Anda menginginkan untuk menyalin titik dan trek ke dalam komputer agar Anda dapat membukanya di JOSM.

source: First, turn off the track log on your GPS by going to the Track page and selecting :guilabel:`Off`.
id: Pertama, matikan track log GPS Anda, dengan menuju halaman trek dan memilih :guilabel:`Off`.

source: Attach the GPS to your computer with the cable. One end should plug into your computer’s USB port, and the other goes into the back of the GPS, beneath the rubber flap at the top. The GPS should be turned on to copy the points and tracks.
id: Sambungkan GPS pada komputer dengan kabel. Satu ujung kabel harusnya tersambung pada port USB komputer Anda, dan ujung lainnya tersambung dengan GPS, di belakang flap karet pada bagian atas belakang GPS. GPS harus dinyalakan untuk menyalin titik dan track.

source: 8.2. Installing GPS drivers
id: 8.2 Menginstal Driver GPS

source: You may need to install GPS drivers on your computer. Open your training folder and find :file:`software/USBDrivers_23.exe`. Double-click it and install.
id: Anda mungkin perlu untuk melakukan instalasi driver GPS pada komputer Anda. Jika Anda mempunyai salinan dari :file:`software/USBDrivers_23.exe` pada komputer Anda, klik dua kali pada file tersebut dan install.

source: If you don’t have this file, you can download it. Open your internet browser and go to: `http://www8.garmin.com/support/download_details .jsp?id=591 <http://www8.garmin.com/support/download_details.jsp?id=591>`_
id: Jika Anda tidak mempunyai file ini, Anda dapat mendownloadnya. Buka browser internet Anda dan pergi ke: `http://www8.garmin.com/support/download_details .jsp?id=591 <http://www8.garmin.com/support/download_details.jsp?id=591>`_

source: Click :guilabel:`Download` to get the installation file. Locate it on your computer, and double-click to install.
id: Klik :guilabel:`Download` untuk mendapatkan file instalasi. Cari pada komputer Anda, dan klik-ganda untuk menginstall.

source: 8.3. Getting the GPSBabel setup program
id: 8.3. Memperoleh Setup Program GPSBabel

source: GPSBabel is a program that allows us to copy data from the GPS. It is saved as :file:`GPSBabel-1.5.1-Setup` in the :file:`software` folder (the exact version number may be different).
id: GPSBabel adalah program yang dapat kita manfaatkan untuk menyalin data dari GPS. Installer dari program ini disimpan sebagai :file:`GPSBabel-1.5.1-Setup` pada folder :file:`software` (angka versi mungkin berbeda).

source: If you don’t have GPSbabel already, open your web browser and go to `www.gpsbabel.org <http://www.gpsbabel.org>`_.
id: Jika Anda belum mempunyai GPSBabel, buka browser internet Anda dan pergi ke `www.gpsbabel.org <http://www.gpsbabel.org>`_.

source: Click :guilabel:`Downloads` at the top of the page.
id: Klik :guilabel:`Downloads` pada bagian atas halaman.

source: Scroll down the page. If your computer uses Windows, you want to download the installation file for Windows. Click :file:`GPSBabel-1.5.1-Setup.exe`. The file will be downloaded to your computer.
id: Geser ke bawah halaman. Jika komputer Anda menggunakan Windows, Anda akan mendownload file instalasi utuk Windows. Klik :file:`GPSBabel-1.5.1-Setup.exe`. File akan didownload ke dalam komputer Anda.

source: 8.4. Installing GPSBabel
id: 8.4. Melakukan Instalasi GPSBabel

source: Locate the GPSBabel setup file on your computer. Double-click it to install.
id: Cari file setup GPSBabel pada komputer Anda. Klik-ganda untuk menginstall.

source: Click :guilabel:`Next`.
id: Klik :guilabel:`Next`.

source: Click :guilabel:`I accept` and :guilabel:`Next`.
id: Klik :guilabel:`I accept` dan :guilabel:`Next`.

source: Continue clicking :guilabel:`Next` until the program installs.
id: Lanjutkan klik :guilabel:`Next` hingga program mulai menginstal.

source: When the program has finished installing, click :guilabel:`Finish` to start GPSBabel.
id: Ketika program telah selesai diinstal, klik :guilabel:`Finish` untuk memulai GPSBabel.

source: 8.5. Copying Tracks and Waypoints
id: 8.5. Menyalin Trek dan Waypoint

source: Click in the circle next to the word :guilabel:`Device` at the top of the window.
id: Klik pada lingkaran dengan kata :guilabel:`Device` di sampingnya pada bagian atas jendela.

source: In the drop-down menu labelled :guilabel:`Format`, select :guilabel:`Garmin serial/USB protocol`
id: Pada menu daftar pilihan yang berlabel :guilabel:`Format`, pilih :guilabel:`Garmin serial/USB protocol`

source: Go down to the middle of the window, under :guilabel:`Output`. In the drop-down menu labelled :guilabel:`Format`, select :guilabel:`GPX XML`:
id: Pergi ke bawah pada pertengahan jendela, di bawah :guilabel:`Output`. Pada menu daftar pilihan yang berlabel :guilabel:`Format`, pilih :guilabel:`GPX XML`:

source: Click :guilabel:`File Name` and type a name for your saved file. It should be something that describes the data, such as the date and the location. For example: :file:`jakarta-07-07-2011`.
id: Klik :guilabel:`File Name` dan ketik sebuah nama untuk menyimpan file Anda. Nama tersebut sebaiknya dapat mendeskripsikan tentang data GPS, misalnya tanggal dan lokasi. Contoh: :file:`jakarta-07-07-2011`.

source: Make sure your GPS is connected to the computer and turned on.
id: Pastikan GPS Anda terhubung dengan komputer dalam keadaan menyala.

source: Click :guilabel:`Apply` in the bottom right corner of the window.
id: Klik :guilabel:`Apply` pada bagian pojok kanan bawah jendela.

source: If all goes well you should see a bar move across the screen, indicating that the data is being retrieved from the GPS. When it is finished, your points and track will be saved in the file that you selected.
id: Jika semua berjalan dengan lancar seharusnya Anda akan melihat sebuah bar yang bergerak pada layar, menandakan bahwa data sedang diterima dari GPS. Ketika sudah selesai, titik dan track Anda akan disimpan ke dalam file yang Anda pilih.

source: 8.6. Opening in JOSM
id: 8.6. Membuka Waypoint dan Track di JOSM

source: Now open JOSM. Go to :menuselection:`File ‣ Open...`
id: Sekarang buka JOSM. Pada menu bagian atas, klik :menuselection:`File ‣ Open...`

source: Find and select the file that you created with GPSBabel. Click :guilabel:`Open`.
id: Cari dan pilih file yang telah Anda buat dengan GPSBabel. Klik :guilabel:`Open`.

source: You should now see your points and tracks loaded into JOSM.
id: Anda seharusnya dapat melihat titik dan track Anda termuat pada JOSM.

source: 9. Uploading GPS data in JOSM
id: 9. Cara Mengupload Track GPS di JOSM

source: If you are not interested in sharing your tracks publicly on OSM, feel free to skip this section.
id: Jika Anda tidak tertarik dalam membagi track Anda kedalam OSM, silahkan lewatkan bagian ini.

source: Adding GPS tracks to the OSM server is useful because it enables other users to see and use your tracks. For those who do not have a GPS or who can't access a location, they are still able to benefit from your work and help improve the map.
id: Menambahkan track GPS dan waypoint ke server OSM sangat berguna untuk banyak alasan/tujuan. Untuk orang lain yang tidak mempunyai GPS atau mereka yang tidak dapat mengakses lokasi, mereka masih bisa untuk mendapat keuntungan dari kerja Anda dan membantu untuk mengembangkan peta.

source: The easiest way to upload GPS tracks is to download the JOSM plugin :guilabel:`DirectUpload`:
id: Cara termudah untuk melakukan upload track GPS adalah dengan mendownload plugin :guilabel:`DirectUpload`:

source: Open JOSM and go to :menuselection:`Edit ‣ Preferences`. Click the plugins tab.
id: Buka JOSM dan klik :menuselection:`Edit ‣ Preferences`. Klik tab plugin.

source: Type :kbd:`directupload` in the :guilabel:`Search` box. Check the box next to the plugin, and then click :guilabel:`OK`.
id: Pada :guilabel:`Search` Cari ketik :kbd:`directupload` dan beri tanda centang lalu klik :guilabel:`OK`.

source: Open your GPX file in JOSM.
id: Buka file GPX Anda pada JOSM.

source: Go to :menuselection:`Tools ‣ Upload Traces`
id: Klik :menuselection:`Tools ‣ Upload Traces`

source: Add tags, a description, and choose an option for whom to make the track visible. Unless you have a reason for doing otherwise, choose :guilabel:`Public`.
id: Deskripsikan file GPX Anda, tulis beberapa tag, dan tingkat penglihatan. Kecuali Anda mempunyai alasan sebaliknya, pilih :guilabel:`Public`.

source: Click :guilabel:`Upload Trace`. If requested to enter a username and password, enter the credentials of your OSM account and click :guilabel:`Authenticate`.
id: Klik :guilabel:`Upload Jejak`. Apabila diminta untuk memasukkan username dan kata sandi, Anda dapat memasukkan nama pengguna dan kata sandi dari akun OpenStreetMap dan centang simpan user dan password kemudian klik :guilabel:`Membuktikan`.

source: :ref:`Go to next module --> <field-papers>`
id: :ref:`Pergi ke materi berikutnya --> <field-papers>`
