Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/old-training/beginner/osm/104-using-gps.po
Languages: id

source: Module 4: Using GPS
id: Bab 4: Penggunaan GPS

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Understand GPS and the types of GPS
id: Memahami GPS dan tipe-tipe GPS

source: Turn on GPS
id: Dapat menyalakan GPS

source: Understand factors that affect GPS accuracy
id: Memahami faktor-faktor yang mempengaruhi akurasi GPS

source: Understand tracks and waypoints
id: Memahami *track* dan *waypoint*

source: Collect data using GPS
id: Mengumpulkan data menggunakan GPS

source: GPS settings
id: Pengaturan GPS

source: Copy GPS data (tracks and waypoints) to computer
id: *Copy* data GPS (*tracks* dan *waypoints*) ke dalam komputer

source: Open waypoints and tracks in JOSM
id: Buka *waypoints* dan *tracks* pada JOSM

source: Upload GPS tracks using JOSM
id: *Upload track* GPS menggunakan JOSM

source: Edit OSM based on GPS data in JOSM
id: *Edit* OSM berdasarkan data GPS pada JOSM

source: In this module we see what a GPS does and how it works. We explore how to operate a GPS and how to use it to create maps. We will explain how to operate the Garmin eTrex Vista HCx, a common GPS used for mapping. There are many other models of GPS which do the same thing, so if you are working with a different one, don’t worry - the principles remain the same.
id: Pada modul ini kami akan menjelaskan pengertian GPS dan bagaimana cara kerjanya. Kita akan belajar bagaimana cara mengoperasikan GPS dan bagaimana cara membuat peta. Kita juga akan mempelajari bagaimana mengoperasikan Garmin eTrex Vista HCx, sebuah perangkat GPS yang pada umumnya digunakan untuk membuat peta. Terdapat banyak model GPS lain yang dapat melakukan hal yang sama, jadi jika Anda mengerjakannya dengan perangkat GPS yang berbeda, jangan khawatir, pada prinsipnya tetap sama.

source: 1. What is GPS?
id: 1. Apa yang dimakusd dengan GPS?

source: A GPS is like a mobile phone, except that instead of receiving radio signals from telephone companies, it receives signals from satellites that are going around the Earth. By receiving these signals from the satellites, a GPS is able to calculate its exact location on the planet. It records this location in coordinates, which are two long numbers. One number tells you how far east or west you are - this is called **longitude**. The second number tells you how far north or south you are - this is called **latitude**. Every place on Earth has unique geographic coordinates.
id: Sebuah GPS bekerja seperti ponsel, namun jika ponsel menerima sinyal radio dari perusahaan telepon, GPS menerima sinyal dari satelit yang mengelilingi bumi. Dengan menerima sinyal tersebut dari satelit, sebuah GPS dapat memperhitungkan dengan tepat posisi Anda di permukaan bumi. GPS merekam lokasi ini dalam bentuk koordinat, dimana terdapat dua buah nomor yang panjang. Satu nomor menunjukan sejauh mana posisi Anda dari Timur atau Barat - biasa disebut **garis bujur**. Nomor yang kedua menunjukan sejauh mana posisi Anda dari Utara atau Selatan - biasa disebut **garis lintang**. Setiap tempat di bumi memliki koordinat geografis yang unik.

source: For example: -8.639298 Latitude, 116.311607 Longitude is a location in Lombok, Indonesia.
id: Sebagai contoh: -8.639298 Lintang, 116.311607 Bujur: merupakan sebuah lokasi di Lombok, Indonesia.

source: *Google Earth software, showing coordinates of a place in Lombok, Indonesia.*
id: *Perangkat lunak Google Earth, menunjukan koordinat dari sebuah tempat di Lombok, Indoonesia.*

source: 2. Turning on the GPS
id: 2. Menyalakan GPS

source: Before turning on your GPS, go outside where you have a clear view of the sky. Because the GPS determines your location by receiving signals from satellites, **it won’t work indoors**.
id: Sebelum Anda menyalakan GPS, pergilah keluar dimana Anda dapat melihat langit dengan jelas. Karena GPS menentukan lokasi Anda dengan menerima sinyal dari satelit, **GPS tidak akan bekerja di dalam ruangan**.

source: On the right side of the GPS, press and hold the :guilabel:`Power` button. The GPS will start, and it will show you the Satellites page. You should see something like the image below. The GPS is looking for satellite signals. When it has connected to three or more satellites, it will have your location.
id: Pada bagian bawah sisi kanan GPS Anda, tekan dan tahan tombol :guilabel:`Power`. GPS akan menyala, dan akan menunjukkan halaman Satelit. Anda seharusnya dapat melihat sesuatu seperti pada gambar di bawah ini. Hal ini berarti GPS sedang mencari sinyal satelit. Ketika sudah terhubung dengan tiga satelit atau lebih, GPS akan mendapatkan lokasi Anda.

source: Once your location is determined, the Satellites page will disappear and you will see the Main Menu.
id: Setelah lokasi Anda telah ditentukan, layar Satelit akan menghilang dan Anda akan melihat menu utama.

source: 3. Navigating the GPS
id: 3. Menavigasikan GPS

source: The GPS has different pages and menus that allow you to do different things. To switch between pages, press the button marked :kbd:`X`, just above the power button on the right side of the device. This button also serves to go back. If you press something by mistake and would like to cancel or go back, press the :kbd:`X` button.
id: GPS memiliki layar yang berbeda dan menu yang dapat membuat Anda melakukan hal yang berbeda. Untuk memindahkan tampilan dari layar ke layar, tekan tombol yang bertanda :kbd:`X`, tepat berada di atas tombol Power pada sisi kanan perangkat. Tombol ini juga berfungsi untuk kembali. Jika Anda menekan sesuatu karena kesalahan dan Anda menginginkan untuk membatalkan atau kembali ke menu sebelumnya, tekan tombol :kbd:`X`.

source: By pressing the :kbd:`X` button, you should be able to flip through different screens that will look something like this:
id: Dengan menekan tombol :kbd:`X`, Anda seharusnya dapat mengganti tampilan dari layar ke layar yang berbeda seperti ini:

source: Return to the Satellites page and see that you are connected to three or more satellites. In the upper left corner are your coordinates, your latitude and longitude.
id: Kembali ke halaman Satelit dan Anda akan dapat melihat bahwa Anda terhubung dengan tiga satelit atau lebih. Pada pojok kiri atas merupakan koordinat Anda, lintang dan bujur.

source: Flip to the Map page, and you can see a map of where you are. If you have added OpenStreetMap maps to your GPS, you may see roads and places. Otherwise, the map may look quite blank. Zoom in and out by pressing the up and down arrow buttons on the left side of the GPS.
id: Ubah ke halaman Peta, dan Anda dapat melihat sebuah peta dimana Anda berada. Jika Anda telah menambahkan peta OSM pada GPS Anda, Anda dapat melihat jalan dan tempat. Selain itu, peta mungkin akan terlihat kosong. Perbesar dan perkecil dengan menekan tombol atas dan bawah pada sisi kiri GPS.

source: 4. Tracks and waypoints
id: 4. Track dan Waypoint

source: A GPS records two kinds of information that are useful for creating maps or saving the coordinates of a place. First, it allows you to save your location in the memory of the GPS. When you save a location, the coordinates will be saved with a name. For example, your first saved point will be named 001, the second 002, and so on. When you save a point, you can write down the number on a piece of paper, along with a note about what it is, and any attributes or indicators you would like to collect. Saved locations on your GPS are called waypoints.
id: Sebuah GPS merekam dua jenis informasi yang berguna untuk membuat peta atau menyimpan koordinat dari sebuah tempat. Pertama, GPS dapat menyimpan lokasi Anda pada memori GPS. Ketika Anda menyimpan satu lokasi, koordinat akan disimpan dengan sebuah nama. Sebagai contoh, titik pertama yang tersimpan oleh Anda akan diberi nama 001, kedua 002, dan seterusnya. Ketika Anda menyimpan sebuah titik, Anda dapat menulis nomor tersebut pada selembar kertas, dengan sebuah catatan tentang titik apakah itu, atribut atau indikator apapun yang Anda ingin ketahui. Lokasi yang tersimpan ke dalam GPS Anda disebut waypoints.

source: Second, a GPS can save what are called tracks. While a waypoint only saves a single location, a track will save a series of locations wherever you move. For example, a track will record your location every one second, or every one metre, and the result will be a series of dots that show the path of where you have been. Tracks are useful for mapping objects that are represented by lines or shapes, such as the course of a road or the shape of a field.
id: Kedua, sebuah GPS dapat menyimpan apa yang disebut dengan *“track”*. Jika *waypoint* hanya menyimpan sebuah lokasi, maka sebuah *track* akan menyimpan sebuah seri lokasi kemanapun Anda bergerak. Sebagai contoh, *track* akan merekam lokasi Anda setiap satu detik, atau setiap satu meter, dan hasilnya akan berupa sebuah seri dari titik-titik yang menunjukan jalur lokasi dimana Anda pernah berada. *Track* sangat berguna untuk memetakan objek yang ditunjukan oleh garis atau bentuk, seperti sebuah jalan, atau bentuk dari sebuah lapangan.

source: A GPS can record a single point as well as a path of where you travel. Here the points are numbered in the order they are recorded. The path or **track** is shown with a green line and the **waypoints** are shown in red.
id: Sebuah GPS selain dapat merekam satu titik juga dapat merekam sebuah jalur kemanapun Anda bepergian. Disini, titik diberi nomor berurutan sebagaimana mereka terekam. Jalur atau **track** ditunjukkan dengan garis berwarna hijau, sedangkan **waypoint** atau titik ditunjukkan dengan warna merah.

source: 5. Saving Your location
id: 5. Menyimpan lokasi Anda

source: To save your current location as a waypoint, click the :kbd:`X` button until your reach the Main Menu. Using the joystick, move it so that :guilabel:`Mark` is highlighted on the screen. Push the joystick button down to open the Save Waypoint page.
id: Untuk menyimpan lokasi Anda sebagai sebuah waypoint, klik tombol :kbd:`X` hingga mencapai menu utama. Dengan menggunakan joystick, gerakan joystick hingga bagian :guilabel:`Mark` tersorot pada layar. Tekan tombol joystick untuk membuka halaman Save Waypoint.

source: You can see on this page some information about the waypoint that you are saving. First is the name. If this is your first waypoint, it probably reads “001”. This is the number you should record on paper along with the information you want to collect with this object. Next you will see the time and date when the point is recorded. Below that are the coordinates, followed by the altitude.
id: Anda dapat melihat beberapa informasi tentang waypoint atau titik yang Anda simpan. Pertama adalah namanya. Jika ini titik pertama Anda, Anda akan membaca “001”. Ini merupakan nomor yang harus Anda catat di kertas bersamaan dengan informasi yang Anda ingin kumpulkan pada obyek ini. Selanjutnya Anda akan melihat jam dan tanggal ketika titik tersebut direkam. Di bawahnya terdapat koordinat, diikuti dengan ketinggian.

source: Use the joystick to move to the :guilabel:`OK` button at the bottom of the screen. Press the joystick button down to save this point. Be sure to write down the number of the point, along with what the place is and any other information you want to record about the place in your notebook.
id: Gunakan joystick untuk bergerak ke tombol :guilabel:`OK` pada bagian bawah layar. Tekan tombol joystick untuk menyimpan titik ini. Pastikan untuk menulis nomor titik, beserta keterangan tempat apakah itu dan berbagai informasi lainnya yang Anda ingin ketahui di dalam buku catatan Anda.

source: Press the :kbd:`X` button to go to the Map page. You should now see your point on the map.
id: Tekan tombol :kbd:`X` untuk menuju halaman peta. Anda seharusnya akan melihat titik pada peta.

source: 6. Turning on the Track Log
id: 6. Menyalakan Track Log

source: Now that we have learned how to save points, let’s learn how to turn the track log on and off. When the track log is turned on, it will automatically record your path. It’s good practice to turn on the log when you begin mapping, and turn it off when you are finished. You will then be able to look at the track on a computer and see the path that you mapped. If you would like to map the course of a road, it is a good idea to save a waypoint at the beginning and end of the road, writing in your notebook the name and type of the road, and any other important information about the road.
id: Sekarang kita telah mempelajari bagaimana caranya untuk menyimpan titik, sekarang mari mempelajari bagaimana untuk menyalakan/mematikan *track log*. Ketika *track log* dinyalakan, secara otomatis GPS akan merekam jalur Anda. Pada saat mulai memetakan, sebaiknya *track log* dinyalakan, dan dimatikan pada saat Anda telah selesai. Anda akan dapat melihat trek pada sebuah komputer dan melihat jalur yang telah Anda petakan. Jika Anda ingin memetakan jalur pada jalan raya, adalah ide yang bagus untuk menyimpan sebuah *waypoint* pada awal dan akhir jalan, menuliskan nama dan tipe jalan, serta informasi penting lainnya tentang jalan tersebut pada buku catatan.

source: Click the :kbd:`X` button until your reach the page that says Track Log.
id: Untuk menyalakan track log, klik pada tombol :kbd:`X` hingga Anda mencapai halaman yang bernama Track Log.

source: To empty the track log (to delete earlier recordings), use the joystick to select :guilabel:`Clear`, and press the joystick down. The bar at the top should read “0%”.
id: Jika Anda ingin mengosongkan track log untuk menghapus perekaman sebelumnya, gunakan joystick untuk memilih :guilabel:`Clear`, dan kemudian tekan joystick. Pada bar yang terdapat di atas seharusnya terbaca “0%”

source: To turn on the log, move the joystick to highlight :guilabel:`On`, and press the joystick down. The track log is now recording your path.
id: Untuk menyalakan track log, gerakan joystick untuk menyorot :guilabel:`On`, kemudian tekan joystick. Track log sekarang akan merekam jalur Anda.

source: Under :guilabel:`Setup`, you also can set time or distance intervals to track. Time intervals instruct your GPS to record your location at given intervals. If you have a memory card in your GPS, it is good practice to set this to one second, meaning that every second your location will be added to the track log. This may be useful when detailed surveys are needed.
id: Dibawah :guilabel:`Setup`, Anda juga dapat mengatur interval waktu atau jarak untuk trek. Interval waktu memerintahkan GPS Anda untuk merekam lokasi Anda setiap beberapa menit atau detik sesuai dengan pengaturan interval waktunya atau jika Anda memiliki kartu memori di GPS Anda, sebaiknya pilih pengaturan 1 second, artinya setiap detik lokasi Anda akan ditambahkan pada track log. Hal ini akan berguna jika sedang melakukan survey yang sangat detail.

source: See :ref:`GPS Settings <gps-settings-tracks>` for more information on setting up the track log.
id: Lihat :ref:`GPS Settings <gps-settings-tracks>` untuk informasi lebih lanjut mengenai pengaturan pada track log.

source: Press the :kbd:`X` button to go to the Map page. As you move you will see your track shown as a series of dots.
id: Tekan tombol :kbd:`X` untuk menuju halaman peta. Selama Anda bergerak maka Anda akan melihat trek yang ditunjukan dengan titik-titik berseri.

source: 7. GPS settings
id: 7. Pengaturan GPS

source: Here we demonstrate how to edit some of the core settings of the GPS device. Use this as a reference to set up your GPS properly.
id: Disini kami akan memberitahukan bagaimana mengatur beberapa pengaturan utama pada perangkat GPS Anda. Gunakan ini sebagai referensi untuk mengatur GPS Anda sendiri.

source: 7.1. System settings
id: 7.1 Pengaturan sistem

source: Go to the Main Menu by using the :guilabel:`Page` button (the :kbd:`X` button on the right side of the device). Use the joystick to click :guilabel:`Setup`, and then click on :guilabel:`System`.
id: Pergi ke Main Menu dengan menggunakan tombol :guilabel:`Page` (tombol :kbd:`X` terdapat pada disisi sebelah kanan dari perangkat). Gunakan joystick untuk mengklik :guilabel:`Setup`, dan kemudian klik pada :guilabel:`System`.

source: Some of the settings that can be changed on the :guilabel:`System` menu are as follows:
id: Beberapa pengaturan dapat diganti pada menu :guilabel:`System` seperti berikut:

source: **GPS**: regulates how the GPS sensor works. Choose the :guilabel:`Normal` option. This tells the device to capture only signals from GPS satellites. The only drawback is that positional accuracy may sometimes be less accurate (about 10-30 metres).
id: **GPS**: mengatur bagaimana sensor GPS bekerja. Pilih pilihan :guilabel:`Normal`. Ini akan membuat perangkat hanya menangkap sinyal dari satelit GPS. Namun akurasi posisi Anda terkadang kurang akurat (berkisar 10-30 meter)

source: **WAAS/EGNOS**: WAAS stands for Wide Area Augmentation System, while EGNOS stands for Euro Geostationary Navigation Overlay Service. WAAS/EGNOS is a system of satellites and ground stations that provide GPS signal corrections, giving you a better position accuracy (to less than three metres). Ensure that it is :guilabel:`Enabled`. The drawback to this feature is that although it provides better accuracy, it will use the GPS battery more quickly.
id: **WAAS/EGNOS**: WAAS merupakan kepanjangan dari Wide Area Augmentation System, sedangkan EGNOS merupakan kepanjangan Euro Geostationary Navigation Overlay Service. Pada umumnya, akurasi yang diberikan oleh GPS adalah 15 meter. WAAS/EGNOS merupakan sistem satelit dan stasiun bumi yang memberikan koreksi sinyal GPS, sehingga memberikan Anda akurasi posisi yang lebih baik (hingga kurang dari 3 meter). Sebaiknya Anda memilih mode WAAS/EGNOS dengan memilih :guilabel:`Enabled` untuk mendapatkan akurasi yang lebih baik, namun dengan konsekuensi Anda harus mempersiapkan baterai cadangan.

source: **Battery Type**: To optimise power usage, this should match the type of battery in the device. The default is Alkaline.
id: **Battery Type**: Untuk optimalisasi penggunaan daya, sebaiknya disesuaikan dengan jenis baterai yang Anda gunakan (standarnya: Alkaline).

source: **Text Language**: Choose the language for the device.
id: **Text Language**: Pilih bahasa untuk perangkat GPS.

source: 7.2. Unit settings
id: 7.2 Pengaturan satuan unit

source: From the Main Menu, go to :menuselection:`Setup ‣ Units`. Here the type of measurement units can be set, such as metres, feet and more. The location unit format is also set here (decimal degrees, decimal minutes degrees, second minutes degrees), datum (standard WGS 84) and projection (standard WGS 84).
id: Dari menu utama, pergi ke :menuselection:`Setup ‣ Units`. Pada menu ini Anda dapat mengatur satuan unit yang ingin ditampilkan. Misalnya dalam meter, feet, dan lainnya. Selain itu Anda juga dapat mengatur format posisi (derajat desimal, derajat menit desimal, derajat menit detik), datum (standarnya WGS 84), dan proyeksi (standarnya WGS 84).

source: 7.3. Time settings
id: 7.3 Pengaturan waktu

source: From the Main Menu, go to :menuselection:`Setup ‣ Time`. Here the time format is set (12 hours or 24 hours) as well as the time zone. It is good to have the local time set, because all tracks and waypoints saved in the device are also saved with the current time.
id: Dari menu utama, pergi ke :menuselection:`Setup ‣ Time`. Disini format waktu diatur antara 12 jam atau 24 jam dan juga zona waktu. Lebih baik jika diatur menggunakan waktu lokal, karena semua track dan waypoint yang akan disimpan di GPS juga disimpan berdasarkan waktu saat itu.

source: 7.4. Page settings
id: 7.4 Pengaturan halaman

source: Remember that when you press the :guilabel:`Page` button (the :kbd:`X`) you are able to switch between different menus. By editing the page settings, the pages, as well as their order, may be customised.
id: Masih ingat ketika Anda menekan tombol :guilabel:`Page` (:kbd:`X`) Anda dapat berganti ke menu yang berbeda. Dengan mengedit pengaturan halaman, urutan dari halaman tersebut dapat diubah.

source: From the Main Menu, go to :menuselection:`Setup ‣ Page Sequence`.
id: Dari menu utama, pergi ke :menuselection:`Setup ‣ Page Sequence`.

source: Add a new page to the list by selecting :guilabel:`Add Page`. Then select a page such as: :guilabel:`Tracks` (to see details of your trip), :guilabel:`Map` (to view maps), or :guilabel:`Satellite` (to view the satellite status, position, and accuracy).
id: Tambahkan halaman baru di daftar dengan memilih :guilabel:`Add Page`. Kemudian pilih halaman seperti: :guilabel:`Tracks` (untuk melihat detil dari perjalanan anda), :guilabel:`Map` (untuk melihat peta), atau :guilabel:`Satellite` (untuk melihat status satelit, posisi dan akurasi).

source: Click on one of the pages to move it around the list and change the order in which the pages flip.
id: Klik pada salah satu halaman untuk untuk berpindah antar daftar halaman dan untuk mengubah urutan halaman.

source: 7.5. Track settings
id: 7.5 Pengaturan Track

source: Remember that :ref:`tracks <turn-on-track-log>` are a bread-crumb trail recording your movement, which is useful for mapping roads. On the Track page there are several settings.
id: Masih ingat dimana :ref:`tracks <turn-on-track-log>` adalah kumpulan seri titik-titik yang merekam pergerakan Anda, dimana hal tersebut berguna untuk memetakan jalan. Pada halaman Track terdapat beberapa pengaturan.

source: From the Track page, click :guilabel:`Setup`.
id: Dari halaman Track, klik :guilabel:`Setup`.

source: The settings are as follows:
id: Pengaturan yang ada seperti:

source: **Wrap When Full**: This option should be checked. It means that when the GPS runs out of internal memory, it will start overwriting the oldest trackpoints to record new ones. It is a good idea to keep this checked, although typically you will be recording tracks to a memory card anyway, making this option unimportant.
id: **Wrap When Full**: Beri tanda centang pada pilihan ini. Ini berarti ketika kapasitas memori internal di GPS sudah habis, GPS akan menghapus trackpoint yang lama untuk merekam yang baru. Disarankan untuk mengaktifkan fitur ini, meskipun biasanya Anda akan merekam track ke memory card, sehingga menyebabkan opsi ini tidak begitu penting.

source: **Record Method**: There are several ways the GPS can record track points:
id: **Metode Perekaman**: Terdapat beberapa cara sebuah GPS bisa merekam track:

source: *Distance*: tracks a new point each time a certain distance has been covered
id: *Distance* – perekaman track dilakukan setiap rentang jarak tertentu.

source: *Time*: tracks a new point when an amount of time has elapsed
id: *Time* – perekaman track dilakukan setiap rentang waktu tertentu

source: *Auto*: automatically choose method (typically this should be selected)
id: *Auto*: perekaman track dilakukan otomatis (sebaiknya pilih pengaturan ini)

source: **Interval**: This setting indicates how often the GPS will record the track, depending on the method selected in **Record Method**. Using a high setting (collecting many points) here will result in tracks that are smooth and detailed but will also drain the battery faster. If **Record Method** is set to *Auto*, the **Interval** options will be as follows:
id: **Interval**: Pengaturan ini menentukan seberapa sering GPS akan merekam jejak perjalanan Anda yang bergantung sesuai dengan metode yagn dipilih di **Record Method**. Menggunakan pengaturan tertinggi (mengambil banyak titik) akan menghasilkan garis track yang halus dan lebih teratur tetapi akan menghabiskan baterai lebih cepat, jika di atur jarang atau “least often”, perekaman dilakukan secara jarang, garis track yang dihasilkan akan terlihat patah. Jika **Record Method** diatur ke *Auto*, pengaturan **Interval** akan seperti ini:
