Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/old-training/beginner/osm/105-field-papers.po
Languages: id

source: Module 5: Field Papers
id: Bab 5: Field Papers

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Understand how to use Field Papers
id: Memahami cara kerja Field Papers

source: Make and print Field Papers
id: Membuat dan mencetak Field Papers

source: Add information to Field Papers
id: Menambahkan informasi ke Field Papers

source: Scan and upload Field Papers to `fieldpapers.org <http://fieldpapers.org>`_
id: *Scan* dan *upload* Field Papers ke situs `fieldpapers.org <http://fieldpapers.org>`_

source: Open Field Papers in JOSM
id: Membuka Field Papers ke dalam JOSM

source: In this module we will see how it is possible to record the coordinates of places without a GPS. We will use a tool called Field Papers, which allows you to print a map of an area, draw on it and add notes, and load the paper back into JOSM, where you can add your locations to OpenStreetMap.
id: Pada modul ini, kita akan melihat bagaimana kita dapat merekam koordinat dari suatu tempat tanpa GPS. Kita akan menggunakan sebuah *tool* bernama Field Papers, yang mana memungkinkan kita untuk mencetak peta suatu wilayah, menggambar dan menambahkan catatan di atasnya, dan membuka kertas tersebut di dalam JOSM, dimana Anda dapat menambahkan lokasi Anda ke OpenStreetMap.

source: 1. Overview
id: 1. Gambaran Umum

source: Before going into detail about Field Papers, let’s look at an overview of how the process works:
id: Sebelum mempelajari lebih jauh tentang Field Papers, mari melihat gambaran bagaimana Field Papers bekerja:

source: **Step 1:** Locate the area you want to map on the Field Papers website. Print out a map of this area. You can choose to print the current map of the area with OSM, or you can choose to print aerial imagery, if it is available in your area.
id: **Langkah 1:** Carilah wilayah yang ingin Anda lakukan pemetaan pada situs Field Papers. Cetak peta untuk wilayah tersebut. Anda dapat memilih untuk mencetak peta saat ini berupa peta OSM ataupun Anda dapat memilih mencetak dengan citra satelit, jika citra satelit tersebut tersedia untuk wilayah Anda.

source: **Step 2:** Use your printed map to survey the area. Add more places by drawing them on the map. Draw lines for roads, shapes for buildings, and so forth. Write notes about each location directly on the map, or write numbers on the map that relate to numbers in your notebook, where you can record more detailed information about each object.
id: **Langkah 2:** Gunakan Field Papers yang telah tercetak tersebut untuk melakukan survei pada wilayah Anda. Tambahkan lebih banyak tempat/objek dengan menggambarnya di atas peta. Gambarlah garis untuk jalan, bentuk untuk bangunan, dan seterusnya. Tulislah catatan secara langsung pada peta tentang masing-masing objek yang Anda gambar atau dapat memberi nomor untuk setiap objek dalam buku catatan Anda, kemudian Anda menggunakan nomor tersebut untuk menghubungan gambar dengan kode pada catatan.

source: **Step 3:** Scan your paper into the computer. If you do not have a scanner, you can take a photograph of the paper, if your camera is able to take high quality pictures. Upload the image to the Field Papers website (`http://fieldpapers.org/upload.php <http://fieldpapers.org/upload.php>`_).
id: **Langkah 3:** Scan Field Paper Anda kedalam komputer. Jika Anda tidak memiliki scanner, Anda dapat foto Field Papers Anda, jika kamera Anda dapat mengambil gambar dengan kualitas yang baik dan resolusi tinggi. Kemudian upload tersebut ke situs Field Papers (`http://fieldpapers.org/upload.php <http://fieldpapers.org/upload.php>`_ ).

source: **Step 4:** In JOSM, load the Field Paper. Use the objects you drew as a reference to add them digitally into OSM.
id: **Langkah 4:** Pada JOSM, tambahkan Field Papers. Gunakan objek yang telah Anda gambar sebagai acuan untuk menambahkan objek-objek tersebut menjadi peta digital ke dalam OSM.

source: 2. How does Field Papers work?
id: 2. Bagaimana Field Papers Bekerja?

source: If you follow the Field Papers process described above, you will be collecting accurate geographic coordinates of places with nothing more than paper. How is this possible?
id: Jika Anda mengikuti bagaimana cara kerja Field Papers sebagaimana dijelaskan di atas, Anda akan mengumpulkan koordinat dari suatu tempat/lokasi secara akurat hanya dengan menggunakan kertas. Bagaimama mungkin?

source: When you print a Field Paper, it comes with a square barcode on the bottom of the page. This bar code allows Field Papers to determine the exact location of the map that you are using to survey. Later, when you load the paper back into JOSM, all the objects that you drew will be in shown in their actual locations, or at least quite close, which is good enough for us.
id: Ketika Anda mencetak sebuah Field Papers, kertas yang tersebut tercetak dengan sebuah barcode berbentuk kotak pada bagian bawah halaman. Barcode ini memungkinkan Field Papers untuk menentukan lokasi pasti dari peta yang Anda gunakan untuk survei. Selanjutnya, ketika Anda menambahkan Field Papers ke dalam JOSM, semua objek yang telah Anda gambar akan nampak pada lokasi sebenarnya, atau paling tidak cukup dekat, yang mana cukup bagus untuk kita.

source: Next let’s learn how to create and use Field Papers.
id: Sekarang mari belajar bagaimana untuk membuat dan menggunakan Field Papers.

source: 3. Create and print
id: 3. Membuat dan Mencetak Field Papers

source: Open your web browser - this may be Firefox, Chrome, Opera, or Internet Explorer.
id: Buka browser internet Anda - misalnya Firefox, Chrome, Opera, atau Internet Explorer.

source: In the address bar at the top of the window, enter `http://fieldpapers.org/ <http://fieldpapers.org>`_ and press :kbd:`Enter`.
id: Pada isian alamat situs pada bagian atas halaman browser, tulislah `http://fieldpapers.org/ <http://fieldpapers.org>`_ dan tekan :kbd:`Enter`.

source: The website should look something like this:
id: Situs tersebut akan terlihat seperti berikut:

source: Click :guilabel:`Make yourself an Atlas`.
id: Klik pada :guilabel:`Make yourself an Atlas`.

source: Enter the name of a place where you would like to print out a map, and press :kbd:`Enter`. In this example we will search for :kbd:`jakarta`.
id: Ketiklah nama wilayah yang ingin Anda cetak peta nya, kemudian tekan :kbd:`Enter`. Dalam contoh ini, kita akan mencari untuk wilayah :kbd:`jakarta`.

source: Now you are presented with an interface where you can define the boundaries of your Field Paper. The map that you see shows the area that you would like to print on paper. You can print multiple pages, zoom in and out, and drag the papers to cover specific boundaries on the map.
id: Sekarang Anda akan mendapatkan tampilan yang meminta Anda untuk membatasi wilayah yang akan Anda cetak petanya dari Field Papers. Peta yang Anda lihat menunjukkan wilayah yang akan Anda cetak petanya. Anda dapat mencetak peta wilayah dalam beberapa halaman, memperbesar dan memperkecil peta, dan menarik tepi-tepi kertas untuk memberikan batas wilayah pada peta.

source: Click on the various buttons to see what each does. Notice that in our example we are presented with a two page set of Field Papers. To add or subtract a page, click on the :guilabel:`+` and :guilabel:`-` buttons on the map. It may be easiest to create only one page the first time that you use Field Papers.
id: Klik pada berbagai tombol yang ada untuk melihat apa fungsi dari setiap tombol tersebut. Perhatikan bahwa pada contoh ini kami menampilkan Field Papers dengan dua halaman. Untuk menambahkan atau mengurangi sebuah halaman, kita dapat klik pada tombol :guilabel:`+` dan :guilabel:`-` pada peta. Ini mungkin paling mudah untuk membuat hanya satu halaman untuk pertama kalinya Anda menggunakan Field Papers.

source: Expand or decrease the area of the papers by dragging the button in the lower right corner.
id: memperluas atau mengurangi luasan kertas dengan menarik tombol pada pojok kanan bawah.

source: Move the paper by clicking and dragging the button in the upper left corner.
id: Anda dapat memindahkan kertas dengan mengklik dan menggeser tombol pada pojok kiri atas.

source: Adjust the paper orientation and type of map using the controls at the top.
id: Anda dapat menyesuaikan arah cetak kertas dan jenis peta dengan menggunakan tombol pada sisi atas peta

source: When you are finished adjusting the parameters, click :guilabel:`Next`.
id: Ketika Anda telah selesai mennyesuaikan parameter, klik :guilabel:`Next`

source: Give your map a name, and if you want, you can add notes to be printed on the map, such as questions you want to remember to answer or specific places you want to identify. Then click :guilabel:`Next`.
id: Selanjutnya berilah nama, dan jika Anda menginginkan, Anda dapat menambahkan catatan untuk ikut serta dicetak pada peta, misalnya catatan tentang pertanyaan yang ingin Anda ingat untuk dijawab atau catatan tentang tempat-tempat yang ingin Anda identifikasi. Kemudian klik :guilabel:`Next`

source: Finally choose your layout. Indicate whether you want pages only for your maps, or if you want notes on the same page. If you choose the notes option, then half of the page will be left for taking notes, and the other half will contain the map.
id: Terakhir, pilih layout Anda. Anda dapat memilih apakah Anda ingin Field Papers Anda hanya berisi peta, atau jika Anda ingin catatan pada halaman yang sama. Jika Anda memilih untuk mencetak juga catatan yang ada, maka separuh dari halaman Anda akan digunakan untuk mencetak catatan, dan separuh yang lainya akan berisi peta.

source: It may take a few minutes to prepare your Field Paper.
id: Proses persiapan Field Papers Anda mungkin akan memakan waktu beberapa menit.

source: When the print is ready, scroll to the bottom and click :guilabel:`Download PDF`. The Field Paper should begin downloading. If it loads in your browser, you may need to save it by going to :menuselection:`File ‣ Save`.
id: Ketika Field Papers Anda telah siap, geser halaman ke bawah kemudian klik :guilabel:`Download PDF` Selanjutnya Field Papers Anda seharusnya sudah mulai ter-download. Jika Field Papers Anda langsung termuat di dalam browser, Anda harus menyimpan file tersebut dengan mengklik :menuselection:`File > Save`.

source: When the download is finished, open the PDF file. Connect your computer to a printer and print the page. If everything goes well, you should now have your map printed on paper.
id: Ketika download telah selesai, buka file PDF. Hubungkan komputer Anda dengan sebuah printer dan cetaklah halaman. Jika semuanya berjalan dengan lancar, seharusnya kini Anda telah mendapatkan Field Papers Anda yang telah tercetak di atas kertas.

source: 4. Map with Field Papers
id: 4. Pemetaan dengan Field Papers

source: Take your Field Paper outside, and use it as a guide to walk and identify new places that are not on the map.
id: Bawalah Field Papers Anda keluar, dan gunakan sebagai panduan untuk berjalan dan mengidentifikasi tempat-tempat baru yang belum ada pada peta.

source: Draw lines for roads, shapes for buildings, and so forth. Write notes about each location directly on the map, or write numbers on the map that relate to numbers in your notebook, where you can write more detailed information about each object.
id: Gambarlah garis untuk jalan, bentuk untuk bangunan, dan seterusnya. Tulislah catatan tentang setiap lokasi secara langsung pada peta, atau tulislah angka pada peta yang menghubungkan objek pada peta dengan catatan, dimana Anda menuliskan informasi yang lebih detail tentang objek Anda.

source: When you are satisfied with your additions on the paper map, then you are ready to add them digitally into OSM.
id: Ketika Anda sudah merasa puas dengan penambahan Anda pada Field Papers Anda, kemudian Anda dapat menambahkannya secara digital ke dalam OSM.

source: 5. Scan and upload
id: 5. *Scan* dan *upload*

source: Field Papers are useful for mapping with nothing more than paper, but they are not 100% magic. We will still need to add our paper into JOSM, add our information digitally and save the changes on OSM.
id: Field Papers sangat berguna untuk melakukan pemetaan lebih dari kertas, namun Field Papers tidak 100% ajaib. Kita masih perlu menambahkan Field Papers ke dalam JOSM, menambahkan informasi kita secara digital, kemudian menyimpan perubahan kita pada OSM.

source: The first step is to scan your Field Paper. Do this by attaching a scanner to your computer, scanning the paper and saving it as an image file. If you don’t have a scanner, take a photograph of the paper, but be careful to take a good quality photo. Make sure that the paper is flat and the camera is directly in front of it. Be sure to include the barcode in the image, as Field Papers will not work without it. Here is an example of a scanned/photographed image:
id: Langkah pertama adalah scan Field Papers Anda. Anda bisa melakukan hal ini dengan memasang dan menghubungkan sebuah scanner ke komputer Anda, scan kertas dan menyimpan hasil scan tersebut menjadi sebuah file gambar. Jika Anda tidak memiliki scanner, Anda dapat mem-foto kertas Field Papers Anda, namun Anda harus berhati-hati agar dapat mengambil gambar yang baik. Pastikan Field Papers Anda dalam kondisi benar-benar datar dan kamera Anda tepat berada di depan kertas Field Papers. Pastikan Anda mengikutsertakan barcode untuk Anda foto, karena Field Papers tidak akan bekerja tanpa barcode ini. Berikut ini adalah contoh kertas Field Papers yang telah di-scan ataupun difoto :

source: Once your Field Paper is scanned and saved on the computer, open your web browser and return to the http://fieldpapers.org/ just as before.
id: Begitu Anda men-scan Field Papers dan menyimpannya di komputer Anda, buka browser internet Anda dan bukalah situs <http://fieldpapers.org/>`_

source: Click the :guilabel:`Upload` tab at the top of the page.
id: Klik pada :guilabel:`Upload` di sisi atas halaman.

source: Click :guilabel:`Choose File` and navigate to the file where you scanned/photographed your Field Paper.
id: Klik :guilabel:`Choose File` dan arahkan ke file hasil scan/foto Field Papers Anda.

source: Click :guilabel:`Upload`. It may take a few minutes for the paper to upload, depending on the speed of your internet connection.
id: Klik :guilabel:`Upload`. Proses upload ini membutuhkan beberapa menit, tergantung pada kecepatan koneksi internet Anda.

source: You’ll be able to add additional notes to your Field Paper, but we will skip this for now. Click :guilabel:`Finished`.
id: Anda dapat menambahkan catatan tambahan pada Field Papers Anda, namun untuk saat ini kita akan melewatinya. Klik :guilabel:`Finished`.

source: 6. Open in JOSM
id: 6. Buka JOSM

source: When the scan has been processed, it can be added as a background layer in JOSM. To display Field Papers in JOSM, the fieldpapers plugin must be installed.
id: Ketika hasil scan Anda telah selesai diproses, kini dapat ditambahkan sebagai latar belakang layer didalam JOSM. Untuk menampilkan hasil scan Field Papers didalam JOSM, Anda dapat menggunakan plugin fieldpapers yang harus terinstall.

source: Open JOSM and go to :menuselection:`Edit ‣ Preferences`.
id: Buka JOSM dan klik :menuselection:`Edit > Preference`

source: Go to the :guilabel:`Plugins` tab.
id: Pilih tab :guilabel:`Plugins`

source: Type :kbd:`fieldpapers` in the :guilabel:`Search` box. After it is found, check the box next to it. Click :guilabel:`OK` and restart JOSM.
id: Ketikkan :kbd:`fieldpapers` pada kotak :guilabel:`Search`. Setelah ditemukan, beri tanda centang pada kotak selanjutnya. Klik :guilabel:`OK` dan Restart JOSM.

source: Open your browser and go to the `Field Papers website <http://fieldpapers.org>`_.
id: Buka browser Anda dan buka situs <http://fieldpapers.org>`_.

source: Click :guilabel:`Watch`. Then move your mouse to the bottom and click :guilabel:`Snapshots`.
id: Klik :guilabel:`Watch`. Kemudian arahkan mouse ke bawah dan klik :guilabel:`Snapshots`.

source: You will see all of the Field Papers that users around the world have uploaded. Find your image, and then click on it.
id: Anda akan melihat semua Field Papers yang telah diupload pengguna lainnya di seluruh dunia. Temukan foto Anda, dan klik pada foto tersebut.

source: We need the URL to load the Field Paper into JOSM. The URL is the web address at the top of the page, which will be something like: *http://fieldpapers.org/snapshot.php?id=67v87z5n#18/-5.15534/119.43913*
id: Kita memerlukan URL untuk memuat Field Paper ke dalam JOSM. URL adalah alamat web yang terletak diatas halaman, contonya seperti ini : *http://fieldpapers.org/snapshot.php?id=67v87z5n#18/-5.15534/119.43913*

source: Copy the URL by selecting it and pressing :kbd:`CTRL + C`.
id: *Copy* URL dengan memilihnya dan tekan :kbd:`CTRL + C`.

source: Open JOSM. Since you installed the plugin, there should be a new Field Papers menu at the top.
id: Buka JOSM. Setelah Anda menginstall plugin, seharusnya terdapat Menu Field Papers di bagian atas.

source: Go to :menuselection:`Field Papers ‣ Scanned Map` and paste the URL by pressing :kbd:`Ctrl + V` on your keyboard.
id: Klik :menuselection:`Field Papers > Scanned Map` dan *paste* alamat URL dengan cara tekan tombol :kbd:`Ctrl + V` pada keyboard.

source: Click :guilabel:`OK`.
id: Klik :guilabel:`OK`.

source: Wait a moment until the Field Paper appears in your JOSM layers.
id: Mohon tunggu beberapa saat sampai muncul peta field papers pada layer JOSM Anda.

source: Now you have a Field Papers layer that can be used as a reference to add OSM data. It is like using imagery to identify objects on the ground, but instead there are detailed drawings and notes from your field survey. Later, when we have learned to access OSM data through JOSM, this can be used as a reference to edit the map.
id: Sekarang Anda telah memiliki layer Field Papers yang digunakan sebagai referensi untuk menambahkan data OSM. Itu seperti menggunakan citra satelit untuk mengidentifikasi objek pada permukaan bumi, tetapi ini lebih detail karena menggambar dan menambahkan catatan dari survei lapang. Kemudian, ketika kita telah belajar untuk mengakses data OSM melalui JOSM, ini dapat digunakan sebagai referensi untuk mengedit peta.

source: :ref:`Go to next module --> <editing-osm-with-josm>`
id: :ref:`Modul selanjutnya --> <editing-osm-with-josm>`
