Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/old-training/beginner/osm/106-editing-osm-with-josm.po
Languages: id

source: Go to :menuselection:`File ‣ Upload Data`. This opens the :guilabel:`Upload` window. This can be accessed more simply by clicking the :guilabel:`Upload` button, shown here:
id: Klik menu :menuselection:`File ‣ Upload Data`. Buka jendela :guilabel:`Upload`. Anda juga dapat mengakses lebih mudah dengan mengklik tombol :menuselection:`Upload` seperti di samping ini:

source: The window that appears shows a list of the objects that you are adding and the objects you are modifying or deleting. In the box at the bottom you are asked to provide a comment about the changes that you are making. Type in here a description of your edits.
id: Jendela yang muncul menampilkan daftar objek yang Anda tambahkan, edit, atau pun Anda hapus. Pada kotak di bagian bawah, Anda diminta untuk memberikan komentar tentang perubahan yang Anda buat. Ketikkan disini deskripsi dari perubahan Anda.

source: Click :guilabel:`Upload Changes`.
id: Klik tombol :guilabel:`Upload Perubahan`.

source: If this is your first time saving changes to OSM, you will be asked for the username and password that you created in Module 2. Enter them in the window that appears. If you check the box in this window, your username and password will be saved and you won’t need to enter them again in the future. Click :guilabel:`Authenticate`.
id: Jika ini adalah pertama kali Anda menyimpan perubahan peta Anda pada OSM, Anda akan ditanya tentang nama pengguna dan kata sandi yang telah Anda buat pada Modul 2. Masukkan pada jendela yang telah tersedia. Jika Anda centang kotak ini, maka nama pengguna dan kata sandi Anda akan tersimpan dan Anda tidak perlu mengetikkan nama pengguna dan kata sandi Anda pada upload berikutnya. Selanjutnya klik :guilabel:`Membuktikan`.

source: Wait a few seconds for your changes to be uploaded, and then you are done! You have made your first edits to OSM. You may continue editing to add all your points if you wish. Always be sure to upload your changes before closing JOSM.
id: Dibutuhkan beberapa menit hingga perubahan-perubahan Anda ter-upload dan kemudian tunggu dan lihat hasilnya! Anda baru saja selesai mengedit untuk pertama kalinya pada OSM. Anda dapat melanjutkan pengeditan untuk menambahkan titik-titik yang diinginkan. Selalu pastikan bahwa Anda meng-upload perubahan Anda sebelum Anda menutup JOSM.

source: After you have uploaded all your changes, you can see the updated map.
id: Setelah Anda sudah mengupload semua perubahan, Anda dapat lihat pada peta yang terbaru.

source: Open your internet browser and go to `openstreetmap.org <http://openstreetmap.org>`_
id: Buka browser internet Anda, kemudian buka alamat situs berikut `openstreetmap.org <http://openstreetmap.org>`_

source: Move the map to the area that you edited.
id: Geser peta OpenStreetMap ke area yang telah Anda edit.

source: You should see your changes now on the map! If you don’t, try pressing :kbd:`CTRL+R` to refresh the web page. Sometimes the map doesn’t update properly and needs to be reloaded.
id: Seharusnya Anda sekarang telah melihat perubahan Anda pada peta!. Jika Anda tidak melihat perubahan peta yang baru saja Anda lakukan, Refresh halaman browser Anda, dengan menekan :kbd:`CTRL + R` pada keyboard Anda. Jika masih belum tampak perubahan yang Anda buat, terkadang browser belum mengupdate peta dengan baik, maka reload kembali halaman Anda.

source: What if you don’t see your changes? Don’t worry - it may take a few minutes for the changes to be shown on the map. Also, check your additions in JOSM to make sure that you added them correctly. A good general rule is, if your point has an icon in JOSM, then it should be seen on the main map on the OSM website.
id: Bagaimana jika perubahannya masih belum tampak? Jangan khawatir, terkadang memang dibutuhkan waktu beberapa menit hingga perubahan Anda muncul pada peta. Juga periksa penambahan-penambahan yang Anda buat pada JOSM untuk memastikan bahwa Anda telah membuatnya dengan benar. Ada satu petunjuk sederhana, jika titik-titik Anda telah tampil dengan suatu simbol/ikon tertentu pada JOSM, objek tersebut seharusnya juga muncul pada situs OSM.

source: 6. Saving OSM files
id: 6. Cara Menyimpan File OSM

source: Sometimes after you download some OSM data, you may wish to save it so that you can edit it offline, and then upload it later when you have internet access again.
id: Setelah Anda mendownload beberapa data OSM, terkadang Anda mungkin ingin menyimpan data tersebut, kemudian Anda ingin mengeditnya secara offline dan mengupload hasil edit tersebut ketika Anda mendapat koneksi internet.

source: To save an OSM file, make sure that it is the active layer in the the Layers panel. Go to :menuselection:`File ‣ Save`. Choose a location for the file and give it a name. It can also be saved by clicking this button:
id: Untuk menyimpan file OSM, pastikan bahwa layer yang aktif pada panel Layer. Pilih :menuselection:`Berkas ‣ Simpan`. Pilih lokasi untuk file dan beri nama. Anda juga dapat menyimpan file OSM Anda dengan mengklik ikon berikut ini:

source: You can now close JOSM and your data will be saved. When you want to open the file again, simply open JOSM and go to :menuselection:`File ‣ Open...`.
id: Sekarang Anda dapat menutup JOSM dan data Anda akan tersimpan. Ketika Anda ingin membuka file tersebut, Anda tinggal membuka JOSM, kemudian klik menu :menuselection:`Berkas ‣ Buka...`.

source: While it is possible to download OSM data, save it, and then upload later when you are connected to the internet, this may cause problems, especially if a lot of time passes between the time you download and the time you upload the changes. If another OSM user edits the same area and the same objects during this time, it may cause conflicts to occur. Try not to let too much time pass between downloading and uploading data.
id: Ketika memungkinkan untuk download data OSM, simpan itu, dan kemudian upload kemudian ketika Anda memiliki koneksi internet, ini mungkin penyebab masalah, terutama jika banyak waktu diantara waktu Anda mendownload dan waktu Anda upload perubahan. Jika pengguna OSM lainnya mengedit area dan objek yang sama pada waktu yang bersamaan, itu akan menyebabkan terjadinya konflik. Cobalah untuk tidak terlalu lama dalam rentang waktu diantara mendownload dan mengupload data.

source: 7. Using keyboard shortcuts
id: 7. Penggunaan Jalan Pintas Keyboard

source: It can be dizzying to click over and over again between the various tools and menus in JOSM. Fortunately, there are shortcuts for most actions in JOSM with a simple press of the keyboard. Here is a list of commonly used keyboard shortcuts and their associated functions:
id: Terkadang Anda bisa menjadi pusing untuk mengklik lagi dan lagi untuk memilih berbagai pilihan dan menu yang berbeda dalam JOSM. Untungnya dalam JOSM terdapat jalan pintas atau *shortcut* pada keyboard yang memungkinkan Anda untuk melakukan hal-hal umum. Di bawah ini adalah sebuah daftar dari jalan pintas pada keyboard beserta fungsinya yang pada umumnya digunakan:

source: :kbd:`S`: Select tool (select objects)
id: :kbd:`S`: Select tool (memilih objek)

source: :kbd:`A`: Draw tool (draw objects)
id: :kbd:`A`: Draw tool (menggambar objek)

source: :kbd:`Minus` (or :kbd:`Ctrl + >`): Zoom out
id: :kbd:`Minus` (or :kbd:`Ctrl + >`): Zoom out - untuk memperkecil tampilan

source: :kbd:`Plus` (or :kbd:`Ctrl + <`): Zoom in
id: :kbd:`Plus` (or :kbd:`Ctrl + <`): Zoom in - untuk memperbesar tampilan

source: :kbd:`P`: Split Way
id: :kbd:`P`: Split Way - memisahkan garis

source: :kbd:`C`: Combine Way
id: :kbd:`C`: Combine Way - menggabungkan garis

source: :kbd:`O`: Align in Circle (set the points into a circle)
id: :kbd:`O`: Align in Circle (mengatur susunan dari titik-titik menjadi sebuah lingkaran)

source: :kbd:`L`: Align in line (set the points into a straight line)
id: :kbd:`L`: Align in line (mengatur susunan dari titik-titik menjadi sebuah garis lurus)

source: :kbd:`Q`: Orthogonalise (make into a square shape)
id: :kbd:`Q`: Orthogonalise (membuat suatu bentuk menjadi sebuah persegi)

source: :ref:`Go to next module --> <imagery-offset>`
id: :ref:`Modul selanjutnya --> <imagery-offset>`
