Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/old-training/beginner/osm/106-editing-osm-with-josm.po
Languages: id

source: Module 6: Editing OpenStreetMap with JOSM
id: Modul 6: Mengedit OpenStreetMap dengan JOSM

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Download OSM data in the area you want to edit
id: Memahami cara mendownload data OSM pada area yang akan Anda edit

source: Select layers
id: Memahami cara memilih layer

source: Edit OSM data
id: Memahami cara mengedit data OSM

source: Edit and understand tags
id: Memahami cara mengedit dan memahami tag

source: Upload OSM data
id: Mengetahui cara mengupload data OSM

source: Save OSM files
id: Mengetahui cara menyimpan file OSM

source: In :ref:`Module 3 <working-with-josm>` we installed JOSM and began drawing our first points, lines, and shapes. We added presets to these objects to attach information about them. At the end, you were able to draw your own map in JOSM.
id: Pada :ref:`Modul 3 <working-with-josm>` kita telah menginstal JOSM dan mulai menggambar objek titik, garis, dan bentuk/poligon pertama Anda. Kita tambahkan preset pada objek-objek tersebut untuk memberikan informasi tentang objek itu sendiri. Dan akhirnya, Anda dapat menggambarkan peta Anda pada JOSM.

source: Drawing maps was an exercise to learn JOSM and learn how to draw places on the map. But our maps were not accurate, because we had not yet included location. In the past two modules we have examined two tools, GPS and Field Papers, which allow us to collect actual locations of places. These locations are represented by coordinates.
id: Menggambar peta merupakan latihan untuk mempelajari JOSM dan bagaimana menggambarkan tempat diatas peta. Namun, peta kita belum akurat karena kita tidak memberikan lokasi yang benar. Pada dua modul sebelumnya, kita telah mempelajari dua *tool*, GPS dan Field Papers, yang memungkinkan kita untuk mengumpulkan lokasi dari suatu tempat. Lokasi ini direpresentasikan dengan koordinat.

source: Drawing a real map, that is, a map where all the points, lines and shapes are in their proper location, is no different than drawing the maps we drew previously. But now, we will utilise our GPS points and tracks, and our Field Papers, to draw similar maps at their correct locations on the planet.
id: Menggambar peta sesungguhnya yaitu peta dimana setiap titik, garis, dan bentuk/poligon berada pada lokasi yang sesungguhnya tidaklah berbeda dengan menggambar peta yang kita gambar sebelumnya. Namun sekarang, kita akan menggunakan titik dan *track* dari GPS, dan Field Papers, untuk menggambar peta yang serupa dengan lokasi yang sebenarnya di muka bumi.

source: In this module we will learn how to edit the map on OpenStreetMap and add our improvements. We’ll learn the basic cycle of mapping on OSM:
id: Pada modul ini kita akan mempelajari bagaimana mengedit dan menambahkan data pada peta OpenStreetMap. Kita akan mempelajari langkah-langkah dasar pemetaan dalam OSM:

source: Edit and add objects on the map
id: Edit dan tambahkan objek pada peta

source: Upload changes to OSM
id: Mengupload perubahan ke OSM

source: See the changes on the map!
id: Lihat perubahan pada peta!

source: 1. Exploring JOSM
id: 1. Mengeksplorasi JOSM

source: Let's begin by exploring a little more in JOSM.
id: Mari mulai dengan mengeksplorasi sedikit lebih banyak pada JOSM.

source: Open JOSM.
id: Buka JOSM.

source: Load your gpx file (tracks and/or waypoints) and your Field Paper in JOSM, as in the previous modules. It is not necessary to open both, but you can if you want. Refer to the previous two modules if you don’t remember how to open these in JOSM.
id: Buka file gpx (*tracks* dan *waypoint*) Anda dan Field Paper Anda pada JOSM, seperti pada modul sebelumnya. Anda tidak harus membuka keduanya, tetapi Anda dapat membukanya jika ingin. Buka kembali dua modul sebelumnya jika Anda tidak ingat bagaimana membuka file tersebut pada JOSM.

source: JOSM has many different buttons and panels. We are already familiar with the main window - this is the map window, and it is where most of the action takes place. Here you view, edit, and add to the OSM data.
id: JOSM memiliki banyak fitur dan panel yang berbeda-beda. Kita telah mengenal halaman utama - ini halaman peta atau *map window*, dan pada halaman ini hampir semua pekerjaan dilakukan. Pada halaman ini, Anda dapat melihat, mengedit, dan menambahkan data OSM.

source: To the right of the map window are a series of panels, which each do something different. When you first install JOSM several panels are shown by default, such as :guilabel:`Layers`, :guilabel:`Properties` and :guilabel:`Selection`. When you select a point, line or shape in the map window, it is shown in the :guilabel:`Selection` panel. Information about the object is shown in the :guilabel:`Properties` panel, and the username of the author of that object is shown in the :guilabel:`Authors` panel.
id: Pada sisi kanan halaman peta terdapat beberapa panel yang masing-masing memiliki tugas dan fungsi yang berbeda-beda. Ketika Anda pertama kali menginstal JOSM beberapa panel telah muncul sesuai dengan pengaturan bawaan, seperti :guilabel:`Layers`, :guilabel:`Properties` dan :guilabel:`Selection`. Ketika Anda memilih suatu objek titik, garis, ataupun bentuk/poligon pada halaman peta, objek tersebut akan muncul pada panel :guilabel:`Selection`. Informasi tentang objek tersebut akan muncul pada panel :guilabel:`Properties`, dan nama pengguna yang membuat objek tersebut akan muncul pada panel :guilabel:`Authors`.

source: On the left side of JOSM, there are several toolbars which consist of many buttons. On the uppermost toolbar are different buttons which change what you can do with your mouse. You are already familiar with the first two, the :guilabel:`Select` tool and the :guilabel:`Draw` tool. The other tools make it easier to zoom in, delete an object, draw a shape or create a line that is parallel to another line.
id: Pada sisi kiri JOSM, terdapat beberapa toolbar yang mana terdiri dari banyak tombol/ikon. Masing-masing toolbar ini memiliki fungsi yang berbeda-beda yang dapat berubah dengan cara menggerakkan mouse Anda. Anda telah mengenal dua toolbar pertama, yaitu tool :guilabel:`Select` dan tool :guilabel:`Draw`. *Tool* yang lain berfungsi untuk mempermudah *zoom in* atau memperbesar peta, menghapus objek, menggambar bentuk-bentuk tertentu, ataupun membuat sebuah garis yang sejajar dengan suatu garis.

source: Below these tools are many more buttons. These buttons control what you see on the right side of JOSM. Using these buttons you can open and close the boxes on the right, such as :guilabel:`Properties`, :guilabel:`Selection` and :guilabel:`Author`.
id: Di bawah *tool* ini terdapat banyak tombol, yang mengontrol apa yang dapat kita lihat pada sisi kanan halaman JOSM. Dengan menggunakan tombol-tombol tersebut, Anda dapat membuka ataupun menutup kotak/panel pada sisi kanan JOSM, seperti :guilabel:`Properties`, :guilabel:`Selection` dan :guilabel:`Author`.

source: 1.1. Downloading OSM Data
id: 1.1. Download Data OSM

source: Remember the cycle of editing OSM described in the introduction of this module? Download, edit, save. Before we can edit the map, we must download the existing OSM data in our area.
id: Masih ingat dengan tahapan mengedit OSM yang dijelaskan pada awal modul ini? Download, edit, simpan. Sebelum kita mengedit peta, kita harus mendownload data OSM pada wilayah kerja kita.

source: When you open a gpx track or Field Paper, the map window will show what you have opened, and will automatically move to the correct coordinates. Look in the bottom left corner of JOSM. Notice the two numbers, which are the latitude and longitude (coordinates) of your mouse cursor.
id: Ketika Anda membuka *track* GPS atau Field Papers, halaman peta akan menunjukkan apa yang Anda buka, dan secara otomatis akan menunjukkan nilai koordinat yang akurat. Lihat pada sudut kiri bawah JOSM. Perhatikan dua angka, yaitu Latitude dan Longitude (koordinat) dari mouse kursor Anda.

source: Because our map window is already showing the area that we want to edit, it is easy to download the OSM data for this area. Go to :menuselection:`File ‣ Download from OSM`. This opens the :guilabel:`Download` window. This can be accessed more simply by clicking the :guilabel:`Download` button, shown here:
id: Karena halaman peta telah menunjukkan area yang akan kita edit, maka mudah saja bagi kita untuk mendownload data OSM sesuai area kerja kita. Klik :menuselection:`File ‣ Download from OSM` akan membuka jendela :guilabel:`Download`. Ini dapat diakses lebih mudah dengan klik ikon :guilabel:`Download` , seperti ini:

source: When the download window opens, you should see a map with a pink box drawn on it. If you don’t see the map, click on the tab marked :guilabel:`Slippy map`.
id: Ketika kotak dialog terbuka, Anda seharusnya melihat sebuah peta dengan kotak berwarna merah muda di atas peta tersebut. Jika Anda tidak melihat peta, klik tab :guilabel:`Slippy map`.

source: The pink box represents the area of the map that you would like to download for editing. Unless you have moved the map window since you opened your GPS file or Field Papers, the box should be drawn around the correct area. However if you would like to download a larger area, draw a new box. To do so, click on the map, hold your left mouse button down and drag the mouse to create a box. Release the mouse button to finish drawing the box.
id: Kotak berwarna merah muda menujukkan area yang akan didownload datanya untuk selanjutnya Anda edit. Jika Anda tidak menggeser peta pada halaman peta ataupun menutup halaman peta dimana Anda membuka file GPS atau Field Papers Anda, kotak merah muda seharusnya sudah tergambar di sekitar area yang benar yaitu pada wilayah kerja Anda. Namun, jika Anda ingin mendownload data untuk wilayah yang lebih luas, Anda dapat menggambar kotak baru. Untuk menggambar kotak baru, klik pada peta, klik kiri dan tahan tombol kiri mouse, kemudian drag mouse Anda untuk membuat sebuah kotak. Lepaskan tombol kiri mouse Anda yang mana sejak tadi Anda tekan dan tahan, untuk menyelesaikan penggambaran kotak merah muda.

source: When you are satisfied with the size and location of the box, click :guilabel:`Download` at the bottom of the window. JOSM will get the data for this area from OSM and open it in your map window for editing.
id: Ketika Anda telah sesuai dengan ukuran dan lokasi/posisi kotak, klik tombol :guilabel:`Download` yang terdapat pada bagian bawah kotak dialog. JOSM akan mendapatkan dan mendownload data OSM untuk area tersebut dan membukanya pada halaman peta untuk selanjutnya Anda edit.

source: 2. JOSM Layers
id: 2. Layer JOSM

source: Open your GPS file and downloaded data from OSM, if you haven’t already. Notice that when you open a file, add Field Papers or download from OSM, another item is added to the :guilabel:`Layers` panel on the right side of JOSM. Your :guilabel:`Layers` panel may look something like this:
id: Buka file GPS Anda dan download data dari OSM, jika belum ada. Perhatikan bahwa ketika Anda membuka sebuah file, atau menambahkan Field Papers, atau mendownload dari OSM, sebuah item baru akan bertambah pada panel :guilabel:`Layers` di sisi kanan JOSM. Panel :guilabel:`Layers` Anda seharusnya terlihat seperti berikut:

source: Each item in this list represents a different source of data that is open in the map window. In the example above, “Data Layer 2” is the OSM data that we want to edit. “Markers” are the waypoints from the GPS, and “30 Juni 2011.gpx” is the track from the GPS. Finally, “Field Papers” is the layer created when we added our Field Paper into JOSM.
id: Setiap item pada daftar tersebut merepresentasikan sumber data yang berbeda yang terbuka pada halaman peta. Pada contoh di atas, “Data Layer 2” merupakan layer yang isinya berasal dari data OSM yang mana akan kita edit. “Penanda” merupakan layer yang isinya adalah *waypoint* dari GPS, dan “30 Juni 2011.gpx” merupakan layer yang isinya adalah *track* GPS. Terakhir, “Field Papers” merupakan layer yang terbentuk saat kita menambahkan Field Papers kita kedalam JOSM.

source: Add the Bing imagery layer, which shows satellite imagery, by going to :menuselection:`Imagery ‣ Bing Sat`.
id: Tambahkan layer citra satelit Bing, yang menunjukkan citra satelit, dengan cara :menuselection:`Imagery ‣ Bing Sat`.

source: To hide one of the layers, select it with your mouse and click the :guilabel:`Show/Hide` button, which looks like this:
id: Untuk menyembunyikan salah satu layer, pilih dengan mouse layer yang ingin Anda sembunyikan tersebut dan klik tombol :guilabel:`Show/Hide` seperti ini:

source: The layer will disappear in the map window. Click :guilabel:`Show/Hide` again, and it will reappear.
id: Layer menjadi tidak tampak pada halaman peta. Klik :guilabel:`Show/Hide` lagi, maka layer muncul kembali.

source: Remove a layer by selecting it and clicking the :guilabel:`Delete` button:
id: Hapus layer yang dipilih dan klik ikon :guilabel:`Delete`:

source: Lastly, it’s important to know that you can only edit the layer that is considered "Active” by JOSM. If you are unable to edit the map in your map window, it’s probably because you don’t have the correct layer set as active. Most layers, such as GPS points, Field Papers, and satellite imagery, can’t be edited. The only layers that can be edited are data from OSM, which are usually called “Data Layer 1”.
id: Terakhir, penting untuk dipahami bahwa Anda hanya dapat mengedit layer yang berada dalam posisi “Aktif” di JOSM. Jika Anda tidak dapat mengedit peta pada halaman peta Anda, hal ini kemungkinan karena layer yang aktif. Sebagian besar layer, seperti titik GPS, Field Papers, dan citra satelit, tidak bisa diedit. Satu-satunya layer yang bisa diedit dalah layer yang berasal dari OSM, yang biasanya bernama “Data Layer 1”.

source: To make a layer active, select it in the :guilabel:`Layers` panel, and click on the :guilabel:`Activate` button:
id: Untuk mengaktifkan suatu layer, pilih nama layer Anda pada panel :guilabel:`Layer`, kemudian klik tombol :guilabel:`Aktifkan`:

source: 3. Editing
id: 3. Mengedit

source: The next step is to edit the map and add new items. This is not always easy at first, but with practice you will get better and better. Note that you can select tools in JOSM by clicking their buttons in the toolbar, or you can use keys on the keyboard as shortcuts. The shortcut keys are indicated in parentheses below.
id: Langkah selanjutnya adalah mengedit peta dan menambahkan item-item yang baru. Sedikit rumit jika Anda baru pertama kali, namun dengan praktek dan latihan secara rutin Anda akan semakin mahir dan mudah. Perhatikan bahwa Anda dapat memilih *tool* di JOSM dengan klik ikon pada toolbar, atau Anda dapat menggunakan kata kunci pada keyboard sebagai jalan pintas. Jalan pintas tersebut ditunjukkan dengan tanda kurung dibawah.

source: To move a point, line or shape, use the :guilabel:`Select` tool (:kbd:`S`). Click on an object and drag it where it should be. This can be used to correct the location of items that have been put in the wrong place.
id: Untuk memindahkan suatu titik, garis, ataupun bentuk/poligon gunakan *tool* :guilabel:`Select` atau (:kbd:`S`) .Klik pada objek yang ingin digeser/dipindahkan, kemudian drag pada lokasi yang seharusnya. Kita dapat menggunakan cara ini untuk memperbaiki lokasi/posisi objek kita yang mungkin sebelumnya dalam posisi yang salah ataupun kurang tepat.

source: Use the :guilabel:`Draw` tool (:kbd:`A`) to draw new points, lines, and shapes. Attach attributes to these objects by selecting from the :menuselection:`Presets` menu, as we did in Module 3.
id: Gunakan tombol :guilabel:`Draw` tool (:kbd:`A`) untuk menggambar titik, garis, dan bentuk/poligon yang baru. Gunakan menu :menuselection:`Presets` untuk memberikan keterangan-keterangan tentang objek, sebagaimana yang telah dijelaskan pada Modul 3.

source: Remember that your GPS points and Field Papers don’t automatically go into OSM. You need to add them to the OSM map digitally using the :guilabel:`Draw` tool. But your points, tracks, and Field Papers can be seen in the background as a guide.
id: Ingat titik-titik GPS dan Field Paper Anda tidak otomatis masuk menjadi bagian dari data OSM. Anda harus menambahkan titik-titik GPS dan Field Paper Anda ke data OSM secara digital, yaitu dengan menggambar titik-titik tersebut menggunakan tool :guilabel:`Draw`. Jadi, titik-titik GPS, *track*, dan Field Papers Anda hanya menjadi latar belakang sebagai panduan.

source: Let’s assume that you saved a waypoint on your GPS named "030" and wrote in your notebook that 030 is a school. To add this point into OSM, select the :menuselection:`Draw` tool, and double-click on top of point 030 in your map window. This will create a point. Then go to the :menuselection:`Presets` menu, and find the preset for school. Enter the name of the school and click :guilabel:`Apply Preset`. Do the same to add lines and shapes.
id: Sebagai contoh, misalnya Anda menyimpan satu *waypoint* pada GPS Anda dengan nama titik "030", dan pada buku catatan Anda memberikan keterangan bahwa titik 030 adalah sebuah sekolah. Untuk menambahkan titik ini ke OSM, Anda harus menggambarnya sendiri. Caranya, terlebih dahulu klik tombol :menuselection:`Gambar node`, dan lakukan double-klik tepat di atas titik 030 pada halaman peta Anda. Maka akan terbentuk satu objek titik. Klik menu :menuselection:`Presets`, kemudian carilah preset untuk sekolah. Tuliskan nama sekolahnya dan klik :menuselection:`Tambahkan Preset`. Lakukan cara yang sama untuk menggambarkan objek garis dan bentuk/poligon.

source: When you draw a point, line or shape, it has a location, but no information about what it is. In other words, we know where it is, but not what it is. Before now, we have been using items from the :menuselection:`Presets` menu to define what it is. The way OSM knows what an object is is by using tags.
id: Ketika Anda menggambar suatu objek titik, garis, ataupun bentuk/poligon, objek tersebut telah memiliki lokasi, namun tidak ada informasi tentang objek apakah itu. Dengan kata lain, kita tahu dimana objek tersebut, tapi kita tidak tahu apakah itu. Sebelumnya, kita menggunakan menu :menuselection:`Presets` untuk mendefinisikan apakah suatu objek itu. Cara OSM mengetahui apakah suatu objek itu adalah dengan menggunakan tag.

source: A tag is like a label that you can put on something. For example, if we draw a square, it’s only a square. But then we add multiple tags to it that describe what it is:
id: Sebuah tag mirip sebuah label yang mana Anda dapat menambahkan keterangan di dalamnya. Sebagai contoh, Kita menggambar sebuah area persegi, maka persegi tersebut hanyalah sebuah bentuk persegi. Namun kemudian kita menambahkan banyak tag untuk mendeskripsikan objek apakah itu:

source: this square is a building
id: bentuk persegi ini adalah bangunan

source: the name of the building is “Menara Thamrin”
id: nama dari bangunan adalah "Menara Thamrin"

source: the building is 32 levels high
id: bangunan ini memiliki 32 tingkat

source: We can add as many tags as we want to an object. Tags are saved as pairs of text, called the keys and the values. In OSM, the tags written above would be:
id: Kita dapat menambahkan tag sebanyak apapun pada suatu objek. Tag disimpan sebagai sepasang teks, yaitu keys dan values. Pada OSM, tag yang ditulis di atas tersebut sebenarnya tertulis sebagai berikut:

source: When you select an object in JOSM, you can see all the tags that are attached to it in the :guilabel:`Properties` panel on the right.
id: Jika Anda memilih suatu objek pada JOSM, Anda dapat melihat semua tag yang terdefinisi pada panel :guilabel:`Properti` di sisi kanan.

source: 4.1. Editing Tags
id: 4.1. Mengedit Tag

source: You can add, edit and delete these tags from the :guilabel:`Properties` panel. The tags are traditionally in English, so if you prefer you can always use the :menuselection:`Presets` menu to simplify tagging objects. When you add or change tags, such as primary highway versus footpath, the style will change according to the tag.
id: Anda dapat menambahkan, mengedit, dan menghapus suatu tag dari panel :guilabel:`Properties`. Tag-tag ini dalam bahasa Inggris, sehingga Anda lebih baik menggunakan menu :menuselection:`Preset` untuk mempermudah pemberian tag objek. Ketika Anda menambahkan atau mengubah tag, misalnya jalan primer atau jalan setapak, simbol yang akan muncul pada peta akan berubah/berganti sendiri tergantung pada tag yang terdefinisi.

source: To edit an existing object, first select it. Then edit the tags in one of two ways:
id: Untuk mengedit objek yang sudah ada, pertama pilih objek tersebut. Kemudian edit tag dalam satu dari dua cara:

source: Use the :menuselection:`Presets` menu to open up a form and edit the information, or
id: Gunakan menu :menuselection:`Presets` untuk membuka suatu form dan mengedit informasi pada form tersebut, atau

source: Edit the tags directly in the :guilabel:`Properties` window on the right.
id: Mengedit tag secara langsung pada panel :guilabel:`Properti` di sebelah kanan.

source: 4.2. Common Mistake
id: 4.2. Kesalahan Umum

source: A common mistake is to tag nodes when you want to apply tags to lines or polygons.
id: Kesalahan umum salah satunya adalah pemberian tag pada titik ketika Anda ingin memberikan tag ke garis atau poligon.

source: When adding tags to a node, select the node and then add the relevant tags (or use the :menuselection:`Presets` menu). However, when tagging a line or polygon, it is important to select the line, and NOT the nodes that make up the line.
id: Ketika Anda menambahkan tag pada suatu objek titik, Anda terlebih dahulu harus memilih titik Anda kemudian menambahkan tag (atau gunakan menu :menuselection:`presets`). Namun, ketika pemberian tag pada garis atau poligon, itu penting untuk memilih garis, dan BUKAN pada titik-titik penyusun garis.

source: New users frequently use the JOSM :guilabel:`Select` tool to draw a box around an object, which causes everything (both the line or shape as well as its nodes) to be selected. Then when tags are applied to the selected objects, they are applied to the nodes as well. To avoid this, be sure to only select lines when you want to add tags to them.
id: Kesalahan yang umum terjadi pada pengguna baru dalam menggunakan JOSM yaitu menggunakan tool :guilabel:`Select` untuk menggambar kotak yang mengelilingi suatu objek, hal ini mengakibatkan semua elemen dari objek tersebut (baik garis maupun titik-titik pada garis tersebut, menjadi dalam posisi terpilih). Dan ketika Anda memberikan tag, maka tag tersebut akan berlaku untuk semua elemen yang terpilih, bahkan pada titik-titiknya. Untuk menghindarinya, pastikan bahwa Anda hanya memilih garis pada objek yang akan Anda beri tag/keterangan tersebut.

source: More information about tags and presets can be found in the :ref:`Intermediate OpenStreetMap Guide Module 4 <creating-josm-file-presets>`.
id: Untuk informasi lebih lanjut tentang tag dan preset dapat Anda temukan pada :ref:`Panduan OpenStreetMap Tingkat Menengah Modul 4 <creating-josm-file-presets>`.

source: 5. Uploading Changes
id: 5. Upload Perubahan

source: After we have made a couple of changes to improve the map, we need to upload those changes to OSM. To save changes, we must be connected to the internet.
id: Setelah Anda melakukan beberapa perubahan dan perbaikan pada peta, segera simpan perubahan-perubahan tersebut ke OSM. Untuk menyimpan perubahan, kita membutuhkan koneksi internet.
