Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/old-training/beginner/osm/107-imagery-offset.po
Languages: id

source: Module 7: Imagery Offset
id: Modul 7: Pergeseran Citra Satelit

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Understand the definition of imagery offset
id: Memahami pengertian pergeseran citra satelit

source: Understand components of imagery (resolution and georeference)
id: Memahami komponen-komponen citra (resolusi dan georeferensi)

source: Understand how imagery offset occurs
id: Memahami bagaimana pergeseran citra satelit dapat terjadi

source: Fix imagery offset
id: Memperbaiki pergeseran citra satelit

source: Using aerial imagery is the most widely used approach in making maps with OpenStreetMap. Mappers typically use Bing or Mapbox satellite imagery as a background layer, or imagery from another provider. We have already seen this in action. In this module we will learn a little bit more about aerial imagery, and we will learn how to solve the one important problem of using aerial photographs - imagery offset.
id: Menggunakan citra satelit merupakan pendekatan yang paling sering digunakan dalam membuat peta dengan OpenStreetMap. Pembuat peta biasanya menggunakan citra satelit Bing atau Mapbox sebagai latar belakang ketika membuat peta, ataupun citra satelit dari penyedia lain. Kita telah melihat ini dalam kegiatan sebelumnya. Pada modul ini kita akan mempelajari lebih jauh tentang citra satelit, dan kita juga akan mempelajari bagaimana memperbaiki salah satu permasalahan utama dalam menggunakan citra satelit, yaitu pergeseran citra satelit.

source: 1. Components of imagery
id: 1. Komponen citra satelit

source: Aerial imagery is the term that we use to describe photographs that are taken from the sky. These can be taken from airplanes, helicopters, or even kites and balloons, but the most common source of imagery comes from satellites orbiting the Earth.
id: Foto udara merupakan istilah yang digunakan untuk menjelaskan sebuah foto yang diambil dari langit. Foto ini bisa berasal dari pesawat, helikopter, atau bisa juga dari layang-layang dan balon udara, tetapi salah satu sumber pengambilan gambar yang paling umum berasal dari satelit yang mengorbit mengelilingi bumi.

source: In the :ref:`module on GPS<using-gps>` we learned about the dozens of satellites orbiting Earth which allow our GPS receivers to identify latitude and longitude. In addition to these GPS satellites, there are also satellites which take photos of the earth. These photos are then manipulated so that they can be used in GIS (mapping) software. Bing Aerial Imagery is made up of satellite photos.
id: Pada :ref:`module GPS<using-gps>` kita telah mempelajari sejumlah satelit yang mengorbit mengelilingi bumi yang membantu GPS kita mengidentifikasi posisi kita dalam garis lintang dan bujur. Lebih lanjut, selain satelit GPS terdapat pula satelit yang mengambil gambar permukaan bumi. Foto ini dimanipulasi sedemikian rupa sehingga mereka bisa menggunakannya untuk keperluan pemetaan (mapping) melalui software GIS. Citra satelit Bing merupakan salah satu contoh dari citra satelit ini.

source: Let's look at a couple of the components of aerial imagery - resolution and georeferencing.
id: Mari lihat beberapa komponen dari citra satelit - resolusi dan georeferensi.

source: 1.1. Resolution
id: 1.1 Resolusi

source: All digital photographs are made up of pixels. If you zoom in very close on a photograph, you will notice the the image starts to get blurry, and eventually you’ll see that an image is made up of thousands of little squares that are each a different colour. This is true whether the photograph is taken with a handheld camera, a mobile phone or a satellite orbiting Earth.
id: Semua fotografi digital terdiri dari piksel. Jika Anda memperbesar lebih dekat pada sebuah foto digital, Anda akan menyadari bahwa gambar berubah menjadi samar/tidak jelas dan semakin Anda memperbesar gambar tersebut Anda akan melihat sebuah gambar yang terdiri dari ribuan kotak kecil yang terdiri dari warna yang berbeda. Hal ini berlaku pada semua foto digital yang diambil baik menggunakan kamera saku, handphone, atau satelit yang mengorbit mengelilingi bumi.

source: Resolution refers to the number of pixels wide by the number of pixels high that an image is. More pixels means higher resolution, which means that you are able to see greater detail in the photograph. Resolution in handheld cameras is often measured in megapixels. The more megapixels your camera is able to record, the higher the resolution of your photos.
id: Resolusi merepresentasikan jumlah piksel yang berada dalam panjang dikali dengan jumlah piksel yang berada dalam lebar. Semakin banyak jumlah pixel berarti semakin besar resolusinya, yang berarti Anda dapat melihat lebih foto digital lebih detil. Resolusi yang ada dikamera biasanya disebut dalam satuan megapiksel. Semakin banyak megapiksel dari sebuah kamera, semakin tinggi resolusi yang dihasilkan dari foto tersebut.

source: Aerial imagery works the same, except that we talk about resolution differently. Measurement is important with aerial photographs - hence, a pixel represents a certain measurable area on the surface of the Earth. We usually describe imagery as something like "two metre resolution imagery", which means that one pixel in the image is equivalent to two metres on the ground. One metre resolution imagery would have a higher resolution than this, and 50cm resolution would be higher still. This is generally the range of imagery that is provided by Bing, though it varies between locations, and in many places it is worse than two metres, at which point it becomes difficult to identify objects in the image.
id: Sama halnya dengan citra satelit, kecuali biasanya kita berbicara mengenai resolusi secara berbeda. Pengukuran dengan foto udara adalah penting - piksel mewakili jarak tertentu di atas permukaan Bumi. Kita biasanya mendeskripsikan citra sebagai sesuatu seperti “citra resolusi dua meter,” yang berarti bahwa satu piksel setara dengan dua meter di tanah. Citra satelit dengan resolusi satu meter akan memiliki resolusi yang lebih tinggi dari ini, dan resolusi 50 cm juga akan lebih tinggi. Hal ini umumnya rentang dari citra yang disediakan oleh Bing, meskipun bervariasi antara lokasi dan di banyak tempat, resolusi citra satelit lebih buruk dari dua meter, sehingga pada suatu tempat akan terlihat sulit untuk mengidentifikasi objek dalam gambar.

source: The higher the resolution of an aerial image, the easier it is to use in making maps.
id: Resolusi yang lebih tinggi dari gambar citra, memudahkan untuk digunakan dalam membuat peta.

source: 1.2. Georeferencing
id: 1.2 Georeferensi

source: Every aerial image is georeferenced, meaning that it is manipulated so that it can be shown in its correct location on the Earth. Georeferencing is a relatively complex process, because images are flat and the Earth is round, and the images need to be positioned and stretched so that the pixels are accurately positioned on the planet.
id: Semua citra satelit sudah tergeoreferensikan, yang berarti sudah dimanipulasi sedemikian rupa agar dapat muncul sesuai dengan lokasi yang sesuai pada permukaan bumi. Georefensi merupakan proses yang rumit, karena setiap gambar berbentuk bidang datar sedangkan bumi berbentuk bulat dan gambar tersebut harus diposisikan dan ditarik sedemikian rupa supaya gambar tersebut sesuai dengan posisi di permukaan bumi.

source: The imagery available to us is already georeferenced, so it is not something that we need to concern ourselves with too deeply. We can happily use imagery to help add to OSM, so long as we understand a little bit about the imagery we are using, and so long as we are aware of one common pitfall - imagery offset.
id: Semua citra satelit yang kita lihat sudah tergeoreferensikan, sehingga hal tersebut bukanlah sesuatu yang harus kita pahami lebih dalam. Kita bisa menggunakan citra satelit tersebut ke dalam OSM, selama kita mengerti tentang lisensi citra satelit yang kita gunakan, dan selama kita paham dengan kesalahan umum yang ada, yaitu pergeseran citra satelit.

source: 2. Imagery offset
id: 2. Pergeseran citra satelit

source: Imagery providers usually do a pretty good job of georeferencing their imagery, but occasionally the images can be a little bit out of position. This is particularly true in hilly or mountainous areas, where it can be difficult to stretch a flat image over an area of the Earth with many contours. When you load imagery in JOSM, it can sometimes be ten metres or more from its true position. This is called imagery offset.
id: Penyedia layanan citra satelit biasanya telah melakukan georeferensi citra satelit mereka, tetapi beberapa citra satelit tidak terletak sempurna. Ini biasanya terjadi di daerah pegunungan atau daerah berbukit-bukit, dimana sangat sulit untuk menarik gambar datar sesuai permukaan bumi yang memiliki kontur. Ketika Anda menampilkan gambar di JOSM, terkadang mengalami pergeseran sejauh sepuluh meter atau lebih dari posisi sesungguhnya. Ini yang disebut dengan pergeseran citra satelit.

source: Aerial imagery layers are composed of many photographs of the Earth's surface that have been georeferenced and then stitched together. Imagery providers cannot verify the accuracy of every photo, so some images may be shifted from their actual positions. This might be a shift of a couple metres, or in rare instances up to hundreds of metres. In mountainous areas, imagery may be distorted non-linearly, which means that nearby parts of the same image may be shifted in many different directions.
id: Layer citra satelit terdiri dari beberapa foto permukaan bumi yang telah digeoreferensikan dan digabung bersama. Penyedia citra satelit tidak bisa memverifikasi akurasi dari setiap foto, sehingga beberapa citra mungkin mengalami pergeseran dari posisi yang ada. Pergeseran ini bisa saja beberapa meter, atau dalam beberapa kasus bisa lebih dari beratus-ratus meter. Di area pegunungan, citra satelit mungkin mengalami distorsi non liniear, yang berarti beberapa bagian dari citra satelit mungkin bergeser ke beberapa arah.

source: Notice in the following image that two separate aerial photographs have been georeferenced and merged together. Because georeferencing is not a perfect process, the images do not line up perfectly with each other. Hence one, or both, must be inaccurate.
id: Perhatikan pada gambar dibawah ini terdiri dari dua gambar yang telah di georeferensikan dan digabungkan bersamaan. Karena proses georeferensinya tidak bisa sempurna, gambar tersebut tidak sesuai satu sama lain. Salah satu, atau mungkin kedua-duanya bisa saja tidak akurat.

source: We’ve learned about two major ways of making maps - one is by utilising aerial imagery to identify features on the ground, and another is by using GPS to record tracks and waypoints and then add them to OSM. The advantage of aerial imagery is obvious. It enables you, the mapper, to see the whole picture, to observe various details from the image, consider your knowledge of the area, and easily trace roads, buildings and areas. One key advantage of GPS however, is that it doesn’t suffer from offset like imagery. A GPS will always provide you with a correct latitude and longitude. The only exception is when the satellite signals are interrupted by tall buildings or mountains, but in this case it is easy to recognise the error. Observe the GPS trace in this image, compared with the Bing aerial imagery layer beneath it:
id: Kita telah mempelajari bahwa terdapat dua cara untuk membuat peta - pertama dengan menggunakan citra satelit untuk mengidentifikasi sebuah kenampakan di permukaan bumi dan salah satunya menggunakan GPS untuk mencatat track dan waypoint dan kemudian ditambahkan ke dalam OpenStreetMap. Banyak sekali keuntungan dalam penggunaan citra satelit. Ini akan memudahkan Anda, pembuat peta, untuk melihat gambar keseluruhan, untuk mengamati beberapa detail dari gambar tersebut, selain dari Anda akan mendapatkan pengetahuan tentang area tersebut, dan akan mudah untuk menggambar jalan, bangunan dan area. Salah satu keuntungan dari GPS adalah tidak mengalami pergeseran seperti citra satelit. Sebuah GPS akan selalu memberikan posisi lintang dan bujur yang tepat. Salah satu kerugiannya adalah sinyal satelit tersebut dapat diganggu oleh bangunan tinggi dan pegunungan, tetapi dalam kasus ini sangatlah mudah untuk mengetahui kesalahan. Tampilkan trek GPS pada gambar citra satelit ini dan bandingkan dengan citra Bing dibawahnya:

source: Because of what we now know, it is clear that the GPS trace is likely to be accurate, and the image beneath it is out of place.
id: Dengan begitu kita akan tahu bahwa trek GPS akurat dan citra satelit dibawahnya mengalami pergeseran.

source: So now we must ask, “if the imagery may be out of place, how can we still use it and make accurate maps?”
id: Sekarang kita pasti akan bertanya, “jika citra satelit mengalami pergeseran, bagaimana kita dapat menggunakan dan membuat peta yang akurat?”

source: 3. Correcting imagery offset
id: 3. Memperbaiki citra satelit

source: The answer to the preceding question is that we can move the imagery so that it aligns with things that we know are in the correct location, such as GPS tracks. It is easy to correct imagery offset in JOSM.
id: Jawaban untuk pertanyaan sebelumnya adalah kita dapat menggeser citra satelit agar sesuai dengan posisi yang kita ketahui adalah posisi yang tepat, seperti track GPS. Hal ini sangat mudah untuk memperbaiki pergeseran citra satelit di JOSM.

source: The best references for adjusting imagery are GPS tracks that follow roads. And the more GPS tracks that you have to reference, the more accurate you will be able to align your imagery. Since OSM users often upload their GPS tracks to the OSM database, we can download them and use them to align our imagery.
id: Salah satu referensi terbaik untuk mengatur citra satelit adalah menggunakan track GPS yang mengikuti jalan. Semakin banyak track GPS yang Anda miliki, semakin akurat Anda untuk memperbaiki pergeseran citra satelit. Saat ini pengguna OpenStreetMap seringkali upload track GPS mereka kedalam database OSM, kita dapat download dan menggunakannya untuk memperbaiki posisi citra satelit kita.

source: In JOSM, click on the :guilabel:`Download` button.
id: Pada JOSM, klik tombol :guilabel:`Download`.

source: Check the box next to :guilabel:`Raw GPS Data` near the top of the :guilabel:`Download` window. Select your area and click :guilabel:`Download`.
id: Centang kotak di samping tulisan :guilabel:`Raw GPS Data` yang berada di posisi atas dari jendela :guilabel:`Download`. Pilih area Anda dan klik :guilabel:`Download`.

source: This will download an additional layer to JOSM containing GPS tracks. Depending on how many tracks have been uploaded by OSM users, you may see few tracks (or even no tracks):
id: Ini akan mendownload layer tambahan di JOSM yang terdiri dari track GPS. Tergantung dari seberapa banyak track yang sudah diupload oleh pengguna OSM, Anda mungkin akan melihat beberapa track (bisa juga tidak ada track GPS sama sekali):

source: Or, you may see many tracks:
id: Atau, Anda dapat melihat jumlah track yang banyak:

source: Add an imagery layer (such as Bing Sat) to JOSM.
id: Tambahkan layer citra satelit (misalnya Bing Sat) ke JOSM.

source: To adjust an imagery layer, click on the :guilabel:`Adjust imagery offset` button at the top of JOSM, and then click :guilabel:`New Offset`.
id: Untuk mengatur citra satelit, klik pada tombol :guilabel:`Atur offset citra` di bagian atas JOSM, dan kemudian klik :guilabel:`Offset Baru`.

source: Ignoring the box that pops up, use your mouse to drag the imagery layer so that it aligns correctly with the GPS tracks. The GPS tracks should line up with the roads on the imagery as closely as possible. You will see the offset numbers in the box change.
id: Abaikan kotak yang muncul, gunakan mouse Anda untuk menggeser citra sehingga akan terposisi sejajar dengan track GPS. Track GPS harus terposisikan sama dengan gambar jalan sedekat mungkin. Anda akan melihat angka offset berubah di kotak tersebut.

source: If you like, you can save these offset settings by entering a bookmark name and then clicking :guilabel:`OK`. You can then automatically apply the same settings later by going to :menuselection:`Imagery ‣ Imagery offset` and clicking on your bookmark.
id: Jika ingin, Anda bisa menyimpan pengaturan pergeseran ini dengan memasukkan nama penanda dan klik :guilabel:`OK`. Anda kemudian dapat secara otomatis mengaplikasikan pengaturan yang sama dengan menuju ke :menuselection:`Citra Satelit ‣ Pergeseran citra` dan klik penanda yang Anda simpan.

source: If you do not want to save the offset, simply click :guilabel:`OK` without entering a bookmark name.
id: Jika Anda tidak ingin menyimpan pergeserannya, klik :guilabel:`OK` tanpa harus memasukkan nama penanda.

source: What if there are no GPS tracks on OSM, and you don’t have a GPS? Without GPS tracks, it is difficult to align imagery. If it is a relatively empty area (not much mapping done), you might choose to simply use the imagery as it is and correct the data later. It’s better to map an area 20 or 30 metres offset than to not map it at all.
id: Bagaimana jika tidak ada track GPS di OpenStreetMap, dan Anda tidak mempunyai GPS? Tanpa track GPS, akan sulit sekali mengatur citra. Jika itu merupakan area yang relatif kosong (tidak banyak yang dipetakan), Anda mungkin bisa memetakan terlebih dahulu dan memperbaikinya nanti. Akan lebih baik untuk memetakan sebuah dengan offset area 20 atau 30 meter daripada tidak memetakan sama sekali.

source: If you can positively identify the latitude and longitude of one object on the ground, you can ensure the imagery is correctly placed by following these steps:
id: Jika Anda yakin koordinat posisi dari suatu objek di permukaan tanah, Anda dapat memastikan bahwa citra satelit tersebut terposisikan sempurna dengan melakukan tahap ini:

source: First, identify the object whose position you know on the imagery.
id: Pertama, identifikasikan posisi objek yang Anda ketahui di citra.

source: Click on the latitude and longitude in the bottom left corner of JOSM.
id: Klik pada garis lintang dan bujur pada bagian kiri bawah JOSM.

source: In the dialog that opens, enter the latitude and longitude of the place that you know, and enter a small number for :guilabel:`Zoom`, about five or 10.
id: Pada kotak dialog yang muncul, masukkan koordinat lintang dan bujur dari sebuah tempat yang Anda ketahui dan masukkan angka untuk :guilabel:`Perbesar`, sekitar lima atau 10.

source: This will zoom and centre the map to your longitude and latitude. Now you can move the imagery as you did previously so that the feature you know is centred at the correct position.
id: Ini akan memperbesar dan menuju pusat peta dimana Anda memasukkan koordinat lintang dan bujurnya. Sekarang Anda dapat memposisikan citra ke tempat yang Anda ketahui sebagai posisi yang tepat.

source: If, on the other hand, the area has already been extensively mapped, then hopefully the previous mappers have drawn objects in their correct locations. In this case, you can align the imagery to the OSM map, but beware! Other mappers may not be aware of imagery offset, and they may have made mistakes when they mapped.
id: Jika pada salah satu kasus, area tersebut sudah dipetakan dan semoga pengguna sebelumnya telah menggambar dengan tepat. Pada kasus ini, Anda dapat menggeser citra satelit ke tempat yang sesuai dengan data OSM, tetapi harap diingat! Pengguna OSM lain mungkin tidak menyadari pergeseran citra satelit dan mereka mungkin telah membuat kesalahan ketika mereka memetakannya.

source: 3.1. The imagery offset database
id: 3.1 Database pergeseran citra satelit

source: Now you know how to watch out for and correct imagery offset, but there is one major problem with this approach that we have overlooked thus far. If every OSM user adjusts the imagery differently, everybody will be mapping with slightly different backgrounds.
id: Sekarang Anda mengetahui bagaimana cara untuk melihat dan memperbaiki citra satelit, tetapi disini ada sedikit masalah dengan pendekatan yang telah kita tahu sampai saat ini. Jika setiap pengguna OSM mengatur citra satelit berbeda, setiap orang akan memetakan dengan background yang berbeda.

source: Imagine that you are mapping a small town, and you realise that Bing imagery is offset by 15 metres to the north. So you adjust the imagery and then use it to map the whole town accurately. But then somebody else wants to add something to the map, so they download the data and load Bing imagery, but they don’t know about the imagery offset you discovered! They will think that something is wrong and all of the objects in town are misplaced by 15 metres, and they will start to move them, which is not correct! This can be disastrous for the town’s map data.
id: Bayangkan jika Anda memetakan kota kecil dan Anda menyadari bahwa terjadi pergeseran satelit 15 meter ke Utara. Anda tentunya akan memperbaiki dan memetakan kota tersebut dengan akurat. Tetapi ketika seseorang ingin memetakan sesuatu dan mereka download data OSM dan memunculkan citra satelit Bing, dan mereka tidak mengetahui pergeseran citra satelit yang Anda ketahui! Mereka akan mengira bahwa terjadi hal yang aneh dan semua objek bergeser 15 meter ke utara dan akhirnya mereka akan memulai memindahkan kembali, dimana yang hal demikian itu adalah salah! Ini akan merusak semua data yang ada.

source: For this reason it is important that all users are aware of imagery offset, and should always check for it before mapping an area. To help with this problem, some smart people created a plugin that allows users to save offset information in a database and share it with others. Let’s see how this works:
id: Untuk masalah ini, sangat penting agar semua pengguna sadar akan pergeseran citra satelit dan selalu memeriksa terkait hal itu sebelum memetakan area. Untuk membantu mengatasi masalah ini, beberapa orang telah membuat plugin yang membantu pengguna untuk menyimpan informasi pergeseran satelit di database dan menyimpannya dengan yang lain. Mari lihat bagaimana kerjanya:

source: Open the :guilabel:`Preferences` menu in JOSM, and click on the :guilabel:`Plugins` tab.
id: Buka :guilabel:`Preferences` menu di JOSM, dan klik pada :guilabel:`Plugins`

source: Find the plugin named *imagery_offset_db* and check the box next to it.
id: Cari plugin bernama *imagery_offset_db* dan centang kotak disamping plugin tersebut.

source: Click :guilabel:`OK`. You will need to restart JOSM to finish the plugin installation.
id: Klik :guilabel:`OK`. Anda harus merestart JOSM agar bisa menggunakan plugin ini.

source: In the same way that you are able to save offsets as bookmarks, this plugin allows you to save offsets to a central database, and to access the offsets that other users have created. Hence, if one mapper creates an imagery offset in an area, other users can use the exact same offset to map with.
id: Sama seperti Anda menyimpan bookmark pergeseran citra satelit Anda, plugin ini memperbolehkan Anda untuk menyimpan pergeseran citra satelit di database pusat dan mengakses nilai pergeseran citra satelit yang telah dibuat oleh pengguna lain. Jadi, jika terdapat pengguna yang menyimpan nilai pergeseran di suatu area, pengguna lain juga bisa menggunakannya.

source: When using aerial imagery layers, you should ALWAYS check for existing offsets, and when you create your own offset, you should ALWAYS save it to this database.
id: Ketika Anda menggunakan citra satelit, Anda HARUS SELALU mengecek offset yang ada, dan ketika Anda sudah membuat nilai pergeseran citra satelit, Anda HARUS SELALU menyimpannya di database yang ada.
