Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/old-training/beginner/osm/108-getting-osm-data.po
Languages: id

source: Module 8: Getting OSM Data
id: Bab 8: Memperoleh Data *OSM*

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Download OpenStreetMap data from the `Geofabrik website <http://download.geofabrik.de/openstreetmap/>`_
id: Mendownload data OpenStreetMap dari `Situs Geofabrik <http://download.geofabrik.de/openstreetmap/>`_

source: Download customised OpenStreetMap data using HOT Exports
id: Mendownload data OpenStreetMap menggunakan HOT Exports

source: Now that we have learned how to contribute data to the OpenStreetMap database, let's see how we can access data for download in different formats. You may want to download OSM data as a backup or for use in Geographic Information System software such as |QGIS|.
id: Saat ini kita telah belajar bagaimana menambahkan data ke database OpenStreetMap, mari kita lihat bagaimana kita dapat mengakses data untuk mendownload dalam format yang berbeda. Anda mungkin ingin mendownload data OSM sebagai cadangan atau digunakan dalam software Sistem Informasi Geografi seperti |QGIS|.

source: 1. Getting OSM data on Geofabrik website
id: 1. Memperoleh data OSM melalui situs Geofabrik

source: The easiest way to get OSM data is to download a pre-processed data extract from one of the various websites which offers up-to-date downloads. In this section we will see how to download data from Geofabrik, a company which offers free OSM downloads at the link below:
id: Cara termudah untuk memperoleh data OSM adalah untuk mendownload ekstrak data sebelum diproses dari salah satu berbagai situs yang menawarkan download terbaru. Pada bagian ini kita akan melihat bagaimana untuk mendownload data dari Geofabrik, sebuah perusahaan yang menawarkan download OSM secara gratis pada link di bawah ini:

source: The data is divided into several regions. To access the data for Indonesia, click on the :guilabel:`Asia` region in the table.
id: Data dibagi ke dalam beberapa wilayah. Untuk mengakses data di Indonesia, klik pada bagian :guilabel:`Asia` dalam tabel wilayah.

source: Then click on :guilabel:`Indonesia`.
id: Kemudian klik pada :guilabel:`Indonesia`.

source: To obtain the Indonesian data in shapefile (.shp) format, click on :guilabel:`indonesia-latest.shp.zip` and the file will be downloaded. Several file formats are available - shapefiles are a popular GIS format which contain several different files with point, line and polygon data.
id: Untuk mendapatkan data Indonesia dalam format shapefile (.shp), klik pada :guilabel:`indonesia-latest.shp.zip` dan file akan terdownload. Beberapa format file yang tersedia - shapefile adalah format umum dalam SIG yang berisi beberapa file yang berbeda terdiri dari titik, garis, dan data poligon.

source: The website indicates the most recent time that the data was updated. Note that the server usually updates the data once every 24 hours, so if you have just made changes to OSM, don't expect them to appear in this data immediately.
id: Situs menunjukkan waktu terbaru bahwa data telah diperbaharui. Perlu diperhatikan, server biasanya memperbaharui data setiap 24 jam sekali, jadi jika Anda baru saja mengupload data ke OSM, jangan mengharapkan data akan langsung terihat.

source: 2. Getting OSM data from HOT Exports
id: 2. Memperoleh data OSM dari HOT Exports

source: To download a specific area with a specific data attributes that you define, HOT Exports is a more convenient tool for downloading data.
id: Untuk mendownload area dengan atribut data yang spesifik yang Anda tetapkan, Hot Exports adalah *tool* yang lebih sesuai untuk mendownload data.

source: In your web browser, go to http://export.hotosm.org
id: Pada browser internet, pergi ke http://export.hotosm.org

source: To create a data processing job you must have an account. Click :guilabel:`Create Account` in the bottom left corner and enter your email address, a new password and password confirmation. Complete the registration by clicking :guilabel:`Create Account`. Open your email and click on the link that has been sent in order to activate your account.
id: Untuk membuat pekerjaan dalam proses data, Anda harus memiliki akun. Klik :guilabel:`Create Account` pada tombol di sudut kiri bawah dan masukkan alamat email Anda, kata sandi baru dan konfirmasi kata sandi. Registrasi telah lengkap klik :guilabel:`Create Account`. Buka email Anda dan klik pada link yang telah dikirim untuk mengaktifkan akun Anda.

source: Log in using the account that you have created.
id: Masuk dengan menggunakan akun yang telah dibuat.

source: When you are successfully logged in, click :guilabel:`New Job` in the upper right corner.
id: Ketika Anda berhasil masuk, klik :guilabel:`New Job` di sudut kanan atas,

source: Enter a name for the job (such as the name of the area you are downloading). Enter a description as well.
id: Masukkan nama untuk pekerjaan (seperti nama dari area yang Anda download). Masukkan deskripsi akan lebih baik.

source: Zoom in on the map to the area that you want to download. Click :guilabel:`Select Area` and draw a box around the area that you want. The box can be manipulated by dragging its corners and centre. When you finish, click :guilabel:`Create Job`.
id: Perbesar peta untuk area yang ingin Anda *download*. Klik :guilabel:`Select Area` dan gambar sebuah kotak disekitar area yang Anda inginkan. Kotak dapat dimodifikasi dengan menggeser sudut kotak dan bagian tengah. Ketika Anda selesai, klik :guilabel:`Create Job`.

source: Next, you may optionally select a presets file to include in your data extract. Presets files are the same as those used in JOSM, and instruct HOT Exports to extract specific data attributes in your custom download. This is useful if the data you are accessing contains non-standard tags that are not typically included in data extracts.
id: Selanjutnya, Anda dapat memilih file presets yang termasuk dalam data ekstrak Anda. File Presets sama dengan yang digunakan didalam JOSM, dan HOT Export memerintahkan untuk ekstrak data atribut yang spesifik dengan *download* sesuai keinginan sendiri. Ini berguna jika data yang Anda akses berisi tag yang tidak standart yang tidak biasa termasuk dalam data ekstrak.

source: To add a presets file, click the drop-down menu next to :guilabel:`Select Preset File` and choose one of the available options. Check the box next to :guilabel:`Add Default Tags?` to include the default attributes in the data extract.
id: Untuk menambahkan file presets, klik menu daftar pilihan kemudian :guilabel:`Select Preset File` dan pilih satu dari pilihan yang tersedia. Berikan tanda centang pada kotak :guilabel:`Add Default Tags?` termasuk pengaturan bawaan atribut dalam ekstrak data.

source: Click :guilabel:`Save` and the server will begin to process your request. The length of the process depends on the area you choose and server capacity.
id: Klik :guilabel:`Save` dan server akan mulai memproses permintaan Anda. Panjang proses tergantung pada area yang Anda pilih dan kapasitas server.

source: When the process is complete, the data can be downloaded in a variety of formats, including shapefiles, KML and database formats.
id: Ketika proses selesai, data dapat didownload dalam berbagai format, termasuk shapefile, KML dan format database.

source: All jobs you create will appear in the list on the :guilabel:`Jobs` page. If any time you want to download the same area with up-to-date data, find the job on this page. Click :guilabel:`Start new run` to process the same extract again but with the most recent OSM data.
id: Semua pekerjaan yang Anda buat akan muncul dalam daftar dalam halaman :guilabel:`Jobs`. Jika suatu saat Anda ingin *download* area yang sama dengan data terbaru, temukan pekerjaan dalam halaman ini. Klik :guilabel:`Start new run` untuk memproses ekstrak yang sama lagi tapi dengan data OSM terbaru.
