Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/old-training/intermediate/osm/300-introduction.po
Languages: id

source: Introduction
id: Pengantar

source: Disclaimer
id: Ketentuan

source: This document is initial draft and still in reviewing phase by these parties:
id: Dokumen ini merupakan rancangan awal dan masih dalam tahap peninjauan oleh pihak-pihak sebagai berikut:

source: All contents and materials on this document may be changed without public notice.
id: Seluruh isi dan materi dalam dokumen ini kemungkinan masih dapat mengalami perubahan tanpa pemberitahuan publik.

source: Licence
id: Lisensi

source: All contents and materials in this document are licensed as Creative Commons Attribution Australia (CCbyA).
id: Seluruh isi dan materi pada dokumen ini berlisensikan Creative Commons Attribution Australia (CCbyA).

source: You are free:
id: Anda dapat:

source: to copy, distribute, display, and perform the work
id: menyalin, mendistribusikan, menampilkan dan mengerjakan

source: to make derivative works
id: untuk membuat karya turunan

source: to make commercial use of the work
id: untuk membuat penggunaan yang komersial

source: You must give the original author credit.
id: Anda harus memberikan kredit penulis asli.

source: More information about CCbyA License: http://creativecommons.org/licenses/by/3.0/au/deed.en_GB
id: Keterangan lebih lanjut mengenai Lisensi CCbyA: http://creativecommons.org/licenses/by/3.0/au/deed.en_GB

source: About Us
id: Tentang Kami

source: BNPB is Indonesiaâ€™s National Disaster Management Agency. |BNPB| is a non-departmental ministerial-level government agency, tasked with providing guidance and direction to the efforts of disaster management that includes disaster prevention, emergency response, rehabilitation and reconstruction in a fair and equal way. |BNPB| functions as a policy maker regarding refugee/IDP management for effective and efficient response. It coordinates the implementation of disaster management activities in a planned, integrated and comprehensive way.
id: BNPB adalah Badan Nasional Penanggulangan Bencana Indonesia. |BNPB| merupakan lembaga pemerintah non-departemen di tingkat kementrian yang bertugas untuk menyediakan panduan dan pengarahan di bidang manajemen bencana, termasuk pencegahan bencana, respon keadaan darurat, rehabilitasi, dan rekonstruksi secara adil dan merata. BNPB memiliki fungsi sebagai pembuat kebijakan, melakukan formulasi dan manajemen pengungsi (IDP) untuk bertindak secara cepat, tepat, efektif dan efisien; dan mengkoordinasikan implementasi dari aktifitas manajemen bencana secara terencana, terintegrasi, dan komprehensif.

source: The Australia-Indonesia Facility for Disaster Reduction (|AIFDR|) is a joint initiative between the governments of Australia and Indonesia. They work to strengthen Indonesia's ability to reduce the impact of disasters. The Australian and Indonesian governments at a special ceremony on 15 July 2010 launched the Australia-Indonesia facility. The launch marks an important event in the strong relationship now shared by both countries and their united commitment to better prepare for and respond to natural disasters in Indonesia.
id: Australia-Indonesia Facility for Disaster Reduction (AIFDR, Fasilitas Australia-Indonesia untuk pengurangan bencana) merupakan inisiatif gabungan antara pemerintah Australia dengan pemerintahIndonesia. AIFDR bekerja untuk memperkuat kemampuan Indonesia untuk mengurangi dampak bencana. AIFDR diluncurkan oleh pemerintah Australia dan pemerintah Indonesia dalam sebuah seremoni khusus pada tanggal 15 Juli 2010. Peluncuran ini menandakan sebuah kejadian penting dalam hubungan kuat yang saat ini terjalin antara kedua negara dan komitmen mereka untuk mempersiakan dan merespon bencana alam di Indonesia lebih baik.

source: Free, collaborative maps are uniquely valuable to humanitarian work, especially in places where base map data is often scarce, out-of-date, or rapidly changing. OpenStreetMap is a web project to create a free and open map of the entire world, built entirely by volunteers surveying with GPS, digitising aerial imagery, and collecting and liberating existing public sources of geographic data. The Humanitarian OpenStreetMap Team (|HOT|) is an initiative to apply the principles and activities of open source and open data sharing towards humanitarian response and economic development.
id: Peta gratis dan kolaboratif mempunyai keunikan yang berharga untuk pekerjaan kemanusiaan, terutama di tempat-tempat dimana peta dasar sangat jarang ditemukan, datanya sudah lama, atau seringkali berubah. OpenStreetMap merupakan proyek berbasis website untuk membuat peta dunia yang gratis dan terbuka, dibangun oleh volunteer yang melakukan survei dengan GPS, mendigitasi citra satelit, dan mengumpulkan juga membebaskan sumber data geografis publik yang sudah ada . Tim Kemanusiaan OpenStreetMap (HOT) merupakan sebuah inisiatif yang baru untuk mengaplikasikan prinsip dan aktifitas dari sumber terbuka dan berbagi data terbuka untuk menuju respon kemanusiaan dan pembangunan ekonomi.

source: Universitas Gadjah Mada (internationally known as Gadjah Mada University, or UGM) is a top research university located in Yogyakarta, Indonesia. The Department of Geodetic Engineering and Faculty of Engineering focuses on education, research, and commmunity services related to geodesy and geomatics engineering, including acquisition, analysis, and uses of detailed and accurate geospatial data and large-scale maps using open source geospatial software for disaster management.
id: Universitas Gadjah Mada (secara internasional dikenal sebagai Gadjah Mada University ; Disingkat : UGM) adalah salah satu pusat penelitian tingkat universitas yang bertempat di Yogyakarta, Indonesia. Departemen Teknik Geodesi, Fakultas Teknik khususnya fokus dalam kegiatan pengajaran, penelitian, dan pengabdian kelompok yang berkaitan dengan geodesi dan teknik geomatik, termasuk akuisisi, analisis, dan penggunaan dari geospasial data yang detil dan akurat serta dengan peta berskala besar menggunakan software geospasial bersifat open source dalam manajemen bencana.

source: Preface
id: Pengantar

source: Every day thousands of people contribute to OSM, a project with the lofty goal of mapping the world. Most OSM software is free and open source, and the data is open for anyone to use. The idea is simple: if you make a map of your town and we make a map of ours, we can share those maps on a common platform. With enough people contributing, we can collect data throughout the world.
id: Setiap hari ribuan orang berkontribusi untuk OpenStreetMap, sebuah proyek dengan tujuan mulia yaitu memetakan seluruh dunia. Kebanyakan software OSM adalah gratis dan open source, dan datanya terbuka bagi siapapun yang menggunakannya. Idenya sangat sederhana: jika anda membuat sebuah peta untuk kota dimana anda tinggal dan saya membuat peta dimana saya tinggal, kita dapat berbagi peta tersebut pada sebuah platform yang sama. Dengan orang yang berkontribusi secukupnya, kita dapat membuat peta dan mengumpulkan data dari seluruh dunia.

source: Collecting Spatial Data using OSM Intermediate Level is a step-by-step course designed to help those who wish to carry on from the beginner tutorial and explore OSM in more detail. We recommend reviewing Collecting Spatial Data using OSM Beginner Level prior to this unit.
id: Panduan pengumpulan data spasial menggunakan OSM untuk Tingkat Menengah adalah panduan yang dirancang untuk membantu siapa pun yang ingin melanjutkan dari panduan dasar dan mengeksplorasi OSM lebih lanjut. Kami menyarankan untuk membaca panduan pengumpulan data spasial menggunakan OSM tingkat dasar terlebih dahulu.

source: :ref:`Go to first module --> <advanced-editing>`
id: :ref:`Pergi ke modul pertama --> <advanced-editing>`
