Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/old-training/intermediate/osm/301-advanced-editing.po
Languages: id

source: Select all of the highways or ways that are part of the bus route. If you would only like to select certain parts of a way, then you must divide the way into sections. This creates more work, but you can easily do it with the :guilabel:`Split Way` tool.
id: Pilih seluruh jalan atau garis yang merupakan rute dari sebuah bus. Jika anda hanya ingin memilih bagian dari suatu garis tertentu, kemudian, sayangnya anda harus membagi garis-garis tersebut menjadi beberapa bagian. Ini akan menambah pekerjaan anda, tetapi anda dapat melakukannya dengan mudah yaitu memanfaatkan tool :guilabel:`Bagi Jalur`.

source: Go to :menuselection:`Presets ‣ Transport Public Transport ‣ Route master`.
id: Pilih :menuselection:`Presets ‣ Transport Public Transport ‣ Route master`.

source: Fill in the information about the bus route and click :guilabel:`New relation`.
id: Isilah informasi yang ada tentang rute bus tersebut dan klik :guilabel:`Relasi baru`.

source: Relations are difficult to understand and do not have to be used often, but they are necessary to know about. As you get more developed with your OSM skills and want to create more complex buildings, rivers and routes, relations will be useful.
id: Relasi sangat sukar untuk dipahami dan tidak harus digunakan secara rutin, tetapi mereka penting untuk diketahui. Jika anda ingin lebih mengembangkan kemampuan OSM anda, anda mungkin ingin membuat bangunan yang lebih kompleks, sungai atau rute, maka relasi akan sangat berguna.

source: :ref:`Go to next module --> <quality-assurance>`
id: :ref:`Modul selanjutnya --> <quality-assurance>`
