Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/old-training/intermediate/osm/302-quality-assurance.po
Languages: id

source: A common error is to have overlapping polygons when the objects they represent do not overlap in real life. A building cannot overlap another building. This mistake is commonly made with buildings and landuse polygons. For example, a polygon drawn to represent a park outside a building should not overlap with the building. Instead it should be drawn next to the building. There are some exceptions to this rule, such as schools. Within a school yard you might identify individual buildings using polygons, yet you also might want to create a polygon around the entire school yard. In this case it is fine for the polygons to overlap, but the rule to follow here is to make sure that the buildings are completely inside the landuse polygon.
id: Salah satu kesalahan umum adalah poligon yang saling overlay ketika objek yang digambarkan tidak bertumpukan di keadaan sebenarnya. Sebuah bangunan tidak dapat bertumpukan bangunan lainnya. Kesalahan ini umumnya terjadi dengan poligon bangunan dan poligon penggunaan tanah. Sebagai contoh, sebuah poligon yang dibangun untuk menggambarkan taman diluar bangunan sebaaiknya tidak saling bertumpukan dengan bangunannya. Seharusnya digambar di sebelah bangunannya. Terdapat beberapa pengecualian pada aturan ini, misalnya sekolah. Di dalam halaman sekolah mungkin Anda ingin mengidentifikasi setiap bangunan menggunakan poligon, tetapi mungkin Anda juga ingin membuat sebuah poligon yang meliputi seluruh halaman sekolah. Dalam kasus seperti ini, poligon diperbolehkan untuk saling overlap, tetapi aturannya adalah pastikan bahwa bangunan-bangunan secara menyeluruh berada dalam poligon penggunaan lahan.

source: We all make mistakes, and as you map more you will make less mistakes! Just remember that even if you upload data that contains mistakes, it is simple to fix your mistakes and upload the change again. This is what is great about OSM, you can always make it better!
id: Kita semua membuat kesalahan, dan jika Anda memetakan lebih banyak maka kesalahan akan semakin berkurang! Hanya ingat, jika Anda mengupload data yang memiliki kesalahan, cara mudahnya adalah Anda hanya memperbaiki kesalahan tersebut dan mengupload kembali perubahannya. Di sinilah hebatnya OSM, Anda dapat selalu membuatnya lebih baik!

source: 6. Presets standardisation
id: 6. Standardisasi Preset

source: OSM is used around the world by speakers of many different languages. Any feature in OSM can have whatever tags users choose. While this provides a lot of flexibility, it is important that users worldwide agree on the same tags to identify the same objects no matter what country they are located in.
id: OSM digunakan diseluruh dunia oleh berbagai macam orang dengan bahasa yang berbeda-beda. Semua objek di OSM bisa mempunyai informasi *tag* yang beraneka ragam sesuai dengan kebutuhan pengguna. Meskipun memberikan banyak sekali fleksibilitas, penting bagi pengguna diseluruh dunia menyetujui *tag* yang sama untuk mengidentifikasi objek tidak peduli dinegara mana mereka berada.

source: For such purposes of standardisation, most tags in OSM are in British English. An extensive list of standardised OSM tags is available on the OSM Wiki `Map Features page <http://wiki.openstreetmap.org/wiki/Map_Features>`_.
id: Untuk tujuan standardisasi, beberapa tag di OSM menggunakan Bahasa Inggris. Beberapa daftar *tag* OSM yang sudah distandardisasikan tersedia di halaman Wiki OSM `Map Features <http://wiki.openstreetmap.org/wiki/Map_Features>`_.

source: When users enter tags manually in JOSM or another editor, it is common to make spelling or other mistakes, particularly for beginners. For this reason, it is a good idea to use the presets menu, which uses forms that prevent incorrect tags from being entered.
id: Ketika pengguna memasukkan *tag* manual di JOSM atau editor lain, sangatlah umum untuk terjadi kesalahan dalam penulisan *tag* atau kesalahan lain, khususnya untuk pemula. Untuk alasan ini, adalah ide yang bagus untuk menggunakan menu preset, yang menggunakan format formulir untuk mencegah ketidaksengajaan pemberian *tag* yang salah.

source: Using standardised tags aids in:
id: Menggunakan *tag* yang sudah distandardisasi membantu untuk:

source: Assuring data consistency and stability
id: Menjamin stabilitas konsistensi data

source: Easier data search and analysis
id: Memudahkan pencarian dan pengolahan data

source: Setting benchmarks for improvement
id: Mengatur tolak ukur untuk peningkatan

source: Data validation
id: Validasi data

source: Map rendering on OSM website
id: Penggambaran peta di situs OSM

source: The KeepRight website is another useful validation tool for OSM. Open your web browser and head to http://keepright.at.
id: Situs KeepRight merupakan salah satu *tool* validasi yang berguna untuk OSM. Buka *browser* anda dan pergi ke http://keepright.at.

source: If needed, switch the site into Indonesian by choosing :guilabel:`id` from the drop-down box in the in the upper right.
id: Jika menginginkan, ganti bahasa situs kedalam Bahasa Indonesia dengan memilih :guilabel:`id` dari daftar pilihan di sebelah kanan atas.

source: Click :guilabel:`Data Checks for Asia` to check OSM data in Asia. This will open up a slippy map with errors displayed on it.
id: Klik :guilabel:`Pengecekan data untuk Asia` untuk mengecek data OSM di Asia. Ini akan membuka peta dengan kesalahan yang ditampilkan pada peta.

source: Navigate to your area of interest by using the zoom and pan functions.
id: Arahkan ke area yang diinginkan dengan menggunakan fungsi perbesar dan geser.

source: The types of errors are listed to the left of the map. Get more details about each error by clicking on the icons which hover above the map.
id: Tipe-tipe dari kesalahan yang ada terdapat pada bagian kiri dari peta. Untuk melihat lebih detail mengenai deskripsi dari kesalahan yang ada, bisa dengan mengklik ikon yang ada di peta.

source: When you see an error in your area of interest, the next step is to fix it. Click on the links to one of the editors (JOSM, Potlatch, or iD) to open this data in the editor. Note that to edit in JOSM you must have the JOSM Remote Control Enabled (as described in the :ref:`Tasking Manager section <quality-assurance-step-14>` above).
id: Ketika Anda melihat kesalahan di peta, tahapan berikutnya adalah memperbaikinya. Klik pada link salah satu editor (JOSM, Potlatch, atau iD) untuk membuka data ini di editor. Harap perhatikan bahwa untuk mengedit di JOSM anda harus mengaktifkan Remote Control di JOSM (seperti yang dijelaskan dibagian :ref:`Tasking Manager <quality-assurance-step-14>` diatas).

source: We recommend that the editing is done in JOSM, because its editing features are more complete. Note that JOSM must be open (with remote control enabled) in order to connect with the KeepRight website.
id: Kami untuk melakukan editing di JOSM, karena fitur editing yang ada lebih lengkap. Harap diperhatikan bahwa JOSM harus sudah dibuka terlebih dahulu (dengan remote control yang sudah diaktifkan) agar bisa terkoneksi dengan situs KeepRight.

source: Use JOSM (or another editor) to fix the errors that you find on the KeepRight website. After fixing them, return to the site and select :guilabel:`ignore temporarily`. Add a comment and click :guilabel:`save`.
id: Gunakan JOSM (atau editor lain) untuk memperbaiki kesalahan yang Anda temukan di situs KeepRight. Setelah memperbaiki, kembali ke situs dan pilih :guilabel:`abaikan sementara`. Tambahkan komentar dan klik :guilabel:`simpan`.

source: :ref:`Go to next module --> <dealing-with-conflicts>`
id: :ref:`Lanjut ke modul berikutnya --> <dealing-with-conflicts>`
