Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/old-training/intermediate/osm/302-quality-assurance.po
Languages: id

source: Module 2: Quality Assurance
id: Modul 2: Penjaminan Kualitas

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Use validation tools in JOSM
id: Menggunakan tool validasi pada JOSM

source: Use online validation tools
id: Menggunakan tool validasi secara online

source: Contributing to OpenStreetMap is easy to learn, but difficult to master. Everybody makes mistakes, but the system works because even when one person does something the “wrong” way, there are always other mappers ready to help and fix errors. As you map more and more it will continue to get easier, and you will learn the “proper” way to do things. In this module we will take a look at the JOSM validation tool, which is an automated tool to search for errors and warnings in your data. We will also take a look at one of the online validation tools, which can aid us further in identifying mistakes on OSM.
id: Berkontribusi di OpenStreetMap merupakan hal yang mudah untuk dipelajari, namun sulit untuk dikuasai. Setiap orang dapat melakukan kesalahan, akan tetapi sebuah sistem bekerja karena ketika seseorang melakukan sebuah kesalahan, akan selalu ada orang lain yang siap membantu untuk menyelesaikan kesalahan tersebut. Seiring Anda melakukan pemetaan secara terus menerus, hal tersebut akan menjadi lebih mudah dan Anda akan mengerti cara yang tepat untuk melakukan pemetaan. Modul ini ditujukan untuk membantu Anda memberikan kontribusi yang lebih baik. Kita akan memulai dari mendiskusikan berbagai macam teknik mengedit di JOSM yang akan membuat Anda bekerja lebih baik dan mengerti kesalahan umum yang sering dibuat pada awal pemetaan. Kita akan mendiskusikan tool validasi JOSM dimana merupakan cara otomatis untuk mengecek kesalahan pada data OpenStreetMap.

source: 1. Errors and warnings
id: 1. Kesalahan dan Peringatan

source: Sometimes when you go to upload your edits in JOSM you get a pop-up window like this:
id: Ada kalanya ketika Anda ingin meng-*upload* data OpenStreetMap yang sudah dimodifikasi melalui JOSM Anda akan mendapatkan jendela seperti dibawah ini:

source: This is JOSM’s way of telling you that there is suspicious data and that you might want to review the errors and warnings before uploading to OSM.
id: Ini adalah cara JOSM memberitahu bahwa ada data yang salah dan harus diperbaiki atau ditinjau sebelum mengupload ke server OSM.

source: JOSM comes with a tool that does an automated analysis of possible mistakes. This is useful for finding errors that you may have overlooked. When you run the validation tool, it returns two lists of problems:
id: JOSM hadir dengan *tool* yang berfungsi untuk menganalisis secara otomatis kesalahan yang ada. Hal ini sangat membantu untuk menemukan kesalahan yang tidak terlihat oleh Anda. Ketika Anda menjalankan alat validasi ini, alat ini akan menghasilkan 2 jenis masalah:

source: **Errors:** These are important to fix, and therefore usually you should not ignore these. Examples of errors include duplicated objects or overlapping lines and polygons.
id: **Kesalahan:** Kesalahan penting untuk diperbaiki dan oleh karena itu Anda seharusnya tidak mengabaikan. Salah satu contoh dari error ini adalah objek yang terduplikasi atau garis dan poligon yang saling overlay.

source: **Warnings:** These are problems that are important to fix, but in some cases, they are tolerable.
id: **Peringatan:** Kesalahan jenis ini merupakan kesalahan yang penting untuk diperbaiki namun pada beberapa kasus hal tersebut bisa ditoleransi.

source: One thing to note is that if you download a large area of the map and run the validation tool, you may get a very long list of errors and warnings. This is because the validation tool works on the whole map, not only the changes that you have made. You may see mistakes that other mappers have made, and you can fix them, or ignore them. The validation tool gives you the opportunity to look at the mistakes one by one.
id: Satu hal yang perlu diperhatikan jika Anda mendownload area yang besar dan menjalankan *tool* validasi, Anda mungkin akan mendapatkan daftar kesalahan dan peringatan yang sangat panjang. Hal ini dikarenakan *tool* validasi ini bekerja pada seluruh peta, tidak hanya perubahan yang telah Anda buat. Sehingga Anda mungkin akan melihat kesalahan yang dibuat oleh orang lain dan Anda bisa memperbaikinya atau menghiraukannya. Akan tetapi alat validasi memberikan Anda kesempatan untuk melihat kesalahan satu persatu.

source: 2. Using the validation tool
id: 2. Menggunakan *Tool* Validasi

source: Let’s see how to use the validation tool:
id: Mari kita lihat bagaimana cara menggunakan tool validasi:

source: In JOSM, download a section of the map. If you don’t see the :guilabel:`Validation Results` window in the right panel, click on the blue checkmark on the left to show it.
id: Pada JOSM, download satu daerah pada peta. Jika Anda tidak melihat :guilabel:`Validation Results` pada jendela di panel bagian kanan, klik pada tanda centang berwarna biru pada bagian kiri untuk memunculkannya.

source: Ensure that nothing on the map is selected. If you run the validation tool with anything selected, it will only validate what you have selected, and not the whole map. Hover your mouse in the validation window and click :guilabel:`Validation`.
id: Pastikan bahwa tidak ada bagian pada peta yang dipilih. Jika Anda menjalankan tool validasi dengan sesuatu yang dipilih, hal tersebut hanya akan memvalidasi daerah yang Anda pilih, dan tidak seluruh peta. Arahkan mouse anda pada jendela validasi dan klik :guilabel:`Validasi`.

source: The map will change and any warnings will be circled in yellow, errors in red. In the :guilabel:`Validation Results` window you will see a list of warnings and errors, if there are any.
id: Peta tersebut akan berubah dan segala macam peringatan akan terlihat berwarna kuning dan untuk kesalahan berwarna merah. Pada jendela :guilabel:`Hasil Validasi` Anda akan melihat daftar peringatan dan kesalahan, jika ada.

source: Errors should almost always be fixed. Zoom to an error by right-clicking on it in the window and selecting :guilabel:`Zoom to Problem`. Then fix the mistake manually.
id: Kesalahan harus seluruhnya diperbaiki. Anda dapat memperbesar di daerah yang terdapat kesalahan dengan cara klik kanan pada kesalahan pada jendela tersebut dan kemudian pilih :guilabel:`Perbesar ke Masalah`. Setelah itu Anda bisa memperbaiki kesalahan tersebut secara manual.

source: Some errors can be automatically fixed, such as "Duplicated nodes” errors. Click on the folder for these types of errors and click the :guilabel:`Fix` button in the window. Many errors, however, need to be corrected manually.
id: Beberapa kesalahan dapat diperbaiki secara otomatis, seperti “Titik yang terduplikasi”. Anda dapat melihat pada folder untuk beberapa tipe kesalahan dan memilih tombol :guilabel:`Perbaiki` pada jendela tersebut. Beberapa kesalahan membutuhkan untuk diperiksa secara manual.

source: Usually there are many more warnings than errors. By giving you a warning, JOSM is telling you that it is probably a mistake, but not always. Use your judgement to see if it is an important error or not.
id: Biasanya terdapat lebih banyak peringatan daripada kesalahan. Dengan memberikan peringatan, JOSM memberitahukan Anda bahwa hal tersebut kemungkinan adalah sebuah kesalahan, tetapi tidak selalu. Sehingga Anda akan menggunakan keputusan Anda untuk melihat apakah hal tersebut merupakan sebuah kesalahan atau tidak.

source: If you select a warning from the list and decide that it is not a problem, click :guilabel:`Ignore` and it will be removed from the list.
id: Jika Anda memilih salah satu warning dari daftar dan memutuskan bahwa hal tersebut bukanlah masalah, klik :guilabel:`abaikan` dan warning tersebut akan di hapus dari daftar.

source: Re-run the validation tool at any time by clicking the :guilabel:`Validation` button.
id: Anda dapat menjalankan ulang *tool* validasi sewaktu-waktu dengan mengklik tombol :guilabel:`Validasi`

source: 3. Common validation warnings
id: 3. Peringatan Umum

source: Ways that are not closed
id: Garis yang tidak tertutup

source: This is usually a line that does not form a polygon. Common examples are buildings where the first node does not meet the last node.
id: Biasanya merupakan garis yang tidak membentuk sebuah poligon. Contoh umumnya adalah gedung dimana titik pertama tidak bertemu dengan titik akhir.

source: To fix this, select both nodes and go to :menuselection:`Tools ‣ Merge Nodes` to connect them.
id: Untuk menyelesaikan masalah ini, pilih kedua titik dan pilih :menuselection:`Alat ‣ Gabungkan Node` untuk menyambung kedua titik tersebut.

source: Crossing buildings (overlapping buildings)
id: Bangunan yang bertampalan

source: This means that buildings are overlapping each other.
id: Biasanya merupakan bangunan yang saling bertumpang tindih satu sama lain.

source: To fix this, move the nodes of one of the buildings outside of the other building. It is possible for two buildings to share nodes, if the buildings share a common wall. But two buildings cannot overlap with one another.
id: Untuk menyelesaikan masalah ini, geser titik dari salah satu gedung ke arah luar dari gedung lain. Alternatif lain adalah kedua bangunan tersebut saling berbagi titik, jika bangunan tersebut saling berbagi dinding. Tetapi kedua bangunan tidak boleh saling bertampalan satu sama lain.

source: Untagged nodes or ways
id: Node atau garis yang belum memiliki tag

source: If someone draws a point or a line but forgets to give it any tags, then it is useless, because it does not mean anything.
id: Jika seseorang menggambar titik atau garis tetapi lupa untuk memberikan beberapa *tag*, kemudian titik atau garis yang digambar menjadi tidak berguna, karena bila objek yang digambar namun tidak memiliki *tag* maka objek tersebut tidak bisa ditampilkan karena tidak memiliki identitas.

source: To fix this, apply tags to the object to identify it, or delete it if it is a mistake.
id: Untuk menyelesaikan ini, pilih objek yang tidak mempunyai tag dan masukkan presets yang sesuai, atau hapus itu jika merupakan kesalahan.

source: End node near another way
id: Titik garis akhir berdekatan dengan garis lain

source: If a line ends very close to another line but does not connect, this raises a warning.
id: Jika sebuah garis terletak sangat dekat dengan garis lain namun tidak terhubung, akan menimbulkan peringatan.

source: Many times this warning is not important, but it helps to find road intersections that are supposed to connect but do not.
id: Seringkali peringatan ini tidak terlalu penting, namun cukup membantu bila kita ingin mencari persimpangan jalan yang seharusnya terhubung namun tidak terhubung.

source: Crossing ways
id: Garis yang saling berpotongan

source: Lines that cross other lines without being connected will raise warnings. Many times this is not a problem, because the crossing ways are intentional - such as in the case of bridges, or streets and rivers that cross landuse polygons. However, it is sometimes helpful to find errors.
id: Merupakan peringatan yang muncul akibat jalur berpotongan. Sebuah garis yang berpotongan dengan garis lain tanpa tersambung dapat memunculkan peringatan. Hal ini juga bisa saja tidak menjadi masalah, karena jalur yang berpotongan bisa saja disengaja, seperti pada kasus jembatan, atau jalan dan sungai yang berpotongan dengan poligon *landuse*. Akan tetapi, hal ini terkadang membantu, untuk menemukan kesalahan.

source: OSM depends on people correcting and editing mistakes. Editing and validating data is important for improving maps. If you do not have time to get in the field with a GPS or trace imagery, validating objects and attribute data is a good way to contribute.
id: OpenStreetMap bergantung pada orang yang memperbaiki dan mengedit kesalahan. Editing dan validasi data penting untuk meningkatkan peta. Jika Anda tidak mendapatkan cukup waktu untuk survei ke lapangan dengan GPS atau mendigitasi citra, validasi objek dan atribut data merupakan cara terbaik untuk berkontribusi.

source: 4. Using the tasking manager
id: 4. Tasking Manager

source: The OSM Tasking Manager is a tool that mappers can use to sort an area into a grid, and work together to map in an organised way. Apart from being more organised, the tasking manager is also one way to avoid editing conflicts, because it helps prevent more than one person from editing the same area at the same time.
id: HOT Tasking Manager merupakan sebuah *tool* atau media dimana pembuat peta dapat membagi sebuah daerah menjadi beberapa grid, lalu dapat bekerja bersama pembuat peta lainnya untuk memetakan daerah tersebut dengan cara yang lebih terorganisir. Selain lebih terorganisir, tasking manager juga merupakan salah satu cara untuk menghindari konflik, karena tidak memungkinkan lebih dari satu orang memetakan satu area yang sama.

source: One consistent challenge is coordinating field and/or remote workers to map an area together. To help address this, HOT has developed the Tasking Manager to make it easier for administrators to define the areas of mapping interest and to delegate workers. The idea behind this tool is that if there is an area, let’s say a city, that we want to map, we can coordinate between people mapping on the ground and others mapping remotely with satellite imagery, This tool allows us to create a grid of the entire area. Collaborators select blocks in the grid that they plan to map, and when they finish, they mark the area as complete. In this way a team of many people can coordinate to map the entire grid.
id: Satu tantangan utama adalah ketika harus mengkoordinasikan para pembuat peta dari berbagai area untuk bekerja membuat peta bersama-sama untuk satu daerah. Untuk membantu memecahkan permasalahan ini, HOT telah mengembangkan sebuah *tool* Tasking Manager untuk mempermudah administrator untuk menentukan area yang perlu dipetakan dan untuk mendelegasikan pembuat peta. Ide dibalik perangkat ini adalah apabila ada suatu area, misalnya sebuah kota, yang ingin dipetakan, dan sudah ada beberapa orang yang melakukan pemetaan di lapangan, dan terdapat beberapa orang yang memetakannya dari jarak jauh menggunakan citra satelit. Perangkat ini dapat membuat sebuah grid untuk area tersebut. Para pelaku pemetaan di area tersebut dapat memilih sebuah kotak pada grid yang ingin dipetakan, dan ketika mereka selesai memetakannya, mereka dapat menandai kotak tersebut sebagai daerah yang sudah selesai dipetakan. Dengan cara ini, sebuah tim yang berisi banyak orang yang tersebar di berbagai daerah dapat berkoordinasi bersama untuk menyelesaikan pemetaan pada grid tersebut.

source: To see how the tasking manager works, let’s take a closer look.
id: Untuk melihat bagaimana tasking manager bekerja, marilah kita lihat lebih dekat.

source: Open your internet browser and go `here <http://tasks.hotosm.org>`_. You will see a page like this:
id: Bukalah browser internet Anda dan buka `situs <http://tasks.hotosm.org>`_. Anda akan melihat sebuah halaman seperti ini:

source: Click :guilabel:`login to OpenStreetMap`.
id: Klik :guilabel:masuk ke OpenStreetMap`.

source: Here you must agree to allow this application some access to your OSM account. To do so, click :guilabel:`Save Changes`.
id: Disini Anda harus menyetujui untuk memperbolehkan aplikasi ini mendapatkan akses kedalam akun OSM anda. Jika Anda setuju, klik :guilabel:`Simpan Perubahan`.

source: On the left is a list of current mapping tasks. These are different places in the world that people are coordinating to map.
id: Pada bagian kiri Anda akan melihat daftar proyek-proyek pemetaan yang ada saat ini. Pada daftar tersebut berisi proyek-proyek dari berbagai negara yang berbeda dimana mereka melakukan koordinasi untuk melakukan pemetaan.

source: Click on one of the projects to see more information about it.
id: Klik pada salah satu proyek untuk melihat informasi lebih lanjut.

source: This page shows you everything you need to know about the project. On the left side of the page is a description of the mapping project and how it is being organised. You can click on the different tabs to get more information. On the right side is a grid showing the area to be mapped. Red grid squares have been completed, green squares have been completed and checked by another person, and the remaining squares still need to be mapped or are being worked on.
id: Halaman ini menunjukkan semua hal yang Anda perlu ketahui mengenai proyek tersebut. Pada sebelah sisi kiri halaman adalah sebuah deskripsi dari proyek pemetaan tersebut dan bagaimana mengaturnya. Anda dapat klik pada beberapa tab yang ada untuk melihat informasi lebih lanjut. Pada sisi kanan terdapat sebuah grid yang menunjukkan area yang sedang dipetakan. Kotak grid yang berwarna merah memiliki arti bahwa daerah tersebut telah selesai dipetakan, kotak berwarna hijau telah selesai dipetakan dan telah dilakukan pengecekan oleh orang lain dan divalidasi datanya, kotak dengan pinggiran berwarna kuning berarti sedang ada orang lain yang mengerjakan peta pada area tersebut, sedangkan kotak kosong lainnya belum ada atau belum selesai dipetakan.

source: Click on the :guilabel:`Activity` tab to see activity for this task. The :guilabel:`Stats` tab shows various users and their contributions.
id: Klik pada tab :guilabel:`Aktifitas` untuk melihat aktifitas dari proyek tersebut. Tab :guilabel:`Status` memperlihatkan jumlah orang yang turut membantu dan juga kontribusi mereka.

source: To claim a grid square to work on yourself, click :guilabel:`Start contributing` on the :guilabel:`Instructions` tab, or simply click an unclaimed square on the map and then click :guilabel:`Start mapping`.
id: Untuk menetapkan grid yang ingin Anda kerjakan, klik :guilabel:`Mulai Berkontribusi` pada tab :guilabel:`Petunjuk`, atau klik area yang belum dikerjakan oleh orang lain dan kemudian klik :guilabel:`Mulai memetakan`.

source: Next you see a view of the square that you have chosen to map. Click the button on the left to open the area up for editing with JOSM, iD, Potlatch 2 or create a Field Paper.
id: Disini Anda dapat melihat sebuah kotak yang Anda inginkan untuk dipetakan. Klik tombol yang berada disebelah kiri untuk membuka area dan mengedit menggunakan JOSM, Potlatch 2, atau membuat Field Paper.

source: If you plan to edit with JOSM, you need to enable the JOSM remote control before you are able to launch the application from the Tasking Manager. To do this, open JOSM and go the :menuselection:`Preferences` menu. Click on the :guilabel:`Remote Settings` tab and check the box next to :guilabel:`Enable remote control`. Restart JOSM.
id: Jika Anda berencana untuk mengedit menggunakan JOSM, Anda harus mengaktifkan *remote control* di JOSM terlebih dahulu sebelum anda dapat menjalankan aplikasi dari Tasking Manager. Untuk melakukan hal ini, buka JOSM dan pergi ke menu :menuselection:`Preferensi`. Klik pada tab :guilabel:`Remote Kontrol` dan centang kotak disamping :guilabel:`Memperbolehkan remote kontrol digunakan`. Kemudian restart JOSM.

source: Return to the Tasking Manager and choose :guilabel:`Edit with JOSM`. If you have JOSM open and you correctly enabled the remote control, the grid area of the map you selected will automatically be loaded into JOSM.
id: Kembali ke Tasking Manager dan pilih :guilabel:`Edit dengan JOSM`. Jika Anda telah membuka JOSM dan Anda telah mengaktifkan remote control dengan benar, area pada grid yang Anda ingin edit akan muncul dengan otomatis pada JOSM.

source: Next you may edit the area using the instructions provided in the project information. Usually tasks will be to trace certain features using imagery, such as buildings and roads. Alternatively, tasks might be set to map in more detail on the ground.
id: Sekarang Anda dapat mengedit area tersebut menggunakan instruksi yang tersedia pada informasi proyek. Biasanya setiap proyek akan mendigitasi fitur tertentu menggunakan citra satelit, seperti bangunan dan jalan. Alternatif lain, sebuah proyek akan disediakan sebuah peta yang lebih jelas.

source: When you are finished you will upload your edits and then return to the Tasking Manager to add a comment about your work. If you finish the grid square, click :guilabel:`Mark task as done`.
id: Ketika Anda sudah selesai anda harus mengupload hasil digitasi anda dan kemudian kembali ke Tasking Manager untuk menambahkan komentar terkait dengan pekerjaan Anda. Jika sudah anda selesai mengerjakan sebuah kotak, klik :guilabel:`Tandai task sudah selesai`.

source: If you are unable to complete the task, click :guilabel:`Unlock` to make the task available again for other mappers.
id: Jika Anda tidak dapat menyelesaikan pekerjaan, klik :guilabel:`Buka kunci` untuk membuat pekerjaan yang telah Anda kerjakan dapat dikerjakan oleh orang lain.

source: When you finish an area, the grid square will turn yellow on the map to indicate that it is done. Someone else will then look at your work to make sure it is good, and if they agree that you’ve completed the square well, the grid square will turn green, meaning it is complete!
id: Ketika Anda selesai mengerjakan sebuah area, kotak akan berubah menjadi warna kuning untuk mengindikasikan bahwa daerah tersebut sudah selesai dikerjakan. Orang lain akan melihat dan memvalidasi pekerjaan Anda untuk memastikan bahwa apa yang Anda kerjakan sudah benar, dan ketika mereka setuju dengan apa yang Anda kerjakan, kotak akan berubah menjadi warna hijau, yang berarti telah benar-benar selesai!

source: 5. Editing tips
id: 5. Tips Editing

source: In this section we will go over some common mistakes in JOSM and provide some editing tips for making your maps great!
id: Pada bagian ini, kita akan menjelaskan beberapa kesalahan umum di JOSM dan menyediakan beberapa tips mengedit untuk membuat peta anda menjadi lebih baik!

source: Some objects should not connect
id: Beberapa objek sebaiknya tidak saling terhubung

source: When you are creating polygons and lines that are not supposed to be connected, make sure that they are not merged together by sharing a node. For example, highway nodes should not be snapped to buildings, because no one likes a road that leads directly into a wall! If you want to disentangle two or more obejcts that share the same node, select the node and press :kbd:`G`.
id: Ketika anda membuat poligon dan garis, mereka sebaiknya tidak saling terhubung, pastikan mereka tidak terhubung oleh satu titik. Sebagai contoh, titik jalan raya sebaiknya tidak menempel pada bangunan, karena tidak ada jalan yang menempel pada sebuah dinding! JIka Anda ingin memisahkan dua atau lebih objek yang saling berbagi node yang sama, pilih node dan klik :kbd:`G`.

source: But, some objects should connect
id: Tetapi, beberapa objek harus terhubung

source: However, some objects SHOULD connect! Road intersections should always be snapped together. If two roads do not share a common node, then the computer has no way of knowing that the roads actually connect to each other.
id: Bagaimanapun, beberapa objek HARUS terhubung! Persimpangan jalan harus selalu terhubung. Jika dua jalan tidak terhubung pada satu titik, maka komputer tidak akan mengetahui bahwa jalan tersebut sebenarnya saling terhubung satu sama lain.

source: Overlapping objects
id: Objek yang saling bertumpang tindih
