Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/old-training/intermediate/osm/303-dealing-with-conflicts.po
Languages: id

source: Module 3: Dealing With Conflicts
id: Modul 3: Menyelesaikan Konflik

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Identify conflicts
id: Mengenali Konflik

source: Understand why conflicts occur
id: Memahami bagaimana konflik dapat terjadi

source: Solve conflicts
id: Menyelesaikan konflik

source: Sometimes you are working in JOSM and when you upload all of your beautiful edits you get a nasty message complaining about a conflict.
id: Terkadang ketika Anda sedang bekerja di JOSM dan ketika Anda mengupload peta yang telah diedit, Anda mendapatkan pesan seperti ini:

source: What happened is essentially this: You downloaded data, which included a point which we will call Node A. Then while you were editing, another user else also downloaded Node A, changed it, and saved the changes back on OpenStreetMap. Now when you try to upload your version of Node A, it is different from the one saved on OSM. Therefore JOSM doesn’t know which version of Node A should be saved.
id: Hal yang terjadi adalah Anda mendownload sekelompok data yang termasuk sebuah point/node kita sebut Node A. Kemudian saat Anda sedang mengedit, ada orang lain yang juga mendownload Node A, mengubahnya, dan menyimpan kembali perubahannya pada OpenStreetMap. Sekarang saat Anda mencoba mengupload Node A dengan versi Anda akan berbeda dengan yang tesimpan pada OSM. Oleh karena itu JOSM tidak tahu versi mana dari Node A yang harus disimpan.

source: 1. Conflicts
id: 1. Konflik

source: Sometimes, JOSM is able to figure out what to do with conflicts on its own, and it will give you a message like this:
id: Terkadang, JOSM mampu mencari tahu apa yang harus dilakukan pada konfliknya, dan JOSM akan memberi Anda sebuah pesan seperti:

source: This means that JOSM has automatically decided that items in your local dataset will not be uploaded to the main server because they have already been deleted by another user.
id: Pesan tersebut menjelaskan bahwa JOSM telah otomatis memutuskan bahwa item dalam dataset lokal Anda tidak akan di-upload ke server utama karena mereka telah dihapus oleh pengguna lain.

source: In some conflicts, however, there is no easy action for JOSM to take and so it leaves the decision up to the user to determine what to do. This means it is up to you to resolve the conflicts.
id: Namun dalam beberapa konflik, tidak ada cara mudah untuk JOSM mengatasinya dan keputusan pengguna dibutuhkan untuk menentukan apa tindakan yang terbaik. Artinya, ini adalah keputusan Anda untuk memperbaiki konflik tersebut.

source: *This tells you to look at all of your conflicts in Layer 1 in the Dialog List box.*
id: *Pesan ini memberitahukan Anda untuk melihat semua konflik Anda pada Layer 1 pada kotak Daftar Dialog.*

source: *This window provides you with a warning as to whether you are likely to experience a conflict with your edits. If you check on the server you will be able to fix the editing issues that would arise.*
id: *Jendela ini menyediakan sebuah peringatan yang kemungkinan akan Anda hadapi ketika konflik editing terjadi. Jika Anda memeriksa server Anda mampu untuk memperbaiki masalah editing yang akan muncul.*

source: *This warning tells you that JOSM failed to delete a node due to it still being referenced in a way. In order to remedy this, the user has to go back into JOSM and resolve the conflict before uploading the data.*
id: *Peringatan ini menunjukan bahwa JOSM gagal untuk menghapus sebuah node karena node tersebut masih terhubung dengan sebuah garis. Untuk mengatasi hal ini, pengguna harus kembali ke JOSM dan menyelesaikan konflik sebelum melakukan upload data.*

source: 2. Conflict resolution
id: 2. Cara Menyelesaikan Konflik

source: The process of resolving a conflict is simple, although it can appear confusing at first in JOSM. Basically, for every conflict JOSM will present you with two choices - your version of an object and the one that is on the server. You need to choose whether to keep your version, or whether the new version on the server should remain.
id: Proses dalam menyelesaikan konflik cukup sederhana di JOSM, walaupun awalnya membingungkan. Pada dasarnya, untuk semua konflik yang terjadi JOSM akan menyediakan dua pilihan - objek versi Anda dan satu lagi versi orang lain yang berada di server. Anda harus memilih apakah ingin tetap menggunakan versi Anda atau versi baru di server.

source: You might think, “of course my version is going to be better!”. And maybe you’re right. But think back to our example at the start of this module. Perhaps while you were busy editing, another mapper added a lot of information to one of the nodes in your data set. If you choose your version over their version, you will lose all of that valuable information that they added. Hence you should consider keeping their version, or merging it with your own.
id: Anda mungkin berpikir “tentu saja versi saya yang lebih baik” dan mungkin Anda benar. Tetapi pikir kembali pada contoh di awal modul ini. Mungkin saat Anda sedang sibuk mengedit data, pembuat peta yang lain menambahkan banyak informasi pada salah satu node/titik yang ada di dalam dataset Anda. Jika Anda memilih versi Anda dan bukannya versi mereka, Anda akan kehilangan semua informasi berharga yang mereka tambahkan. Oleh karena itu Anda harus mempertimbangkan tetap menggunakan versi mereka, atau menggabungkannya dengan versi Anda sendiri.

source: When a conflict window pops up, it is usually best to choose the button :guilabel:`Synchronize ... only`. You may need to do this for more than one object, but it is best to resolve conflicts one at a time.
id: Ketika jendela konflik muncul, akan sangat baik untuk memilih tombol :guilabel:`Hanya mensinkronkan ...`. Anda mungkin butuh melakukannya untuk lebih dari satu objek, tetapi akan sangat baik untuk menyelesaikan konflik sekaligus.

source: After clicking this button, a pop-up window will appear detailing the conflict. The error message may look complicated, but it is not. You can see what type of conflict you have from the following symbol in the top tab.
id: Ketika Anda klik tombol tersebut, akan muncul jendela baru yang yang berisikan detail konflik Anda. Pesan konflik tersebut mungkin terlihat rumit, namun sebenarnya sederhana. Anda akan tahu jenis konflik apa yang Anda dapatkan dengan simbol di tab atas.

source: The conflict in our example refers to the properties, such as the location and existence of the object. This is why the coordinates and deleted state are listed.
id: Konflik dalam contoh ini mengacu pada properti, seperti lokasi dan keberadaan objek. Inilah sebabnya mengapa ada daftar koordinat dan status objek yang dihapus.

source: Types of conflict are:
id: Jenis Konflik diantaranya:

source: **Properties**: Object has been moved (coordinates) or deleted
id: **Properti:** Objek telah dipindahkan (koordinat) atau dihapus

source: **Tags**: Tags do not match
id: **Tag**: Tag tidak cocok

source: **Nodes**: There is a differences in the list of nodes in two ways
id: **Node**: Ada perbedaan dalam daftar node dalam dua cara

source: **Members**: There is a difference in the list of members in a relation
id: **Anggota**: Ada perbedaan pada daftar anggota dalam relasi

source: Conflicts only appear with two different edits at a time. If there are three or more conflicts, then a chain of conflicts will pop up. Therefore you have to choose or merge with only two conflicts at a time. You can choose your version, the other version or, at times, merge the two.
id: Konflik hanya muncul pada dua edit yang berbeda pada saat yang bersamaan. Jika ada tiga atau lebih, maka rangkaian konflik akan bermunculan. Sedangkan Anda hanya dapat memilih atau menggabungkan dua konflik pada saat yang sama. Anda dapat memilih versi Anda, versi yang lain, ataupun menggabungkan keduanya.

source: In our example we do not have the option of merging. Click on the first column, or :guilabel:`My version` if you believe that your edits are correct. Click on :guilabel:`Their version` if you think that the other edits are better.
id: Dalam contoh ini Anda tidak memiliki pilihan untuk penggabungan. Klik pada kolom pertama, atau :guilabel:`Versi saya` jika Anda yakin bahwa hasil mengedit Anda lebih tepat. Klik pada :guilabel:`Versi mereka` jika Anda berpikir bahwa versi mengedit orang lain lebih baik.

source: Once you have selected which version you think is best, click :guilabel:`Apply Resolution`.
id: Setelah Anda memilih versi mana yang menurut Anda paling baik, kemudian klik :guilabel:`Terapkan Penyelesaian`.

source: You can open the Conflicts panel to see a list of conflicts.
id: Anda dapat membuka panel Konflik untuk melihat daftar konflik.

source: The total number of unresolved conflicts is shown in the header. Select or resolve a conflict by clicking on it. This is useful when you have many conflicts to deal with.
id: Angka total konflik yang belum diselesaikan akan muncul diposisi yang paling atas. Pilih atau selesaikan konflik dengan mengklik pada daftar tersebut. Ini berguna ketika Anda mempunyai banyak konflik untuk diselesaikan.

source: You cannot upload your changes until this list is empty.
id: Anda tidak dapat mengupload perubahan Anda sampai jendela ini kosong atau semua konflik telah terselesaikan.

source: 3. Ways to avoid conflicts
id: 3. Cara untuk Menghindari Konflik

source: Upload frequently
id: Upload hasil editan secara berkala

source: To minimise the chance and number of conflicts it is important to upload your edits regularly. Conflicts appear more frequently for those who tend to save the area they are working on in their local computer and wait a while to upload it. It is best to download the area you are working on, edit it and then immediately upload it. The longer the time between downloading data and uploading changes to that data, the more likely it is that someone has edited something in the meantime.
id: Untuk meminimalisasi terjadinya sejumlah konflik, sangat dianjurkan untuk mengupload editan Anda secara rutin. Konflik muncul lebih banyak bagi mereka yang mengedit seluruh wilayahnya terlebih dahulu dan menunda untuk menguploadnya. Hal yang terbaik adalah men-download wilayah yang Anda kerjakan, edit, kemudian upload secepatnya secara berkala. Semakin lama waktu antara mendownload data dengan mengupload perubahannya, maka semakin besar kemungkinan seseorang telah mengedit/mengubah data tersebut pada saat itu.

source: Edit in the area you download
id: Mengedit pada Area yang Anda Dowload

source: Editing in the specific area you have downloaded minimises the risk of conflict. Make sure you do not edit outside of the area that you have downloaded. You can easily see the areas outside your download area in JOSM, because the background is made up of diagonal lines instead of being solid black.
id: Mengedit di area yang spesifik mengurangi resiko konflik. Anda harus yakin bahwa Anda tidak mengedit diluar area yang telah Anda download dan Anda bagi berdasarkan Task Manager. Langkah ini dapat menghindari banyak pengguna mengedit wilayah yang sama. Anda dapat dengan mudah melihat mana daerah luar dari daerah yang Anda download di JOSM, karena latar belakang daerah luat tersebut terdapat garis-garis diagonal, bukan hanya warna hitam.

source: :ref:`Go to next module --> <creating-josm-file-presets>`
id: :ref:`Lanjutkan ke modul berikutnya --> <creating-josm-file-presets>`
