Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/old-training/intermediate/osm/305-using-private-data-store.po
Languages: id

source: Module 5: Using the Separate Data Store
id: Modul 5: Menggunakan Data Store Terpisah

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Understand the functions of the Separate Data Store (SDS)
id: Memahami fungsi dari Data Store Terpisah (*SDS - Separate Data Store*)

source: Understand what data should be kept publicly and what should be private
id: Memahami data apa yang seharusnya dipublikasi dan data pribadi

source: Install SDS plugin in JOSM
id: Menginstal Plugin SDS di JOSM

source: Use SDS presets
id: Menggunakan Preset SDS

source: Use SDS plugin for selecting public and private data
id: Menggunakan plugin SDS untuk memilih data publik dan data pribadi

source: Access online datastore
id: Mengakses datastore secara online

source: OpenStreetMap data is open and available to anyone who would like to access it. However, there may be times when you want to use OSM to collect data, but you would like to keep some attributes stored in a private database. For this purpose, HOT has developed a tool for JOSM known as the Separate Data Store. The SDS allows you to create maps and add data into JOSM the same as always, but when you upload your edits, public data is saved to the OSM database and private data is saved separately to your private data server.
id: Data OpenStreetMap terbuka dan bebas bagi siapa saja yang ingin mengaksesnya. Bagaimana pun, Anda mungkin pernah mengalami ketika Anda ingin menggunakan OSM untuk mengumpulkan data, tetapi Anda menghendaki untuk menyimpan beberapa informasi di dalam database pribadi. Untuk alasan ini, HOT telah mengembangkan sebuah *tool* untuk JOSM yang dikenal sebagai Penyimpanan Data Terpisah SDS - *Separate Data Store*. SDS membebaskan Anda untuk membuat peta dan menambahkan data ke dalam JOSM seperti biasa, tetapi ketika Anda untuk *upload* perubahan, data publik akan disimpan di database OSM dan data pribadi akan disimpan secara terpisah di dalam server data pribadi.

source: This module is designed for people who desire to store private geospatial information, such as household income, personal health care data or the location of gold mines.
id: Modul ini dirancang untuk pengguna yang ingin menyimpan informasi geospasial privat, seperti pendapatan Kepala Keluarga, data kesehatan pribadi atau lokasi dari tambang emas.

source: For liability reasons, HOT does not provide the SDS service itself, but the software is available for installation on a private server. In this module we will utilise the SDS development server to demonstrate its functionality.
id: Untuk alasan tanggungjawab, HOT tidak menyediakan servis SDS sendiri, tetapi perangkat lunak itu sendiri mampu untuk menginstalasi dalam sebuah server privat. Di dalam modul ini kamu akan memanfaatkan pembangunan server SDS untuk mendemonstrasikan fungsionalitasnya.

source: If you are interested to set up your own SDS server, please contact us (team.id[at]hotosm.org).
id: Bila Anda tertarik untuk mengatur server SDS Anda sendiri, silakan hubungi kami (team.id[at]hotosm.org).

source: 1. Installing the SDS plugin
id: 1. Menginstalasi plugin SDS

source: This plug-in allows private data to be diverted into the private data store, rather than being saved in the OSM database. A recent version of JOSM is required for the SDS plugin to run. (If you do not have a recent version of JOSM, download and install it from http://josm.openstreetmap.de/.).
id: Plugin ini memperkenankan data privat untuk dialihkan ke *private datastore*, daripada disimpan di database OSM. Dalam versi JOSM yang terbaru dibutuhkan plugin SDS untuk memulai prosesnya. (Bila Anda tidak memiliki versi JOSM yang terbaru, Anda dapat mengunduh dan menginstalasinya dari http://josm.openstreetmap.de/).

source: Open the preferences menu in JOSM and go to the plugins tab.
id: Buka Menu Preferensi di JOSM dan pergi ke tab plugin.

source: Click :guilabel:`Download List` to ensure that all available plugins are listed.
id: Klik :guilabel:`Daftar Download` untuk memastikan semua plugin ada di dalam daftar.

source: In the search box, type :kbd:`sds`.
id: Di dalam kotak pencarian, ketik :kbd:`sds`.

source: Check the box next to the plugin to activate it. Click :guilabel:`OK` to download and install. You will need to restart JOSM.
id: Periksalah kotak di sebelah plugin untuk mengaktivasinya. Klik :guilabel:`OK` untuk mengunduh dan menginstall. Anda akan perlu memuat ulang JOSM.

source: 2. Using the plugin
id: 2. Menggunakan plugin

source: Editing the map works just the same as before. The only difference is that when you upload changes, some tags will be automatically saved on the private datastore, and the rest will be saved directly onto OSM.
id: Mekanisme mengedit peta sama seperti sebelumnya. Satu-satunya perbedaan ialah ketika mengunggah perubahannya, beberapa tag akan otomatis tersimpan dalam *private datastore*, dan selebihnya akan langsung tersimpan di dalam OSM.

source: After installing the plugin, you need to edit the settings so that private data is directed to the correct SDS server. In this module we will use a demo version of the SDS, but you may also configure the plugin to save private data on your custom SDS server.
id: Setelah mengintalasi plugin, Anda perlu memperbaiki pengaturannya sehingga data privat tersebut dapat terhubung ke server SDS yang benar. Dalam modul ini, kami akan menggunakan versi demo dari SDS, tetapi Anda mungkin juga perlu mengkonfigurasi plugin Anda untuk menyimpan data privat Anda dalam server SDS Anda.

source: Go to :menuselection:`SDS ‣ Preferences...`.
id: Arahkan ke :menuselection:`SDS ‣ Preferences...`.

source: Edit the :guilabel:`SDS server URL` so that it points to :kbd:`http://sds.dev.hotosm.org/`.
id: Ubah :guilabel:`SDS server URL` sehingga dapat terarah ke :kbd:`http://sds.dev.hotosm.org/`.

source: We will use a sample account to try out the SDS. Enter the following for the username and password:
id: Kita akan menggunakan akun contoh untuk mencoba SDS. Masukkan informasi berikut untuk nama pengguna dan kata kunci:

source: SDS username: test_sds@hotosm.org
id: Nama pengguna SDS: test_sds@hotosm.org

source: SDS password: CyYi3VeuHk
id: Kata kunci SDS: CyYi3VeuHk

source: Click :guilabel:`Test credentials now`. If it is set up correctly, you should receive a message which tells you the connection is successful.
id: Klik :guilabel:`Coba perintah sekarang`. Apabila ini sudah diatur secara benar, Anda akan menerima sebuah pesan yang memberitahukan Anda bahwa koneksi tersebut telah sukses.

source: 3. How it works
id: 3. Bagaimana cara kerjanya

source: How does the plugin know which data you want to store on OSM and which data you want to store publicly? Quite simply, it knows because of the tags. Normal tags go to OSM as always, but you can use tags with a special prefix that will be sent to the private datastore.
id: Bagaimana plugin tersebut tahu data mana yang ingin disimpan di dalam server OSM dan data mana yang ingin disajikan untuk publik? Cukup mudah, plugin tersebut dapat membaca dari tag yang dimasukkan. Tag normal akan menuju ke OSM seperti biasa, tetapi Anda dapat menggunakan tag dengan imbuhan spesial yang akan dikirimkan ke *private datastore*.

source: By default, any tag that has the prefix **hot:** will go to the private datastore. This can be changed in the SDS preferences menu:
id: Sesuai pengaturan bawaan, tag apa pun yang memiliki imbuhan **hot:** akan dikirim ke *private datastore*. Ini akan dapat diubah di dalam menu preferensi SDS:

source: When you create or edit an object on the map, you can apply tags like this:
id: Ketika anda membuat atau mengedit objek di dalam peta, anda bisa mengganti tag seperti ini :

source: In this case, the first two tags will be saved on OSM. The third tag, because it has the prefix **hot:**, will be saved on the private datastore.
id: Dalam kasus ini, dua tag pertama akan disimpan di dalam OSM. Tag yang ketiga, karena ia memiliki imbuhan **hot:**, maka akan disimpan di dalam *private datastore*.

source: You will most likely collaborate with others when using a private datastore, so you will have a standard list of tags to use for the specific data you are collecting. These tags can then be made into a presets menu, which will provide an easy-to-use form for adding both public and private data.
id: Anda kemungkinan akan berkerjasama dengan orang lain ketika menggunakan *private datastore*, sehingga Anda akan memiliki daftar standar dari tag yang digunakan untuk data spesifik yang Anda kumpulkan. Tag-tag ini kemudian dapat dibuat menjadi menu preset, yang akan memberikan kemudahan untuk menambahkan data baik secara publik maupun pribadi.

source: 4. Accessing the datastore online
id: 4. Mengakses Datastore secara Online

source: You can access the SDS online with your username and password. To visit the example SDS, open your browser and go to http://sds.dev.hotosm.org/.
id: Anda dapat mengakses SDS secara online menggunakan nama pengguna dan kata sandi Anda. Untuk melihat contoh dari SDS, bukalah web browser Anda dan buka http://sds.dev.hotosm.org/.

source: There are two types of SDS users. Admin users can add new projects or users onto the SDS. Personal users are regular users who are part of a project team which is using the SDS.
id: Terdapat dua tipe pengguna SDS. Admin pengguna dapat menambahkan proyek baru atau pengguna baru ke dalam SDS. Pengguna personal merupakan pengguna regular yang merupakan bagian dari tim proyek yang menggunakan SDS.

source: Our sample account is a personal account, not an admin, but we can see the online platform where our private data is kept.
id: Akun contoh kami adalah akun personal, bukan admin, tetapi kita dapat melihat platform online dimana data pribadi kita disimpan.

source: Let's see what the private data looks like online.
id: Mari kita lihat bagaimana tampilan data pribadi secara online.

source: Click on :guilabel:`Tag search`.
id: Klik pada :guilabel:`Tag pencarian`.

source: In the text box, type :kbd:`hot` and click :guilabel:`search`.
id: Di dalam kotak dialog, ketik :kbd:`hot` dan klik :guilabel:`cari`.

source: You should see at least one search result. Click on the eyeball button next to it to see complete information.
id: Anda harus melihat setidaknya satu hasil pencarian. Klik pada tombol bulat di sebelahnya untuk melihat informasi lengkap.

source: We can see all the information about this object, both the public attributes from OSM and the private attributes kept in the SDS.
id: Kita akan melihat seluruh informasi tentang objek ini, baik informasi yang dipublikasikan dari OSM dan informasi pribadi yang disimpan dalam SDS.

source: Click on :guilabel:`Expert View` to see the actual tags that are used with this object. Look at :guilabel:`OSM Properties` to see the tags that are saved publicly on OSM.
id: Klik pada :guilabel:`Tampilan lanjut` untuk melihat tag yang sebenarnya yang digunakan untuk objek ini. Lihat lah pada :guilabel:`Properti OSM` untuk melihat tag yang disimpan dan dipublikasi di OSM.

source: 5. Common questions
id: 5. Pertanyaan umum

source: How do we save our data?
id: Bagaimana cara kita menyimpan data kita?

source: The steps are exactly the same as uploading changes to OSM. The only difference is that tags with the prefix you select (such as **hot:**) will be diverted to a private datastore.
id: Semua langkahnya pada dasarnya sama seperti mengunggah perubahan dalam OSM. Satu-satunya perbedaan ialah bahwa tag dengan imbuhan yang Anda pilih (seperti **hot:**) akan dialihkan ke *private datastore*.

source: How many users can use the same account? How can we add users?
id: Berapa banyak pengguna yang dapat menggunakan akun yang sama? Bagaimana cara menambahkan daftar pengguna?

source: There is no limit for user accounts. When you set up your own SDS, you will have an Admin account and can add as many users as you need.
id: Tidak ada batasan untuk akun pengguna. Ketika Anda mengeset SDS Anda sendiri, Anda akan memiliki akun admin dan dapat menambahkan berapa pun jumlah daftar pengguna yang Anda inginkan.

source: How much data can we save in our private server?
id: Berapa banyak data yang dapat kita simpan dalam server pribadi kita?

source: A lot! Basically this depends on the size of your server.
id: Banyak! Pada dasarnya, hal ini tergantung dari kapasitas server Anda.

source: Is there an easy way to search the private data?
id: Apakah ada cara mudah untuk menemukan data pribadi?

source: After you sign in to the SDS website you are able to perform a tag search, as we have done in this module.
id: Setelah Anda mendaftarkan diri Anda pada *website* SDS, Anda dapat melakukan pencarian tag seperti yang telah kita praktikkan pada modul ini.

source: :ref:`Go to next module --> <editing-wiki-osm>`
id: :ref:`Modul selanjutnya --> <editing-wiki-osm>`
