Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/old-training/intermediate/osm/306-editing-wiki-osm.po
Languages: id

source: You can create any wiki page the same way that you have created your user page. However, before you run off creating hundreds of pages, it is important to understand a few guidelines for how to best contribute. Some key things to keep in mind are:
id: Anda dapat membuat halaman wiki apapun seperti yang telah Anda lakukan di halaman user Anda. Akan tetapi sebelum Anda mencoba membuat halaman Anda penting buat Anda untuk mengetahui dan memahami beberapa pedoman untuk berkontribusi di wiki ini. Hal-hal yang perlu diingat yaitu:

source: Before creating a page
id: **Sebelum membuat halaman**

source: Don’t duplicate. When you want to create a new wiki page, do a comprehensive search of the wiki to ensure that someone else hasn’t already created a page about the same topic. You can search for existing pages using the search box in the upper right.
id: Jangan meniru. Ketika Anda ingin membuat sebuah halaman lakukan peninjauan dan pencarian di wiki untuk memastikan bahwa topik yang Anda ingin tulis belum dibuat oleh siapapun. Anda dapat mencari halaman yang sudah ada di kotak pencarian di sebelah kanan atas.

source: If a page that you want to create already exists, but you think it could be better, you should improve it, instead of creating an entirely new page.
id: Jika halaman yang Anda ingin buat telah ada, tapi Anda ingin memperbaikinya Anda lebih baik mengedit halaman tersebut daripada membuat halaman yang baru.

source: Choose a descriptive name, capitalise new words and don’t use spaces or dashes. The Map Features page for example, is named Map_Features, making the link: http://wiki.openstreetmap.org/wiki/Map_Features.
id: Pilihlah nama yang dapat mendeskripsikan, gunakan huruf besar di setiap kata. Fitur peta sebagai contoh diberi nama Map_Features, buat tautan : http://wiki.openstreetmap.org/wiki/Map_Features

source: When structuring a page
id: **Ketika membuat/menyusun halaman**

source: Divide your page into sections and subsections.
id: Bagi halaman Anda ke dalam sesi dan sub sesi

source: Create an “Introduction” section at the top of the page to give a brief explanation of the page.
id: Buat pendahuluan di tiap bagian atas halaman untuk memberikan penjelasan dari halaman tersebut.

source: Format different parts of your pages as tables or lists, when appropriate.
id: Buat bagian-bagian berbeda dari halaman Anda seperti tabel atau daftar jika dibutuhkan.

source: When in doubt, look at other pages on the wiki for inspiration about how to format things. Remember that you can look at the code for any page by clicking on the edit tab and seeing how other users format their text.
id: Jika Anda ragu, lihat ke halaman wiki yang lain untuk mendapatkan inspirasi bagaimana untuk membuat format sebuah halaman. Ingat, Anda dapat melihat kode dari halaman manapun dengan meng-klik pada tab edit dan liat bagaimana penulis memberikan format pada tulisan mereka.

source: 6. Uploading files and images
id: 6. Upload File dan Foto/Gambar

source: To add or insert files or images on wiki pages, first we must upload the file itself to the wiki.
id: Untuk menambahkan atau memasukkan file atau gambar pada halaman Wiki, terlebih dahulu kita harus meng-upload file atau gambar tersebut ke situs Wiki.

source: Uploading files
id: Meng-upload file

source: Go to https://wiki.openstreetmap.org and make sure you are logged in.
id: Buka situs https://wiki.openstreetmap.org dan pastikan Anda masuk terlebih dahulu

source: Click :guilabel:`Upload file` on the left side of the screen, under the Tools menu.
id: Klik :guilabel:`Unggah berkas` yang berada di sisi kiri layar, dibawah menu Peralatan.

source: Click :guilabel:`Choose File`. Find the file that will be uploaded from your computer.
id: Klik :guilabel:`Choose File` pada Nama berkas sumber. Cari file yang akan di-upload pada komputer Anda.

source: Optionally, you may enter a new filename for the file, a summary, and a licence.
id: Sebagai pilihan, Anda dapat memasukkan nama file untuk file, ringkasan, dan lisensi.

source: After selecting the file, click :guilabel:`Upload file` at the bottom of the page. A page like this will appear, with your file shown:
id: Setelah memilih file, klik “Muatkan berkas” di bagian bawah halaman. Kemudian akan tampil halaman seperti ini:

source: This shows that your file or image uploaded successfully. The next step is to add it on to a wiki page.
id: Ini menunjukkan bahwa file atau gambar Anda berhasil ter-upload! Langkah selanjutnya adalah menambahkan ke dalam halaman wiki.

source: Insert file / image in the wiki page
id: Memasukkan file/gambar pada halaman Wiki.

source: Go to the page where you wish to insert your file of image, and click :guilabel:`Edit`.
id: Pergi ke halaman dimana Anda dapat memasukkan file/gambar, dan klik :guilabel:`Edit`.

source: Copy the filename that you uploaded previously, for example: :kbd:`File:Mapping jakarta.JPG` and :kbd:`File:Pemetaan dengan OSM.pdf`.
id: *Copy* nama file yang sudah Anda upload sebelumnya. Contoh: :kbd:`File:Mapping jakarta.JPG` dan :kbd:`File:Pemetaan dengan OSM.pdf`.

source: Paste the filename(s) you have uploaded into the editing box, with two sets of brackets around it:
id: *paste* nama file (filename) yang telah Anda *upload* kedalam kotak mengedit, dengan tanda kurung diantaranya.

source: Click :guilabel:`Save page`.
id: Klik :guilabel:`Simpan Halaman`.

source: In our example, the result looks like this:
id: Dalam contoh, hasilnya akan tampak seperti ini:

source: 7. Translating pages
id: 7. Penerjemahan Halaman

source: One very useful thing that can be done on the wiki is to translate important pages into your language. As you’ve already seen, many wiki pages have links at the top where you can switch languages. However, this is only available for pages that have been translated, and that include a special tag at the top - {{Languages|page_name}}
id: Salah satu hal yang paling berguna yang bisa dilakukan dalam wiki ini adalah kita dapat menerjemahkan halaman-halaman yang kita anggap penting ke dalam bahasa kita. Seperti yang telah Anda lihat, banyak halaman yang ada di wiki memiliki link yang berada pada atas halaman yang dapat diubah ke dalam berbagai bahasa. Akan tetapi hal ini hanya dapat dilakukan pada halaman yang sudah diterjemahkan sebelumnya dan juga termasuk tag khusus yang ada di atas halaman. {{Languages|page_name}}

source: When developing the OSM community in your country, it is very useful for key wiki pages to be translated into your language. Adding translated pages is easy, as we will see here.
id: Ketika mengembangkan komunitas OSM di negara Anda, akan sangat bermanfaat bagi halaman-halaman yang ada di wiki untuk diterjemahkan ke dalam bahasa Anda. Menerjemahkan halaman yang ada di wiki sangatlah mudah, seperti yang akan kita lihat ini.

source: The names of pages are always created in English, but different versions of the same page can be created by adding a language code into the URL. For example, the Map Features page is at http://wiki.openstreetmap.org/wiki/Map_Features
id: Nama-nama dari halaman yang ada biasanya dibuat dalam bahasa inggris tapi versi yang berbeda pada halaman yang sama dapat dibuat dengan menambahkan kode bahasa ke dalam URL. Contohnya halaman Map Features ada di http://wiki.openstreetmap.org/wiki/Map_Features

source: If you want the Spanish version of this page, it is available at http://wiki.openstreetmap.org/wiki/ES:Map_Features
id: Jika Anda menginginkan versi dalam bahasa Spanyol, tersedia di http://wiki.openstreetmap.org/wiki/ES:Map_Features

source: If a page exists that you want to translate, simply visit the URL with your language code and a colon (:) preceding the page name. For example, if we wanted to translate this page into Indonesian, we would visit http://wiki.openstreetmap.org/wiki/ID:Map_Features.
id: Jika Anda ingin menerjemahkan sebuah halaman, Anda dapat mengunjungi ke URL dengan menggunakan kode bahasa Anda dan menggunakan tanda titik dua (:) pada awal nama halaman. Contoh jika Anda ingin menerjemahkan halaman Map Feature ke dalam bahasa Indonesia Anda dapat mengunjungi. http://wiki.openstreetmap.org/wiki/ID:Map_Features

source: Then click :guilabel:`Edit` to create this page.
id: Lalu klik :guilabel:`Edit` untuk membuat halaman ini.

source: The easiest way to add a translation is to go to a page in English, click :guilabel:`Edit`, and copy all of the wiki text to your Clipboard. Then edit the page in your own language, pasting in the original English text and translating it piece by piece. This will allow you to keep all of the original formatting and links correctly, but translate the English text into your own language.
id: Cara paling mudah untuk menambahkan terjemahan adalah lihat halaman di dalam bahasa inggris, klik :guilabel:`Edit`” dan *copy* semua wiki teks yang ada ke dalam Clipboard Anda lalu edit halaman ini ke dalam bahasa Anda, *paste* teks asli ke dalam bahasa Inggris dan terjemahkan ke dalam bahasa Anda. Ini akan membuat Anda akan tetap menyimpan format asli dan tautan halaman tersebut, tapi teks dalam bahasa Inggris telah diterjemahkan ke dalam bahasa Anda.

source: 8. Watching pages
id: 8. Cara Melihat Daftar Perubahan

source: You may want to keep an eye on pages that you have edited yourself, or that you have an interest in. To do this, you can add specific pages to your :guilabel:`Watchlist` which keeps a record of recent changes to pages, so that you will know when others have edited them.
id: Anda dapat menyimpan halaman yang telah Anda edit ataupun halaman yang menurut Anda menarik. Untuk melakukan ini Anda dapat menambahkan halaman tertentu ke dalam :guilabel:`Watchlist` Anda. Ini akan menyimpan perubahan yang Anda lakukan pada halaman tersebut jadi Anda akan mengetahui ketika ada orang lain yang mengeditnya kemudian.

source: To add a page to your watchlist, click on the star at the top of the page section:
id: Untuk menambahkan halaman ke dalam WatchList Anda, klik tanda bintang di bagian atas halaman:

source: Then, you can view your watchlist by clicking on :guilabel:`Watchlist` at the top of the page:
id: Lalu Anda dapat melihat WatchList Anda dengan klik pada :guilabel:`Watchlist` yang ada pada bagian atas halaman:

source: On the Watchlist page you choose to show changes to your watched pages within the past hours, days or since you started watching the page.
id: Pada Watchlist halaman Anda akan menunjukkan perubahan yang Anda lakukan dalam beberapa jam yang lalu, hari atau dari sejak Anda melihat halaman tersebut.
