Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/old-training/intermediate/osm/306-editing-wiki-osm.po
Languages: id

source: Module 6: Editing the OpenStreetMap Wiki
id: Modul 6: Mengedit Wiki OpenStreetMap

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Make an account on the OpenStreetMap wiki
id: Memahami cara membuat akun di Wiki OpenStreetMap

source: Understand conventions and rules in developing a wiki page
id: Memahami format dan aturan dalam pembuatan halaman wiki

source: Edit the wiki
id: Memahami cara mengedit wiki

source: Upload files and images
id: Memahami cara meng-*upload* file dan foto/gambar

source: Translate and revise wiki
id: Mampu menerjemahkan dan merevisi wiki

source: OpenStreetMap is based around a community of mappers working together. Because of this it is necessary to have a way to communicate with each other, whether it be to organise social mapping events, to discuss different projects related to OSM or to create standards for mapping processes. The main avenue for mappers to do this is through the OSM wiki, a website where users can create different web pages about different topics and in different languages. To see the OSM wiki, visit http://wiki.openstreetmap.org
id: OpenStreetMap berbasiskan komunitas orang-orang yang membuat peta dari seluruh dunia. Maka, sangat penting untuk saling berkomunikasi antara satu dengan yang lainnya, merencanakan kegiatan pemetaan sosial, mendiskusikan berbagai proyek yang berkaitan dengan OSM ataupun membuat standardisasi dalam proses pemetaan. Salah satu cara untuk dapat berkomunikasi satu sama lain adalah dengan menggunakan wiki OSM, sebuah situs dimana para pengguna dapat membuat berbagai halaman web mengenai topik-topik yang berbeda dan halaman tersebut dapat dibuat dalam berbagai bahasa. Untuk melihat wiki OSM, Anda dapat mengunjungi : http://wiki.openstreetmap.org

source: 1. OSM wiki
id: 1. Wiki OSM

source: A wiki is a website where any user can add pages and edit existing pages. It is based on the same principle as OSM. The only difference is that with OSM users are editing maps, while wiki users are editing text. The most famous wiki is Wikipedia (http://www.wikipedia.org), an online encyclopedia that covers almost every topic imaginable.
id: Situs wiki adalah sebuah situs dimana semua pengguna dapat menambahkan atau mengedit halaman-halaman yang ada. Prinsipnya sama seperti OSM, hanya saja perbedaannya yaitu pengguna OSM mengedit peta sedangkan di wiki pengguna mengedit tulisan. Wiki yang paling terkenal yaitu Wikipedia (http://www.wikipedia.org), sebuah kamus online dimana menampilkan informasi tentang hampir seluruh topik.

source: The OSM wiki contains information about everything related to OSM. When someone is working on a project that uses OSM, they create a wiki page so that other people can read about their project. The wiki contains help for users wanting to learn more about OSM, for common standards on how to make maps and on how to tag objects on the map, as well as many other things. You have already seen at least one of the OSM wiki pages, which describes all of the most common features that you can add to the map, and how they are commonly tagged. This is the Map Features page: http://wiki.openstreetmap.org/wiki/Map_Features
id: Wiki OSM berisi informasi tentang segala sesuatu yang berkaitan dengan OSM. Ketika seseorang bekerja dalam suatu proyek yang menggunakan OSM, mereka dapat membuat sebuah halaman di Wiki sehingga orang lain dapat membaca dan mengetahui tentang proyek mereka. Wiki juga dapat membantu para pengguna untuk mempelajari lebih banyak hal tentang OSM, petunjuk-petunjuk umum dalam membuat peta dan bagaimana memberikan tag di objek yang ada pada peta dan masih banyak hal lainnya. Anda telah melihat setidaknya satu dari halaman Wiki OSM yang menjelaskan fitur-fitur umum yang dapat Anda tambahkan ke dalam peta dan bagaimana biasanya suatu objek diberikan tag. Berikut adalah halaman dari Map Features: http://wiki.openstreetmap.org/wiki/Map_Features

source: In this module we will learn how to add and edit pages on the OSM wiki. We will learn the guidelines for contributing, the special markup language for creating a wiki page, and helpful ways for improving the wiki, such as translating important pages.
id: Dalam modul ini kita akan belajar bagaimana untuk membuat dan mengedit halaman yang ada di OSM wiki. Kita akan belajar petunjuk untuk berkontribusi, membuat bahasa khusus dalam membuat halaman wiki dan cara untuk membantu meningkatkan wiki seperti menerjemahkan halaman-halaman penting yang ada di wiki.

source: 2. Signing up
id: 2. Mendaftar

source: Go to http://wiki.openstreetmap.org to see the main wiki page. You’ll see a lot of things here, and many links to other pages on the wiki. In the left column are links to some of the main pages. At the top of the page are a list of all the languages in which you can view this page. If it’s available, you can switch the page to your language. Try exploring some of the links on the page to what kind of information is available on the wiki.
id: Kunjungi http://wiki.openstreetmaps.org untuk melihat halaman utama dari wiki. Anda akan melihat banyak hal dan tautan ke halaman-halaman lain yang ada di wiki. Di kolom kiri adalah tautan ke beberapa halaman utama. Di bagian atas halaman ada daftar dari berbagai bahasa yang dimana dapat Anda gunakan untuk membaca halaman ini. Jika tersedia maka Anda dapat mengganti halaman ke dalam bahasa Anda. Anda dapat mencoba untuk mempelajari lebih lanjut beberapa tautan yang ada di halaman ini dan melihat informasi apa saja yang tersedia di wiki.

source: It is not necessary to have an account in order to view the OSM wiki, but you will need to create an account if you want to edit or add pages. Note that this is not the same as your OSM account. You must create a new account, although you can use the same name on the wiki as you did when signing up for OSM.
id: Anda tidak harus memiliki akun untuk melihat OSM wiki, akan tetapi jika Anda ingin mengedit atau membuat sebuah halaman Anda harus mempunyai akun. Perlu diingat bahwa akun di wiki ini tidak sama dengan akun OSM Anda. Anda harus membuat akun baru, tetapi Anda dapat menggunakan nama yang sama dengan nama yang Anda gunakan di OSM untuk membuat akun di wiki.

source: To create a new account, click on :guilabel:`Create account` in the upper right corner of the website. If you already have an account click :guilabel:`Log in` to sign in to the website.
id: Untuk membuat akun baru, klik :guilabel:`Log in / create account` di sudut kanan atas dari halaman situs. Jika Anda telah memiliki akun klik :guilabel:`Log in` untuk masuk kedalam situs.

source: Fill in the form with the username you want to create, your password twice, your email address, and your real name. In the CAPTCHA box at the top you need to type the words that are shown in the box. This is a security prevention to ensure that you are human, and not a computer.
id: Isilah kotak-kotak yang ada dengan nama pengguna yang Anda inginkan, ketik kata sandi dua kali, alamat email dan nama asli Anda. Dalam kotak CAPTCHA di atas Anda perlu untuk menuliskan dua kata yang ada di kotak tersebut. Hal ini untuk memastikan bahwa yang membuat akun ini adalah manusia bukan komputer.

source: Click :guilabel:`Create your account`.
id: Klik :guilabel:`Create account`.

source: You will be automatically logged in, and your username and other links will appear in the upper right corner of the website.
id: Anda akan otomatis masuk, dan Anda dapat melihat nama pengguna dan tautan yang ada tersedia di sudut kanan atas pada halaman ini.

source: 3. Editing
id: 3. Mengedit

source: Let’s start out by editing our user page. Every user has a page on the wiki. These pages are commonly used to provide information about yourself, your location, for communication between users and for creating test pages and drafts.
id: Kita akan mulai dengan mengedit halaman user kita. Setiap pengguna memiliki sebuah halaman di wiki. Halaman-halaman ini biasanya digunakan untuk menampilkan informasi tentang diri Anda, dimana Anda berada, untuk komunikasi diantara pengguna dan untuk membuat halaman tes dan konsep.

source: This is a great place to start learning the basics of editing a wiki page.
id: Ini adalah halaman yang tepat untuk kita mulai dan mempelajari dasar-dasar dari mengedit halaman di wiki.

source: Go to your user page by clicking on your username in the upper right corner. The user in our example is “MapJeff”. Yours will be the username you signed up with.
id: Pergi ke halaman user Anda dengan meng-klik nama pengguna pada sudut kanan atas. Username yang digunakan dalam contoh ini adalah “MapJeff”. Untuk username Anda, sebaiknya gunakan username yang sama dengan OSM.

source: Right now the page is empty. Click on :guilabel:`edit this page` to add something to it.
id: Untuk sekarang halaman tersebut masih kosong. Klik :guilabel:`edit this page` untuk menambahkan sesuatu di dalamnya.

source: We can type anything into the editor to add information to the page. For example, let’s add some basic information and a description. Add information about yourself. Here is an example:
id: Kita dapat mengetik apapun ke dalam editor untuk menambahkan informasi ke dalam halaman. Sebagai contoh, kita akan menambahkan beberapa informasi dasar dan deskripsi. Anda dapat menambahkan informasi mengenai diri anda. Berikut adalah contohnya :

source: When you have added some text, enter a summary of your changes in the box next to :guilabel:`Summary` and click :guilabel:`Save Page`. The page will look something like this:
id: Ketika Anda menambahkan beberapa tulisan, memasukkan ringkasan perubahannya ke dalam kotak :guilabel:`Summary` dan klik :guilabel:`Save Page`. Maka halaman tersebut akan terlihat seperti berikut:

source: This is great because we have successfully saved our text to the page, but it is no good because it not formatted in a good way. In order to make it look nice, we need to learn some of the basic wiki formatting techniques. Click :guilabel:`Edit` at the top of the page, and let’s make some more changes to our page.
id: Ini pertanda yang bagus karena kita telah berhasil memasukkan tulisan ke dalam halaman, tetapi belum cukup bagus karena format dan bentuknya belum tertata dengan rapi. Untuk membuat ini terlihat lebih baik kita harus mempelajari beberapa teknik dasar dalam format wiki. Klik :guilabel:`Edit` yang terdapat di sebelah atas halaman dan buat beberapa perubahan dalam halaman Anda.

source: If you understood the previous module on XML, you will remember that we used **elements** which have opening tags and closing tags. We will do something similar on the wiki, using special characters to surround the text we want to appear a certain way.
id: Jika Anda telah mengerti modul sebelumnya tentang XML, maka Anda akan mengingat kita menggunakan **element-elemen** dimana menggunakan tag pembuka dan penutup. Kita akan melakukan hal yang sama di wiki menggunakan karakter khusus di sekitar teks yang akan kita tampilkan.

source: The wiki does not automatically put new lines in unless we ask it to, so we need to put the tag :kbd:`<br>` at the end of each of our lines in the first section. This will cause a line break to occur.
id: Wiki tidak akan otomatis menuju ke paragraf yang baru kecuali kita memasukkan tag :kbd:`<br>` di setiap akhir dari kalimat di paragraf sebelumnya. Ini akan membuat pemisah antar paragraf/bagian.

source: Then, we want the words “About Me” to appear highlighted since it is the heading of a section. To do this we can surround it like this:
id: Setelah itu, kita mau tulisan “About Me” tampil dengan disorot sebagai judul dari bagian ini. Untuk melakukan hal tersebut kita dapat mengetik seperti ini :

source: Now our code looks like this:
id: Sekarang, kode kita akan terlihat seperti ini :

source: After we save it the page will look nicely formatted:
id: Setelah kita simpan maka halaman akan terlihat lebih bagus seperti ini :

source: Practice formatting your text in different ways. A small hint: the buttons above the text box will automatically insert different types of formatting code into your text!
id: Cobalah berlatih mengedit format teks Anda dengan cara yang berbeda. Petunjuk: tombol-tombol di atas kotak teks Anda akan otomatis membuat kode format Anda ke dalam bentuk yang berbeda pada teks Anda!

source: Once you have saved your page, it will be viewable by anyone on the internet. The following link goes to our demo page, but if you replace our username with yours, it will go to your user page.
id: Ketika Anda telah selesai menyimpan halaman Anda, maka akan terlihat oleh semua orang yang ada di Internet. Tautan berikut ini akan menuju ke halaman, tetapi jika Anda mengganti nama pengguna dengan milik Anda maka tautan tersebut akan menuju ke halaman Anda.

source: 4. Wiki formatting
id: 4. Format Penulisan Wiki

source: In this section we will discuss many of the different ways you can format your information on a wiki page and the appropriate codes to use to create different elements.
id: Pada bagian ini kita akan mendiskusikan berbagai cara untuk memformat informasi Anda di halaman wiki dan meyesuaikan kode yang Anda gunakan untuk membuat berbagai elemen yang berbeda.

source: It’s a good idea to practise before trying to create an official wiki page that you want others to see, so first let’s create a sub-page under your user page where you can play around and practise editing.
id: Hal yang baik dilakukan adalah Anda sebaiknya latihan membuat halaman terlebih dahulu sebelum membuat halaman resmi di wiki yang Anda inginkan orang lain untuk melihatnya. Kita akan membuat sub halaman di halaman user Anda dimana Anda dapat berlatih dan belajar dalam mengedit.

source: Create a new wiki page by typing in the link to the page that you want and then creating a new page. For now, let’s create a new subpage that we can use to practise our wiki editing. In your web browser go to the following address, replacing “MapJeff” with your own username: https://wiki.openstreetmap.org/wiki/User:MapJeff/testpage
id: Anda dapat membuat sebuah halaman wiki baru dengan meng-klik link ke halaman yang ingin lihat kemudian membuat sebuah halaman baru. Sekarang, kita akan membuat sub halaman baru yang dapat kita gunakan dalam melakukan perubahan wiki. Buka browser dan pergi ke alamat dibawah ini dengan mengganti “MapJeff” dengan Username Anda sendiri. https://wiki.openstreetmap.org/wiki/User:MapJeff/testpage

source: This will take us to an empty page that we can edit.
id: Ini akan membawa kita ke dalam sebuah halaman kosong yang dapat kita edit.

source: Now let’s look at how to format our text. Use your test page to try out different formatting.
id: Sekarang mari kita lihat bagaimana untuk memformat teks. Gunakan halaman tes Anda untuk mencoba format yang berbeda.

source: Simple formatting
id: Format sederhana

source: Description
id: Deskripsi

source: Example wiki source
id: Contoh sumber wiki

source: Result
id: Hasil

source: Surrounding text with two apostrophes (') will display the text in italic
id: Disekitar teks berikan dua kutip (') yang akan menampilkan teks dalam bentuk *italic*.

source: Surrounding text with three apostrophes (') will display the text in bold
id: Disekitar teks berikan tiga kutip (') yang akan menampilkan teks dalam bentuk **bold**.

source: Surrounding text with five apostrophes (') will display the text in bold italic
id: Disekitar teks berikan dua kutip (') yang akan menampilkan teks dalam bentuk *italic*.

source: Four dashes in a row will create a horizontal line. This should be used sparingly.
id: Empat garis lurus berturut turut akan menghasilkan garis horizontal. Ini jarang digunakan.

source: Special formatting
id: Format khusus

source: The tags '<nowiki>' and '</nowiki>' disable the wiki-syntax in the enclosed text.
id: Tag '<nowiki>' dan '</nowiki>' di sekitar teks tidak akan menampilkan teks yang ada.

source: Surround your text with '<!-- ', '-->' and the enclosed text will not display on the wiki-page (a comment).
id: Ketik '<!-- ', ' -->' di antara teks anda dan teks tersebut tidak akan tampil di wiki (a comment).

source: Comment! <!--this is a comment which will not be shown-->
id: Comment! <!—komen ini tidak akan muncul-->

source: Headings and subheadings
id: Judul dan Sub Judul

source: A section starts with a header consisting of a line beginning and ending with two or more consecutive equal signs (=). The number of equal signs indicates the nesting level of sections.
id: Suatu sesi dimulai dengan judul yang dibuat dengan kalimat dimulai dan diakhiri dengan dua atau lebih tanda sama dengan (=). Jumlah dari tanda menunjukkan tingkat besar dari judul.

source: When you create sections and subsection headings in your wiki page, the page will automatically have a table of contents section created at the top of the page.
id: Ketika Anda membuat suatu sesi dan sub sesi judul di halaman wiki Anda, maka halaman wiki Anda akan otomatis memiliki bagian daftar isi yang dibuat di atas halaman Anda.

source: Header 2 (try this out!)
id: Header 2 (cobalah!)

source: Lists
id: **Daftar**

source: It’s easy to create a bullet list. In order to make an item in a list, you simply need to use a star (*) as the first character on one or more consecutive lines.
id: Sangat mudah untuk membuat sebuah urutan. Dalam membuat sebuah item dari urutan Anda hanya perlu untuk menaruh tanda bintang (*) di awal karakter kalimat Anda.

source: To create an ordered list, simply use number signs(#) instead of stars(*). Create nested lists by using a combination of stars and number signs. Nested lists display as lists with different levels of indentation. When nesting lists you may mix bullet lists and numbered lists on each level.
id: Untuk membuat urutan berdasarkan angka Anda dapat menggunakan tanda pagar (#) bukan bintang (*). Anda juga dapat membuat urutan berdasarkan tingkatan menggunakan kombinasi bintang dan pagar. Urutan akan tampil dengan tingkatan yang berbeda.

source: This list has
id: Daftar ini memiliki

source: Links
id: **Tautan**

source: Links within the OSM wiki are simple. Simply surround the name of the wiki page you want to link to with double brackets [[wiki-link]]. You could add different text for the link by adding a pipe symbol (|) and the text will appear as the link text. If you want a special language version of a wiki page, you should prefix the page name with the two-letter language code and a colon (:). For example, to link to the German version of a page, you would use [[de:wiki-link]].
id: Tautan dalam wiki OSM cukup sederhana. Cukup tulis disekitar halaman wiki yang Anda ingin berikan tautan dengan dua tanda kurung [[wiki-link]]. Anda dapat menambahkan teks yang berbeda untuk tautan tersebut dengan menambahkan simbol pipa (|) dan teks akan tampil dengan tautan yang sama. Jika Anda ingin bahasa khusus untuk halaman wiki Anda harus menambahkan nama halaman dengan kode bahasa dan titik dua (:) Sebagai contoh, tautan untuk versi jerman, Anda bisa menggunakan [[de:wiki-link]]

source: If you want to link to an article on Wikipedia, prefix the name of the article with “wikipedia:”. For example, [[wikipedia:article-name]]. If you want to link to a wikipedia article in another language, you can add the language code like this: [[wikipedia:de:article-name]].
id: Jika Anda ingin link yang ada di Wikipedia, tambahkan nama artikel dengan “wikipedia” sebagai contoh [[wikipedia:article-name]]. Jika Anda ingin link wikipedia di dalam bahasa yang berbeda Anda dapat menambahkan kode bahasa seperti ini : [[wikipedia:de:article-name]].

source: Finally, if you want to create an external link, simply type the URL and it will display as a link. If you want to change the link text, you can use one set of brackets to change the text which links to your URL [external-link link-text].
id: Terakhir, jika Anda ingin membuat link eksternal cukup dengan mengetik URL dan akan tampil sebagai link. Jika Anda ingin mengubah teks dengan kalimat yang lain Anda dapat menambahkan pemisah untuk mengubah teks dari link Anda URL [external-link link-text].

source: [[Map Features | different text but links to same]]
id: [[Map Features | teks berbeda tetapi menghubungkan halaman web yang sama]]

source: [[wikipedia:OpenStreetMap | different text]]
id: [[wikipedia:OpenStreetMap | teks berbeda]]

source: [http://fieldpapers.org | other text]
id: [http://fieldpapers.org | teks berbeda]

source: `other text <http://fieldpapers.org>`_
id: `teks lainnya <http://fieldpapers.org>`_

source: Tables
id: **Tabel**

source: Tables are probably the trickiest thing to create in a wiki, but easy once you understand how it works. First, you need to understand that a table is really a grid that has some number of rows and some number of columns, and one type of information is contained horizontally in rows and another type vertically in columns.
id: Tabel biasanya suatu yang agak sulit dibuat di wiki akan tetapi akan mudah jika Anda sudah mengerti dan memahami caranya. Pertama Anda harus mengerti bahwa tabel terdiri dari sejumlah kolom dan baris dan informasi yang disampaikan horizontal di dalam baris dan kolom.

source: A basic table needs the following parts:
id: Dalam membuat tabel dasar-dasar yang dibutuhkan yaitu:

source: A line with the first two characters '{\|' indicating the begin of a table.
id: Sebuah baris dengan dua karakter pertama yaitu '{\|' yang berarti akan memulai tabel

source: An optional line with the first two characters '\|+' for the caption of the table.
id: Baris pilihan dengan 2 karakter pertama yaitu '\|+' untuk judul dari tabel.

source: One or more table rows, beginning with '\|-' and usually no other content.
id: Satu atau lebih baris tabel dimulai dengan '\|-' dan tidak memiliki konten

source: After each table row one or more lines with table cells and their text/content. A table cell has as the first character a pipe symbol (\|) and the second character cannot be either plus (+) or minus (-) because these two are reserved for caption and table row respectively.
id: Setelah setiap baris terisi dari sel dan teksnya. Sel tabel tersusun dari karakter pertama yaitu simbol pipa (|) dan karakter kedua tidak dapat ditambahkan (+) atau (-) karena diganti dengan keterangan dan baris dari masing-masing kolom.

source: A line with the first two characters '\|}' indicating the end of a table.
id: Baris dengan dua karakter pertama '\|}' menunjukkan akhir dari tabel.

source: It is good practise and increases readability to use a space as the second/third character, thus avoiding any ambiguity.
id: Hal yang bagus untuk dipraktikan dan meningkatkan kemampuan untuk menggunakan sebuah jarak untuk karakter kedua/ketiga sehingga akan menghindari kebingungan.

source: **Example wiki source** ::
id: **Contoh wiki** ::

source: **Result**
id: **Hasil**

source: Play around with all these different techniques for formatting your wiki. To see an example of all of these things, take a look at the test page we created here: https://wiki.openstreetmap.org/wiki/User:MapJeff/testpage
id: Mempelajari berbagai teknik yang berbeda untuk memformat wiki Anda. Jika Anda ingin sebuah contoh dari semua contoh yang ada di atas Anda dapat melihat halaman tes yang saya buat disini : https://wiki.openstreetmap.org/wiki/User:MapJeff/testpage

source: Compare the wiki text to the way it is formatted when you are viewing it. Find more information on editing at http://wiki.openstreetmap.org/wiki/Help:Wiki-Editing.
id: Bandingkan teks wiki format Anda dengan teks yang ada di halaman saya. Anda dapat mencari informasi lainnya dalam mengedit di http://wiki.openstreetmap.org/wiki/Help:Wiki-Editing.

source: 5. Creating a new page
id: 5. Membuat halaman baru
