Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/osm/Chapter-05-editing-with-josm.po
Languages: id

source: The third and final step to complete our edits is to upload changes we have made to the OpenStreetMap database. To save the changes, you must be connected to the internet.
id: Langkah ketiga dan terakhir untuk menyelesaikan hasil editan adalah untuk mengupload perubahan yang telah kita buat di database OpenStreetMap. Untuk menyimpan perubahan, kita harus terkoneksi dengan internet.

source: 1. Click :guilabel:`File` on the top menu, and then click :guilabel: `Upload Data`. This will open up the upload window. You can access this window more simply by clicking on the :guilabel:`upload` button, shown here:
id: 1. Klik :guilabel:`File` di atas menu, dan kemudian klik :guilabel:`Perbaharui Data`. Hal ini akan membuka jendela upload. Anda dapat mengakses jendela ini dengan lebih cepat dengan mengklik tombol :guilabel:`upload`, seperti di bawah ini:

source: 2. The window that appears shows a list of the objects that you are adding and the objects you are modifying or deleting. In the box at the bottom you are asked to provide a comment about the changes that you are making. Type in here a brief description of your edits.
id: 2. Jendela yang muncul menunjukan daftar objek yang Anda telah tambahkan dan objek yang Anda modifikasi atau hapus. Pada kotak di bagian bawah Anda diminta untuk memberikan komentar mengenai perubahan yang telah Anda buat. Ketikkan disini sebuah deskripsi singkat dari editing Anda.

source: Click :guilabel:`Upload Changes`
id: Klik :guilabel:`Upload Perubahan`

source: Wait a few seconds for your changes to be uploaded, and then you are finished! You have edited OpenStreetMap!
id: Anda perlu menunggu beberapa detik untuk melihat perubahan Anda yang telah diupload, dan selesai! Anda telah mengedit di dalam OpenStreetMap.

source: 5.3.5 Save OSM File
id: 5.3.5 Menyimpan File OSM

source: When you edit using JOSM, you should download, edit and upload your changes at regular intervals. Do not be afraid to upload your changes several times during an editing session. This insures your changes upload to OSM database completely and you face less risk of losing your work. There are some cases where you have not finished your work, or your internet connection may be suddenly turned off. If that happens, you can save your work locally in JOSM. These are the steps to save your work:
id: Ketika Anda mengedit di JOSM, Anda sebaiknya mendownload, mengedit, dan mengupload perubahan dalam interval waktu yang tidak lama. Jangan takut untuk mengupload hasil edit Anda sesering mungkin. Hal ini memastikan bahwa perubahan Anda akan disimpan ke dalam database OSM dan tidak akan kehilangan hasil kerja Anda. Ada kasus dimana, Anda belum selesai mengerjakan pekerjaan Anda, atau koneksi internet Anda terputus. Jika hal itu terjadi, Anda dapat menyimpan pekerjaan Anda di komputer. Caranya adalah sebagai berikut :

source: 1. To save your OSM file, make sure your layer active. Click :menuselection:`File > Save`. Choose your location in your computer and give a name to your file. You also can save your file by click this button:
id: 1. Untuk menyimpan file OSM, pastikan bahwa itu adalah layer aktif. Klik :menuselection:`File > Simpan`. Pilih lokasi di komputer Anda untuk menyimpan file dan berilah nama. Anda juga dapat menyimpan dengan mengklik tombol ini:

source: You can close your JOSM and your works has been saved. When you want to open your file, open JOSM and go to :menuselection:`File > Open`.
id: Anda sekarang dapat menutup JOSM dan data Anda akan tersimpan. Ketika Anda ingin membuka file itu kembali, buka JOSM, kemudian pergilah ke menu :menuselection:`File > Buka`.

source: 5.3.6 See Your Changes on The Map
id: 5.3.6 Melihat Perubahan Anda di Peta

source: To see your edits on the map, take the following steps:
id: Untuk melihat perubahan Anda di peta, perhatikan langkah-langkah berikut:

source: Open your internet browser and go to `openstreetmap.org <http://openstreetmap.org/>`_
id: Buka browser internet Anda dan pergilah ke `openstreetmap.org <http://openstreetmap.org/>`_

source: Move the map to the area that you edited.
id: Geser peta ke area yang telah Anda edit.

source: You should see your changes now appearing on the map! If you don’t, try pressing :kbd:`CTRL+R` to refresh the web page. Sometimes the map doesn’t update properly and needs to be reloaded.
id: Anda seharusnya dapat melihat perubahan Anda yang akan muncul di peta! Jika tidak, coba me- nekan :kbd:`CTRL+R` untuk merefresh halaman situs. Biasanya peta tidak memperbarui dengan sempurna dan perlu dimuat ulang

source: What if you don’t see your changes? Don’t worry, it may take a few minutes for the changes to be shown on the map. Also, check your additions in JOSM to make sure that you added them correctly. A good general rule is, if your point has an icon in JOSM, then it should be seen on the main map at the OpenStreetMap website.
id: Bagaimana jika Anda tidak melihat perubahan? Jangan khawatir - mungkin diperlukan beberapa menit untuk perubahan yang akan ditampilkan pada peta. Kemudian, periksa penambahan Anda di JOSM untuk memastikan bahwa yang Anda tambahkan benar. Aturan umum yang baik adalah jika titik Anda memiliki ikon di JOSM, kemudian hal ini seharusnya terlihat di peta utama pada situs OpenStreetMap.

source: 5.4 JOSM Data Quality Assurance
id: 5.4 Penjaminan Kualitas Data di JOSM

source: Contributing to OpenStreetMap is easy to learn, but difficult to master. Everybody makes mistakes, but the system works because even when one person does something the “wrong” way, there are always other mappers ready to help and fix errors. As you map more and more, the process will continue to get easier, and you will learn the “proper” way to do things. This chapter is devoted to helping you make quality contributions to OpenStreetMap. We will begin by discussing various editing techniques in JOSM that will improve your workflow, and how to avoid common mistakes that beginning mappers make. Lastly, we will then discuss the JOSM validator tool, which is an automated way of checking for errors.
id: Berkontribusi di Openstreetmap merupakan hal yang mudah untuk dipelajari, namun sulit untuk dikuasai. Setiap orang dapat melakukan kesalahan, akan tetapi selalu ada orang lain yang siap membantu untuk menyelesaikan kesalahan tersebut. Seiring Anda melakukan pemetaan secara terus menerus, hal tersebut akan menjadi lebih mudah dan Anda akan mengerti cara yang tepat untuk melakukan pemetaan. Bab ini ditujukan untuk membantu Anda memberikan kontribusi yang lebih baik. Kita akan memulai dari mendiskusikan berbagai macam teknik mengedit di JOSM yang akan membuat Anda bekerja lebih baik dan mengerti kesalahan umum yang sering dibuat pada awal pemetaan. Kita akan mendiskusikan alat validasi JOSM dimana merupakan cara otomatis untuk mengecek kesalahan.

source: 5.4.1 Warnings and Errors in JOSM
id: 5.4.1 Peringatan dan Kesalahan di JOSM

source: There is a stage when you upload your work to OpenStreetMap when you get a window notification as in the figure below:
id: Ada kalanya ketika Anda ingin upload hasil kerja Anda ke OpenStreetMap, ketika Anda mendapatkan sebuah jendela pemberitahuan seperti dibawah ini:

source: This is the way JOSM tells us that something is wrong with our data and it needs to be fixed before we upload it to the server.
id: Ini adalah cara JOSM memberitahu kita bahwa data tersebut ada yang salah dan harus diperbaiki sebelum mengupload ke server OSM.

source: JOSM comes with a :guilabel:`validation` tool that does an automated analysis of possible mistakes. This is useful for finding errors that you may have overlooked. When you run the validation tool, it returns two types of problems:
id: JOSM hadir dengan alat :guilabel:`validasi` yang berfungsi untuk menganalisis secara otomatis kesalahan yang ada. Hal ini sangat membantu untuk menemukan kesalahan yang tidak terlihat oleh Anda. Ketika Anda menjalankan alat validasi ini, alat ini akan menghasilkan dua jenis masalah:

source: **Errors**: These are important to fix, and you should not ignore these. Examples of errors include duplicated objects or overlapping lines and polygons.
id: **Kesalahan**: Hal ini penting untuk diperbaiki, dan Anda seharusnya tidak mengabaikannya. Sebagai contoh dari kesalahan ini adalah objek yang terduplikasi atau garis dan poligon yang saling bertumpang tindih.

source: **Warning:** These are problems that are important to fix, but in some cases, they are tolerable.
id: **Peringatan**: Kesalahan yang penting untuk diperbaiki, namun pada beberapa kasus hal tersebut bisa ditoleransi.

source: One thing to note is that if you download a large area of the map and run the validation tool, you may get a very long list of errors and warnings. This is because the validation tool works on the whole map in your editing extents, --not only the changes that you have made. So you may see mistakes that other mappers have made which you are free to fix or ignore. But the validation tool gives you the opportunity to look at the mistakes one by one and evaluate them.
id: Satu hal yang perlu diperhatikan jika Anda mendownload area yang besar dan menjalankan alat validasi, Anda mungkin akan mendapatkan daftar kesalahan dan peringatan yang sangat panjang. Hal ini dikarenakan alat validasi ini bekerja pada seluruh peta, tidak hanya perubahan yang telah Anda buat. Sehingga Anda mungkin akan melihat kesalahan yang dibuat oleh orang lain dan Anda bisa memperbaikinya atau menghiraukannya. Akan tetapi alat validasi memberikan Anda kesempatan untuk melihat kesalahan satu persatu.

source: 5.4.2 Validation Tool
id: 5.4.2 Menggunakan Alat Validasi

source: Let’s learn how to use validation tool.
id: Mari kita lihat bagaimana cara menggunakan alat validasi

source: Download some area in JOSM. If you do not see :guilabel:`Validation Result` at **right side panel** in your window, tick on the **blue checklist** icon from the left panel in your JOSM window as circled in the figure below.
id: Pada JOSM, download satu daerah pada peta. Jika Anda tidak melihat :guilabel:`Hasil Validasi` pada jendela di **panel bagian kanan**, klik pada ikon **tanda centang berwarna biru** pada bagian kiri di jendela JOSM Anda seperti gambar dibawah ini.

source: *Validation Result Button*
id: *Posisi tombol Validasi*

source: **Ensure that nothing on the map is selected**. If you run the validation tool with anything selected, it will only validate what you have selected, and not the whole map. However your mouse in the validation window and click :guilabel:`Validation`
id: Pastikan bahwa tidak ada bagian pada peta yang dipilih. Jika Anda menjalankan alat validasi dengan sesuatu yang dipilih, hal tersebut hanya akan memvalidasi daerah yang Anda pilih, dan tidak seluruh peta. Arahkan mouse Anda pada jendela validasi dan klik :guilabel:`Validasi`

source: The map will change and any warnings will be circled in yellow, errors in red. In the :guilabel:`Validation Results` window, as shown in the figure below, you will see a list of warnings and errors, if there are any.
id: Peta tersebut akan berubah dan segala macam Peringatan akan terlihat berwarna kuning dan un- tuk kesalahan berwarna merah. Pada jendela :guilabel:`Hasil Validasi` Anda akan melihat daftar peringatan dan kesalahan, jika ada.

source: *Validation Layer and Validation Result*
id: *Layer Validasi dan Hasil Validasi*

source: **Error** should almost always be fixed. You can zoom to an error, by right clicking on it in the window and selecting :guilabel:`Zoom to Problem`. Then you can fix the mistake manually.
id: **Kesalahan** harus seluruhnya diperbaiki. Anda dapat memperbesar di daerah yang terdapat kesalahan dengan cara klik kanan pada kesalahan di jendela tersebut dan kemudian pilihlah :guilabel:`Zoom to Problem`. Setelah itu Anda bisa memperbaiki kesalahan tersebut secara manual.

source: 5. **Some errors can be automatically fixed**, such as **Duplicated node** errors. You can click on the folder for these types of errors and click the :guilabel:`Fix` button in the window. Many errors, however, need to be corrected manually.
id: 5. **Beberapa kesalahan dapat diperbaiki secara otomatis**, seperti kesalahan **Titik yang terduplikasi**. Anda dapat melihat pada folder untuk beberapa tipe kesalahan dan memilih tombol :guilabel:`Perbaiki` pada jendela tersebut. Beberapa kesalahan membutuhkan untuk diperiksa secara manual.

source: Usually there are many more warnings than errors. By giving you a warning, JOSM is telling you that it is probably a mistake, but not always. So you will need to use your judgement to see if it is an error or not.
id: Biasanya terdapat lebih banyak Peringatan daripada Kesalahan. Dengan memberikan peringatan, JOSM memberitahukan Anda bahwa hal tersebut kemungkinan kesalahan, tapi tidak selalu. Sehingga Anda akan menggunakan keputusan anda untuk melihat apakah hal tersebut merupakan benar kesalahan atau tidak.

source: If you select a warning from the list and decide that it is not a problem, click :guilabel:`Ignore` and it will be removed from the list.
id: Jika Anda memilih salah satu warning dari daftar dan memutuskan bahwa hal tersebut bukanlah masalah, klik :guilabel:`abaikan` dan warning tersebut akan di hapus dari daftar.

source: You can re-run the validation tool at any time by clicking :guilabel:`Validation`.
id: Anda dapat menjalankan ulang alat validasi sewaktu-waktu dengan mengklik :guilabel:`Validasi`.

source: Summary
id: Ringkasan

source: Awesome! You have successfully learned how to edit OpenStreetMap in JOSM and how to maximize some tools in JOSM to help us in editing our map. You also know about mistakes and errors that should be avoided when editing in JOSM.
id: Luar Biasa! Anda telah berhasil mempelajari bagaimana tahapan-tahapan yang tepat dalam mengedit peta OpenStreetMap di JOSM dan juga bagaimana kita bisa memaksimalkan beberapa alat yang ada di JOSM untuk membantu kita dalam melakukan editing peta kita. Anda juga mengetahui beberapa kesalahan-kesalahan yang harus kita hindari ketika melakukan editing di JOSM.

source: In next chapter, we will learn how to use **Global Positioning System** (GPS) to collect data when doing a field survey and how to add it to OpenStreetMap.
id: Pada sesi selanjutnya kita akan belajar bagaimana menggunakan **Global Positioning System** (GPS) untuk mengumpulkan data di lapangan ketika melakukan survey lapangan dan bagaimana menambahkannya ke dalam OpenStreetMap

source: :ref:`Go to next chapter --> <ch6-using-gps>`
id: :ref:`bab selanjutnya --> <ch6-using-gps>`
