Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/osm/Chapter-01-introduction.po
Languages: id

source: Chapter 1: Introduction
id: Bab 1: Pengantar

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Understanding OpenStreetMap
id: Memahami OpenStreetMap

source: Understanding Data Collection Purposes
id: Memahami Tujuan Pengumpulan Data

source: Information is important. With good information and the right understanding, individuals and communities are better able to improve their lives and make good decisions about the future. There are many people and organizations who make decisions that affect our lives. Good information allows these NGO’s (non-government organisations), governments and communities to make better decisions, and hopefully make our lives better.
id: Informasi sangat penting. Dengan informasi yang baik dan benar pengertiannya, individu dan komunitas dapat lebih baik untuk memperbaiki hidup mereka dan membuat keputusan yang tepat di masa depan. Banyak orang dan organisasi yang membuat keputusan yang dapat mempengaruhi kehidupan kita. Informasi yang baik memungkinkan LSM (organisasi non-pemerintah), pemerintah dan masyarakat untuk membuat keputusan yang lebih baik, dan semoga membuat hidup kita lebih baik.

source: *Satellite Imagery*
id: *Citra Satelit*

source: Maps are a good way to deliver information. Maps are visual symbols ofour world. They can often demonstrate an idea better than words. This in turn can help us answer important questions. Where is the closest school or hospital? Who has the least access to these facilities? Where is poverty the most problematic? Questions like these can often best be expressed with maps, and maps can help find solutions to these questions.
id: Peta dapat digunakan dengan baik untuk menyampaikan informasi. Peta merupakan gambaran visual dari dunia kita. Mereka sering dapat mendemonstrasikan sebuah ide lebih baik daripada kata-kata. Ini juga dapat membantu untuk menjawab pertanyaan penting. Dimana sekolah atau rumah sakit? Siapa yang memiliki sedikit akses untuk fasilitas tersebut? Dimanakah lokasi kemiskinan yang paling bermasalah? Pertanyaan seperti ini paling baik diekspresikan dengan peta, dan peta dapat membantu untuk mencari solusi dari pertanyaan-pertanyaan tersebut.

source: As an exercise, get a pen and paper and draw a map of your town or village. What are the most important things to include on the map? What is the most important information? Spend a few minutes making your map, and when you’re finished, think about why the information you included is important, and who it might be important to.
id: Sebagai sebuah latihan, ambil sebuah alat tulis dan secarik kertas dan gambarlah sebuah peta dari kota atau desa tempat tinggal Anda. Hal apakah yang paling penting untuk dimasukkan pada peta? Informasi apakah yang paling penting? Berikan waktu selama beberapa menit untuk membuat peta Anda, dan ketika Anda telah selesai, pikirkan tentang kenapa informasi yang Anda masukkan ke dalam peta sangat penting, dan siapa saja yang berkepentingan untuk informasi tersebut.

source: *Example of Paper Map*
id: *Contoh Peta Kertas*

source: If your town is like most, you may have drawn some lines to represent roads, possibly a river or stream. Perhaps you added important buildings such as schools and offices, fields, or boundaries. Whatever you drew, you probably used symbols – a line to symbolize a road, a square to symbolize a building, and so on. Your map is a representation of what is on the ground.
id: Jika Anda lebih banyak menggambarkan tentang kota Anda, mungkin Anda menggambarkan beberapa garis untuk merepresentasikan jalanan, atau mungkin juga sebuah aliran sungai. Mungkin Anda juga telah menambahkan bangunan-bangunan penting seperti sekolah dan kantor, lapangan, atau batas wilayah. Apapun yang Anda gambarkan, Anda kemungkinan menggunakan simbol sebuah garis untuk menyimbolkan jalan, sebuah persegi untuk menyimbolkan bangunan, dan seterusnya. Peta Anda merupakan sebuah representasi dari apa yang ada di permukaan bumi.

source: *Example of Symbols that be used in Map*
id: *Contoh Simbol yang digunakan di Peta*

source: Your map is informative. You might use a map like this to explain to someone where different places are, where problems are in your community, or merely to help someone find their way around. The use of your map is limited though - there is only one copy of the map. The way you drew it may make sense to you, but perhaps not to someone else who would have drawn their own map in a different way. Because your map is merely on paper, it is difficult to get that information to others. This is why making your map on a computer, in such a way that anyone can access it, can be much more valuable.
id: Peta Anda bersifat informatif. Anda mungkin akan menggunakan peta seperti ini untuk menjelaskan kepada seseorang dimana tempat-tempat berbeda berada, dimana permasalahan yang terdapat dalam komunitas Anda, atau lebih tepatnya untuk membantu seseorang menemukan tempat tujuannya. Namun, kegunaan peta Anda ini terbatas - Dimana hanya terdapat satu buah salinan dari peta. Dari cara Anda menggambarkannya mungkin Anda memahami isinya, tetapi tidak bagi orang lain yang menggambarkan peta tersebut dengan cara yang berbeda. Karena peta Anda ini digambarkan hanya pada secarik kertas, sangat sulit untuk menyampaikan informasi ini ke orang lain. Inilah mengapa Anda membuat peta pada sebuah komputer, dengan cara seperti itu semua orang dapat mengakses peta tersebut dan membuatnya lebih berharga.

source: *Digital Map*
id: *Peta Digital*

source: OpenStreetMap is a tool for creating and sharing map information. Anyone can contribute to OSM, and thousands of people add to the project every day. Users draw maps on computers, rather than paper, but as we will see in this guide, drawing a map on a computer is not all that different from drawing on paper. We still draw lines to represent roads, fields and anything else and we still represent schools and hospitals with symbols. The important thing is that OSM maps are saved on the internet, and anyone can access them at any time. Most importantly, the data are free.
id: OpenStreetMap adalah sebuah alat untuk membuat dan berbagi informasi dalam bentuk peta. Siapapun dapat berkontribusi untuk OSM, dan ribuan orang menambahkan proyek setiap harinya. Para pengguna menggambarkan peta pada komputer, dibandingkan dengan kertas, tetapi kita akan melihat pada panduan ini, menggambar sebuah peta pada sebuah komputer tidak jauh berbeda dengan menggambar peta pata secarik kertas. Kita masih menggambarkan garis untuk merepresentasikan jalan, lapangan, dan lain-lain, dan kita masih merepresentasikan sekolah dan rumah sakit dengan simbol. Hal yang paling penting adalah peta OSM disimpan di dalam internet, dan siapapun dapat mengakses peta tersebut kapanpun, gratis.

source: We hope that you will find OpenStreetMap useful and interesting in your work and activities. By following this guide, you should be able to quickly learn start making digital maps with OpenStreetMap.
id: Kami berharap bahwa Anda akan menemukan OpenStreetMap yang berguna dan menarik dalam pekerjaan dan kegiatan Anda. Dengan mengikuti panduan ini, Anda dapat belajar dengan mulai membuat peta digital dengan OpenStreetMap.

source: :ref:`Go to next chapter --> <ch2-getting-started>`
id: :ref:`Bab selanjutnya --> <ch2-getting-started>`
