Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/osm/Chapter-03-introducing-the-*-editor.po
Languages: id

source: Chapter 3: Introducing the iD Editor
id: Bab 3: iD Editor

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Understanding iD Editor interface
id: Mengetahui tampilan antar muka iD Editor

source: Editing OpenStreetMap using the iD Editor
id: Mengedit OpenStreetMap dengan iD Editor

source: Saving and Uploading edits
id: Menyimpan dan mengupload hasil editing

source: You have succeeded on creating OpenStreetMap account and you’re eligible to edit OpenStreetMap. Now we will learn how to add your data and edit it using an editor that runs in the browser called the iD Editor.
id: Anda telah berhasil membuat akun OpenStreetMap dan Anda sudah dapat mengedit OpenStreetMap. Sekarang kita akan belajar menambahkan data dan mengedit menggunakan sebuah editor yang berjalan di browser yang dinamakan iD Editor

source: iD Editor is a web based OpenStreetMap editor that allows you to add and make changes to the OpenStreetMap data easily and fast by using spatial data sources such as satelite imagerY, GPS, and FiledPapers.
id: iD Editor merupakan sebuah editor OpenStreetMap berbasis web yang berguna untuk menambahkan atau mengubah data dalam OpenStreetMap dengan mudah dan cepat dengan menggunakan sumber-sumber data spatial seperti citra satelit, GPS, dan FieldPapers.

source: 3.1 STARTING ID EDITOR
id: 3.1 Memulai iD Editor

source: Before you start, your computer must be connected to the internet. Open your browser, then go to OpenStreetMap website `http://www.openstreetmap.org <http://www.openstreetmap.org>`_ , :guilabel:`log in` to your account and :guilabel:`zoom in` to the area that you want to edit until the Edit menu is active. Click on the :guilabel:`arrow sign` next to the :menuselection:`Edit ‣ Edit with iD (in-browser editor)` as shown in the figure below.
id: Sebelum Anda mulai, komputer Anda harus terhubung dengan internet. Buka browser internet Anda, kemudian buka situs OpenStreetMap `http://www.openstreetmap.org <http://www.openstreetmap.org>`_ , kemudian :guilabel:`Masuk` dengan akun OpenStreetMap dan :guilabel:`zoom in` pada area yang ingin Anda edit sampai Menu Edit aktif. Klik pada tanda panah kemudian klik :menuselection:`Edit ‣ Edit with iD (in-browser editor)` seperti ditunjukkan gambar dibawah ini.

source: *Activating iD Editor on OpenStreetMap website*
id: *Mengaktifkan iD Editor di Situs OpenStreetMap*

source: 3.2 iD Editor Interface
id: 3.2 Tampilan Antar Muka iD Editor

source: The figure below shows the main features of the iD editor.
id: Gambar di bawah ini menunjukkan fitur utama dari iD Editor.

source: *iD Editor Interface*
id: *Tampilan iD Editor*

source: **Feature Panel**: This panel will show the attributes of an object selected from the map. You can add and edit attribute data from this panel.
id: **Panel Fitur**: Panel ini akan menampilkan atribut dari suatu objek yang menandakan objek tersebut pada peta. Anda dapat menambahkan dan mengedit data atribut dari panel ini.

source: **Panel tools**: This Panel shows some basic editing functions, such as:
id: **Panel tools**: Panel ini menampilkan beberapa fungsi dasar untuk mengedit peta, yaitu sebagai berikut:

source: Adding a point
id: Menambahkan titik

source: Adding lines
id: Menambahkan garis

source: Adding an area (polygon)
id: Menggambar bentuk area (poligon)

source: Undo
id: Membatalkan pilihan

source: Redo
id: Memajukan pilihan

source: Saving your changes
id: Menyimpan perubahan

source: **Map Panel**: This panel shows some functions to set and alter the map display
id: **Panel Peta**: Panel ini menampilkan beberapa fungsi untuk mengatur tampilan peta

source: Zoom In
id: Perbesar

source: Zoom Out
id: Perkecil

source: Go to your current location
id: Menuju lokasi saat ini

source: Set the map background
id: Mengatur tampilan latar belakang peta

source: Getting Help
id: Mendapatkan bantuan

source: **Information panel**: At the very bottom of the image area, this panel shows some information such as those who have contributed map edits in this area, as well as attribution for imagery sources and other map data.
id: **Panel keterangan**: Terletak di paling bawah pada peta Anda, panel ini menampilkan beberapa keterangan siapa saja yang pernah berkontribusi mengedit pada area tersebut.

source: 3.3 Setting the Map Background
id: 3.3 Mengatur Tampilan Latar Belakang Peta

source: Before you start editing, you can change the map background. Now click on the :guilabel:`layer button`
id: Sebelum memulai mengedit, Anda dapat mengubah latar belakang tampilan peta. Klik tombol :guilabel:`Pengaturan Latar Belakang`

source: Then a new panel will pop up like this:
id: Kemudian akan muncul panel baru seperti di bawah ini:

source: *Background and brightness setting in iD Editor*
id: *Pengaturan latar belakang dan tingkat kecerahan di iD Editor*

source: There are several ways to adjust the background in iD Editor. They are:
id: Ada beberapa langkah untuk pengaturan latar belakang di iD Editor, sebagai berikut:

source: You can set the brightness of the satellite imagery by clicking on this box
id: Anda dapat mengatur tingkat kecerahan citra satelit dengan mengklik salah satu kotak seperti ini

source: There are 3 brightness you can choose: 100%, 50%, and 0%. Try all of them to see the difference.
id: terdapat 3 tingkat kecerahan yang dapat dipilih: 100%, 50%, dan 0%. Cobalah ketiganya untuk mengetahui perbedaannya.

source: You can also set the provider of satellite imagery depending on which one is available for your desired area (the standard choice is Bing Aerial Imagery). You can also set OpenStreetMap map as your background.
id: Anda juga dapat mengatur tampilan latar belakang citra satelit sesuai dengan yang tersedia untuk wilayah Anda (pilihan standar adalah Bing Aerial Imagery). Anda dapat juga menampilkan peta OpenStreetMap sebagai tampilan latar belakang.

source: Also, if you want to make a previously uploaded Field Papers to be your background, please click on the :guilabel:`Custom` choice and put the FieldPapers URL (for example: *http://fieldpapers.org/snapshot.php?id=fdsbgzns#17/-6.20049/106.82533*) on the column as seen below:
id: Juga, jika Anda ingin menampilkan latar belakang dengan tampilan Fieldpapers yang sudah diupload, silahkan klik pada :guilabel:`Custom` dan masukkan alamat FieldPapers (sebagai contoh:*http://fieldpapers.org/snapshot.php?id=fdsbgzns#17/-6.20049/106.82533*) pada kolom yang muncul seperti pada gambar dibawah ini:

source: *Inserting Field Papers into iD Editor*
id: *Memasukkan Field Papers ke dalam iD Editor*

source: You can add your GPS tracks and waypoints that are saved on your computer (they must be in GPX file format). Just click on your :guilabel:`GPX`, hold, and drag it to the editor page.
id: Anda juga dapat menambahkan track dan waypoint GPS yang tersimpan dalam komputer Anda (format GPX). Caranya klik pada :guilabel:`GPX`, tahan, kemudian geser ke halaman editor.

source: If there is a known satellite imagery offset, you can do a correction by clicking on :guilabel:`Fix misalignment` until a box seen below shows up:
id: Jika terdapat pergeseran citra satelit, Anda dapat melakukan koreksi dengan cara klik :guilabel:`Fix misalignment` hingga keluar tampilan kotak seperti ini:

source: You can set the correction by clicking on the :guilabel:`navigation buttons`
id: Anda dapat mengatur koreksinya dengan klik :guilabel:`tombol navigasi`

source: Click on
id: Klik untuk

source: to bring the imagery back to the initial position.
id: mengembalikan posisinya seperti semula.

source: 3.4 BASIC EDITING WITH ID EDITOR
id: 3.4 Editing Dasar dengan iD Editor

source: Before we start practicing using iD Editor, first navigate to the desired area on the map that you want to edit. You can pan around the map by clicking on your mouse and dragging the map to your area of interest.
id: Sebelum kita memulai praktik dengan iD Editor, pertama arahkan ke wilayah yang ingin Anda edit. Anda dapat menggeser tampilan Anda dengan menahan tombol kiri pada mouse sambil menggeser ke arah yang diinginkan.

source: Adding a Point
id: Menambahkan Titik

source: To add a point feature, click on
id: Untuk menambahkan sebuah fitur titik, klik pada

source: You will see the cursor change into a plus sign **(+)**. Now, click on the object that you want to map. For example, you see a building on the map and you know that building is a hospital. Click on the building.
id: Anda akan melihat tampilan kursor berubah menjadi tanda **(+)**. Sekarang, klik pada posisi yang Anda ketahui. Misalnya, Anda melihat sebuah bangunan pada peta dan Anda mengetahui bangunan tersebut adalah sebuah Rumah Sakit. Klik pada bangunan tersebut.

source: *Adding a point in iD Editor*
id: *Menambahkan titik di iD Editor*

source: Now, you can see there’s a new point. At the same time, the feature panel will be showing you attributes that you can choose depending on the object type. Now type **Hospital** on the Search section, and choose **Hospital** to add this feature to the map, as shown in the figure below.
id: Sekarang, perhatikan bahwa Anda akan mendapati sebuah titik baru. Dan pada saat yang bersamaan, panel fitur akan memunculkan atribut-atribut pilihan yang dapat Anda gunakan untuk menandakan tipe objek. Sekarang, ketikkan **Hospital** pada kotak pencarian, dan pilih **Hospital** untuk menambahkan fitur ke peta, seperti ditunjukkan pada gambar di bawah ini.

source: *Adding information to a point in iD Editor*
id: *Menambahkan informasi titik di iD Editor*

source: The point symbol will change automatically, and the feature panel will change into a form which can be filled with information about the hospital, such as the name of the hospital, the address, and other information about this feature.
id: Simbol titik Anda berubah secara otomatis, dan panel fitur akan berubah menjadi sebuah formulir isian dengan informasi mengenai rumah sakit, seperti nama rumah sakit, alamat lengkap sebagai informasi tambahan mengenai objek tersebut.

source: Features may have a different forms - points, lines, or polygons. It will depends on the type of the feature, the mapping scale, and the quality of imagery.
id: Setiap fitur akan memiliki formulir yang berbeda - titik, garis, atau poligon. Formulir tersebut tergantung dari jenis fiturnya, skala peta, dan kualitas dari citra satelit.

source: If you want to move the location of that point, you can click on the object then hold it and move it to the new location. If you want to delete the object, click on the object, a delete button will show up.
id: Jika Anda ingin menggeser posisi titik, klik dan tahan pada titik tersebut kemudian geser ke lokasi yang baru. Jika Anda ingin menghapus titik tersebut, klik pada titik yang ingin dihapus, sehingga akan keluar tombol seperti di bawah ini.

source: Click on that button to delete the object.
id: Klik tombol tersebut untuk menghapus objek.

source: Adding a Line
id: Menambahkan Garis

source: Click on:
id: Klik pada:

source: And again you will see the cursor change into a plus sign **(+)**. Suppose you want to draw a road. To do this, first click at one of the ends of the road, then just move your cursor to and keep clicking along the way of the roads and follow it until a road line formed. Double click to end the line and the feature panel will appear again on the left side of the window.
id: kemudian Anda akan melihat tampilan kursor berubah menjadi tanda plus **(+)**. Misalnya Anda akan menggambar sebuah jalan , maka pertama klik kiri pada salah satu ujung jalan, kemudian tarik hingga membentuk sebuah garis. Klik dua kali untuk mengakhiri garis dan panel fitur akan muncul pada sebelah kiri Anda.

source: *Adding lines in iD Editor*
id: *Menambahkan garis di iD Editor*

source: The feature panel will display some attributes for you to choose from, depending on the type of your line. You can also move the points in the line by clicking on a point and move it. The other thing you can do is move the line by clicking on it, holding down the mouse button, and moving the line. Also, when you click on a point (vertex) on the line, you will find some additional functions as shown in the figure below:
id: Panel fitur akan memunculkan beberapa atribut-atribut pilihan yang dapat Anda gunakan untuk menandakan garis yang Anda pilih. Anda dapat menggeser titik dari garis dengan cara klik dan tahan mouse pada satu titik dan menggesernya. Anda juga dapat menggeser garis tersebut dari posisi sebelumnya dengan cara menahan tombol kiri mouse pada garis dan menggesernya. Ketika Anda mengklik sebuah titik (vertex) dari garis, Anda akan menembukan fungsi-fungsi tambahan sebagai berikut:

source: Deleting/removing the point from the line
id: Menghapus titik dari garis

source: Separating a point that is attached to other object.
id: Memisahkan titik yang menempel pada objek lain

source: Spliting a line into two different parts. It is useful when there are different attributes in a long line (For example, different road names)
id: Membagi satu garis menjadi dua bagian. Berguna jika dalam satu garis lurus terdapat perbedaan atribut (misal nama jalan yang berbeda)

source: Also, when you click on the line (in between points), you will find additional functionality as shown in the figure below:
id: Ketika Anda mengklik sebuah garis (diantara titik), Anda akan menemukan fungsi tambahan sebagai berikut:

source: Removing the line
id: Menghapus garis

source: Forming the line into a circle
id: Membentuk garis menjadi sebuah lingkaran

source: Moving the line position
id: Memindahkan posisi garis

source: Creating the angles of the line into right-angled line
id: Membuat sudut garis menjadi siku-siku

source: Reversing the line direction
id: Memutarbalikkan arah garis

source: Adding an Area (Polygon)
id: Menambahkan Area (Poligon)

source: To add an area, or polygon feature, click on the button below:
id: Untuk menambahkan sebuah area, atau fitur poligon, klik pada gambar seperti di bawah ini:

source: Again the cursor will change to a plus sign **(+)**. Using the imagery as a guide, trace the area by clicking on the corners of the feature, as shown in the figure below.
id: Kemudian kursor akan berubah menjadi tanda plus **(+)**. Gunakan citra satelit sebagai panduan, gambar area dengan klik pada sudut fitur, seperti ditunjukkan gambar dibawah ini.

source: *Adding area/polygon in iD Editor*
id: *Menambahkan area/poligon di iD Editor*

source: As with point and line features, when you click on one of the point on the polygon, you will see additional editing functionality. Similarly, clicking on the line of the polygon (between points) will reveal additional editing operations available to you.
id: Sama seperti titik dan garis, ketika Anda mengklik salah satu titik dalam poligon, Anda akan mendapatkan fungsi tambahan. Begitu pula ketika Anda mengklik garis dari poligon (diantara titik) akan Demikian pula, klik garis pada poligon (antara titik) akan muncul menu pengeditan tambahan yang tersedia untuk Anda.

source: 3.5 Saving your Changes
id: 3.5 Menyimpan Perubahan Anda

source: Click on the button below:
id: Klik pada tombol di bawah ini:

source: to save your changes. Pay attention to the panel on your left side that will show something like this:
id: untuk menyimpan perubahan Anda. Kemudian perhatikan panel di sebelah kiri Anda, akan berubah seperti pada gambar di bawah ini:

source: *Saving your changes in iD Editor*
id: *Menyimpan perubahan di iD Editor*

source: Fill in the :guilabel:`Comment column` with a brief note about the changes made in that area so that other users can note your edits. Then click :guilabel:`Save`.
id: Isilah komentar pada :guilabel:`Commit message` dengan catatan singkat mengenai perubahan area yang Anda edit atau tambahkan agar pengguna lain mengetahuinya. Kemudian klik :guilabel:`Simpan`.

source: 3.6 Additional Attributes
id: 3.6 Atribut Tambahan

source: When you add attributes to features, you can make the data more useful by adding more information. The icons shown in the figure below help you to add additional details to your map data:
id: Pada saat Anda menentukan atribut fitur, Anda dapat membuat data yang lebih bermanfaat dengan menambahkan informasi tambahan. Dengan ikon-ikon yang akan muncul seperti dibawah ini dapat membantu Anda dalam menambahkan rincian tambahan di data peta Anda:

source: Adding elevation information
id: Menambahkan informasi ketinggian

source: Adding notes
id: Menambahkan catatan

source: Adding contacts/phone number
id: Menambahkan kontak/nomor telepon

source: Adding sources
id: Menambahkan sumber

source: Adding website information
id: Menambahkan informasi situs

source: Add information on the availability of accessibility for people with disabilities
id: Menambahkan informasi pada ketersediaan aksesibilitas untuk penyandang cacat

source: Adding Wikipedia links
id: Menambahkan tautan Wikipedia

source: **Tags list on iD Editor**
id: *Daftar tag di iD Editor*

source: In addition, you can also add your own attributes by clicking on the icon
id: Selain itu, Anda dapat menambahkan atribut sendiri dengan mengklik pada ikon

source: This will raise a form allowing you to add your own attributes:
id: Ini akan muncul formulir yang memungkinankan Anda untuk menambahkan atrribut Anda sendiri:

source: Click on the :guilabel:`+` sign to add a key and value that you want. For guidance, consult the full list for key/value pairs here: `Wiki OpenStreetMap Map Features <http://wiki.openstreetmap.org/wiki/Map_Features>`__\
id: Klik tanda :guilabel:`+` untuk menambahkan key dan value yang Anda inginkan. Daftar lengkap key dan value dapat dilihat di `Wiki OpenStreetMap Map Features <http://wiki.openstreetmap.org/wiki/Map_Features>`__\

source: *Adding a tag in iD Editor*
id: *Mengisi salah satu tag iD Editor*

source: Summary
id: Ringkasan

source: You should now be able to add your data to OpenStreetMap using the in-browser iD Editor. You also learned how to digitize the 3 types of objects in OpenStreetMap: points, lines, and areas (polygons). In the next chapter, we will learn about another editor, the Java OpenStreetMap editor, or JOSM as it is popularly known.
id: Sekarang Anda sudah bisa menambahkan data-data Anda ke dalam OpenStreetMap menggunakan browser iD Editor. Anda juga sudah mempelajari bagaimana mendigitasi 3 tipe objek di OpenStreetMap: titik, garis, dan area (poligon). Pada materi selanjutnya, kita akan mempelajari tentang editor yang lain, yaitu Java OpenStreetMap atau yang lebih dikenal dengan JOSM.

source: :ref:`Go to next chapter --> <ch4-getting-started-with-josm>`
id: :ref:`Bab selanjutnya --> <ch4-getting-started-with-josm>`
