Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/osm/Chapter-10-imagery-offset.po
Languages: id

source: Chapter 10: Imagery Offset
id: Bab 10: Pergeseran Citra Satelit

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Understanding definition of Imagery Offset
id: Memahami pengertian pergeseran citra satelit

source: How to adjust the Imagery Offset
id: Bagaimana menyesuaikan pergeseran citra satelit

source: 10.1 Overview of Imagery Offset
id: 10.1 Ulasan Singkat Pergeseran Citra Satelit

source: Using aerial imagery is the most widely used approach to mapping in OpenStreetMap. Mappers typically use Bing Satellite, or imagery from another provider as a background layer while mapping. We have already seen this in previous sections.
id: Menggunakan citra satelit merupakan pendekatan yang paling sering digunakan dalam membuat peta di OpenStreetMap. Pembuat peta biasanya menggunakan citra satelit Bing atau citra satelit dari penyedia yang lain sebagai latar belakang ketika membuat peta. Kita sudah mempelajari ini pada bab sebelumnya.

source: Imagery providers usually do a pretty good job of georeferencing their imagery, but occasionally the images can be out of position. This is particularly true in hilly or mountainous areas, where it can be difficult to stretch a flat image over an area of the Earth with many contours. When you load imagery in JOSM, it can sometimes be ten meters or more from its true position. This is called imagery offset.
id: Penyedia layanan citra satelit biasanya telah melakukan georeferensi citra satelit mereka, tetapi terdapat beberapa citra satelit yang posisinya tidak sesuai. Ini biasanya terjadi di daerah berbukit atau pegunungan, dimana ini sulit untuk menarik gambar datar sesuai permukaan Bumi yang memiliki kontur. Ketika Anda memuat citra satelit di JOSM, terkadang mengalami pergeseran sejauh sepuluh meter atau lebih dari posisi sebenarnya. Ini yang dinamakan pergeseran citra satelit.

source: We’ve learned about two major ways of making maps – one is by utilizing aerial imagery to identify features on the ground, and another is by using GPS to record tracks and waypoints and then add them to OpenStreetMap. The advantages of aerial imagery is obvious. It is easier for you to see the whole picture, to observe various details from the image, consider your knowledge of the area, and easily trace roads, buildings, and areas.
id: Kita telah mempelajari tentang dua cara untuk membuat peta – pertama dengan menggunakan citra satelit untuk mengidentifikasi kenampakan di permukaan Bumi, dan salah satunya menggunakan GPS untuk merekam trek dan *waypoint* dan kemudian ditambahkan ke OpenStreetMap. Banyak sekali keuntungan dalam penggunaan citra satelit. Ini akan memudahkan Anda melihat gambar secara keseluruhan, untuk mengamati berbagai detail dari gambar tersebut, Anda mendapatkan pengetahuan tentang area tersebut, dan memudahkan kita dalam menggambar jalan, bangunan, dan area.

source: One key advantage of GPS, is that it doesn’t suffer from offset like imagery. A GPS will always provide you with a correct latitude and longitude. The only exception is when the satellite signals are interrupted by high buildings and mountains, but in this case it is easy to recognize the error. Showing the GPS track in this image, compared with Bing aerial imagery layer in the below figure:
id: Salah satu keunggulan utama dari GPS, bahwa ini lebih baik dibandingkan dengan citra satelit. Sebuah GPS akan selalu memberikan posisi lintang dan bujur yang benar. Satu-satunya pengecualian adalah ketika sinyal satelit terganggu oleh bangunan tinggi dan pegunungan, tetapi dalam kasus ini sangat mudah untuk dikenali kesalahannya. Menampilkan trek GPS pada gambar ini, kemudian dibandingkan dengan *layer* citra satelit Bing seperti gambar di bawah:

source: *Imagery Offset*
id: Pergeseran citra satelit

source: It is clear that the GPS track is likely to be accurate and the satellite imagery beneath it is out of place.
id: Dengan begitu kita akan tahu bahwa trek GPS akurat dan citra satelit dibawahnya mengalami pergeseran.

source: So now we must ask, “if the imagery may be out the place, how can we still use it and make accurate maps?”
id: Sekarang kita pasti bertanya, "jika citra satelit mengalami pergeseran, bagaimana kita dapat menggunakan dan membuat peta yang akurat?"

source: 10.2 CORRECTING IMAGERY OFFSET
id: 10.2 Memperbaiki Pergeseran Citra Satelit

source: The best references for adjusting imagery are GPS tracks that follow roads. And the more GPS tracks that you have to reference, the more accurate you will be able to align your imagery. Since OpenStreetMap users often upload their GPS tracks to the OSM database, we can download them and use them to align our imagery.
id: Salah satu referensiterbaik untuk mengatur citra satelit adalah menggunakan trek GPS yang mengikuti jalan. Semakin banyak trek GPS yang Anda miliki untuk referensi, semakin akurat Anda untuk memperbaiki citra satelit. Saat ini pengguna OpenStreetMap sering kali mengunggah trek GPS mereka ke database OSM, sehingga kita dapat mengunduhnya dan menggunakan untuk memperbaiki citra satelit.

source: Click on the :guilabel:`Download` button.
id: Klik pada tombol :guilabel:`Download`

source: Check the box next to :guilabel:`Raw GPS Data` near the top of the Download window. Select your area and click :guilabel:`Download`.
id: Centang kotak di samping :guilabel:`Data GPS` di bagian atas jendela Download. Pilih area Anda dan klik :guilabel:`Download`.

source: This will download an additional layer to JOSM containing GPS tracks. Depending on how many tracks have been uploaded by OSM users, you may see few tracks (or even no tracks):
id: Ini akan mendownload layer tambahan di JOSM yang terdiri dari track GPS. Tergantung dari seberapa banyak track yang sudah diupload oleh pengguna OSM, Anda mungkin akan melihat beberapa track (bisa juga tidak ada track GPS sama sekali):

source: To adjust an imagery layer, click on the :guilabel:`Adjust imagery offset` button at the top of JOSM.
id: Untuk mengatur citra satelit, klik pada tombol :guilabel:`Atur Offset Citra` di bagian atas JOSM.

source: Ignoring the box that pops up, use your mouse to drag the imagery layer so that it aligns correctly with the GPS tracks. The GPS tracks should line up with the roads on the imagery as closely as possible. You will see the offset numbers in the box change.
id: Abaikan kotak yang muncul, gunakan mouse Anda untuk menggeser citra sehingga akan terposisi sejajar dengan track GPS. Track GPS harus terposisikan sama dengan gambar jalan sedekat mungkin. Anda akan melihat angka offset berubah di kotak tersebut.

source: *Setting Imagery Offset*
id: *Mengatur Pergeseran Citra Satelit*

source: If you like, you can save these offset settings by entering a bookmark name and then clicking :guilabel:`OK`. You can then automatically apply the same settings later by going to :menuselection:`Imagery ‣ Imagery Offset` and clicking on your bookmark.
id: Jika ingin, Anda bisa menyimpan pengaturan pergeseran ini dengan memasukkan nama penanda dan klik :guilabel:`OK`. Anda kemudian dapat secara otomatis mengaplikasikan pengaturan yang sama dengan menuju ke :menuselection:`Imagery ‣ Imagery offset` dan klik penanda yang Anda simpan.

source: If you do not want to save the offset, simply click :guilabel:`OK` without entering a bookmark name.
id: Jika Anda tidak ingin menyimpan pergeserannya, klik :guilabel:`OK` tanpa harus memasukkan nama penanda.

source: What if there are no GPS tracks on OpenStreetMap, and you don’t have a GPS? Without GPS tracks, it is difficult to align imagery. If it is a relatively empty area (not much mapped), you might choose to simply use the imagery as it is and correct the data later.
id: Bagaimana jika tidak ada trek GPS di OpenStreetMap, dan anda tidak mempunyai GPS? Tanpa trek GPS, akan sulit untuk mengatur citra satelit tersebut. Jika area tersebut merupakan area kosong (belum terpetakan semua), anda mungkin bisa memilih untuk menggunakan citra satelit sebagai landasan dan membetulkan data tersebut nantinya.

source: :ref:`Go to next chapter --> <ch11-export-osm-data>`
id: :ref:`Pergi ke bab selanjutnya --> <ch11-export-osm-data>`
