Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/osm/Chapter-04-getting-started-with-josm.po
Languages: id

source: Chapter 4: Getting started with JOSM
id: Bab 4: Memulai JOSM

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Downloading JOSM
id: Mendownload JOSM

source: Installing JOSM
id: Melakukan instalasi JOSM

source: Adjusting settings in JOSM
id: Mengubah pengaturan JOSM

source: Using basic tools (move and draw the objects)
id: Menggunakan tools dasar (menggeser, menggambar objek)

source: Adding presets
id: Menambahkan presets

source: We will now learn how to download and install JOSM step-by-step. JOSM is the Java OpenStreetMap editor, a full-feature desktop editor. When using iD Editor we always have be connected to the internet, while in JOSM we can use it offline or with an intermittent internet connection.
id: Sekarang kita akan mempelajari langkah-langkah bagaimana cara mendownload dan instalasi JOSM. JOSM merupakan editor Java OpenStreetMap pada desktop. Jika menggunakan iD Editor kita harus selalu terhubung dengan internet, maka di JOSM kita dapat mengerjakannya secara offline atau tidak harus selalu terkoneksi dengan internet.

source: In this module, we will also change some JOSM settings that will help us in using JOSM. We will then open a sample map and learn some basic operations of this software. Recall in the introduction module, you were asked to draw a map of the city or region around the neighborhood where you live. We will draw it again in this module, but we will draw it digitally using JOSM. After learning this chapter, you will have a good comprehension of how to map using the JOSM editor.
id: Pada bab kali ini, kita juga akan mengubah beberapa pengaturan pada JOSM agar memudahkan kita dalam menggunakan JOSM. Kemudian kita akan membuka sebuah peta contoh dan mempelajari beberapa pengoperasian dasar dari perangkat lunak ini. Masih ingatkan pada bab pengenalan ketika kita diminta untuk menggambar sebuah peta mengenai kota atau wilayah lingkungan sekitar tempat tinggal kita. Kita akan menggambar kembali di dalam bab ini, tetapi kita akan menggambar secara digital dengan JOSM. Setelah mempelajari bab ini, Anda akan memiliki pemahaman yang baik bagaimana cara menggambar peta di editor JOSM.

source: 4.1 Downloading JOSM
id: 4.1 Download JOSM

source: If you have a copy of the JOSM installation file on a CD or flashdisk, you can skip to the next session on JOSM installation. If you do not have the JOSM installation package or you want the newest version of JOSM, you can open your web browser (using Firefox, Chrome, Opera or Internet Explorer). In the address bar at the top of the window, enter the following text and press enter: `josm.openstreetmap.de <http://josm.openstreetmap.de/>`_. You can also find JOSM site by searching for "JOSM" using your favorite search engine. The JOSM site will look much like the figure below:
id: Jika Anda memiliki salinan file instalasi JOSM pada sebuah CD atau flash disk, Anda dapat langsung melanjutkan ke sesi selanjutnya yaitu instalasi JOSM. Jika Anda tidak memiliki JOSM, atau ingin versi terbarunya, buka web browser anda - (bisa menggunakan Firefox, Chrome, Opera atau Internet Explorer). Pada kolom alamat di bagian atas jendela, masukan teks berikut dan tekan enter:`josm.openstreetmap.de <http://josm.openstreetmap.de/>`_. Anda juga dapat menemukan situs JOSM dengan mencari “JOSM” pada mesin pencarian. Situs JOSM akan terlihat seperti ini:

source: *JOSM site interface*
id: *Tampilan situs JOSM*

source: Select the installation file according to your computer's operating system. If you are using a computer with Windows Operating System, click :guilabel:`Windows installer` to download JOSM. If you have other operating systems, click on the link that corresponds to your computer's operating system and download the installation package. In this module, we assume you are using Windows, but the instructions will be similar for other operating systems.
id: Pilih file instalasi sesuai dengan sistem operasi komputer Anda. Jika Anda menggunakan komputer dengan sistem operasi windows , klik :guilabel:`Windows installer` untuk mendownload JOSM. Jika Anda memiliki sistem operasi lainnya, klik pada tautan yang sesuai dengan sistem operasi komputer Anda dan download paket instalasi. Pada bab ini kami, kami akan mengasumsikan Anda menggunakan Windows, tetapi petunjuknya hampir sama dengan sistem operasi lainnya.

source: 4.2 JOSM Installation
id: 4.2 Instalasi JOSM

source: Once the JOSM installation package has downloaded, we will install onto our computer or laptop. Here are the steps for installing JOSM:
id: File instalasi JOSM sudah berhasil di download, kita akan install ke dalam komputer atau laptop. Berikut langah-langkah untuk instalasi JOSM:

source: Find the JOSM installer file on your computer. Double-click it to begin setup.
id: Temukan file instalasi JOSM di dalam komputer Anda. Klik dua kali pada file tersebut untuk memulai pengaturan.

source: Click :guilabel:`OK`, :guilabel:`Next`, :guilabel:`I Agree`, and :guilabel:`Install`. When the installation is complete, click :guilabel:`Finish` to lunch JOSM for the first time. Later, when you want to start JOSM, you can do so by clicking on the :guilabel:`Start Menu` in the lower left corner of your computer, and clicking the program JOSM.
id: Klik :guilabel:`OK`, :guilabel:`Next`, :guilabel:`I Agree`, dan :guilabel:`Install`. Ketika instalasi selesai, klik :guilabel:`Finish` untuk membuka JOSM pertama kalinya. Kemudian, ketika Anda ingin memulai JOSM, Anda dapat melakukannya dengan mengklik :guilabel:`Start Menu` di sudut kiri bawah pada komputer Anda, dan klik program JOSM.

source: When JOSM starts, it will look something like the image in the figure below:
id: Ketika JOSM terbuka, maka akan terlihat tampilan seperti ini:

source: *JOSM home view*
id: *Tampilan awal JOSM*

source: You may have problems when installing JOSM if Java is not installed on your computer. If you have
id: Anda mungkin memiliki masalah ketika melakukan instalasi JOSM apabila Java belum terinstal di komputer Anda. Jika Anda memiliki

source: problems during the installation in this section, try to download and install Java. You can download here: `www.java.com/en/download/ <http://www.java.com/en/download/>`_
id: masalah ketika melakukan instalasi pada bagian ini, cobalah mendownload dan menginstal Java. Anda dapat mendownloadnya di sini: `www.java.com/en/download/ <http://www.java.com/en/download/>`_

source: When the first time you open JOSM, you might see a window appears there ask to update the software. You do not need to update it because you just downloaded a new software. :guilabel:`Cancel` button. If you don’t want to see this message anymore, check a **box below** before clicking “Cancel”.
id: Ketika Anda membuka JOSM saat pertama kali, Anda mungkin akan melihat jendela yang menanyakan untuk memperbaharui perangkat lunak tersebut. Anda tidak perlu memperbaharuinya karena yang baru saja Anda download sudah perangkat lunak terbaru. Tekan tombol :guilabel:`Cancel`. Jika Anda tidak ingin melihat pesan ini lagi, **centang kotak di bawah** sebelum menekan **Cancel**.

source: JOSM used in this module is the newest version from the site. The display version could possibly change if you are using another JOSM version.
id: JOSM yang digunakan dalam modul ini merupakan versi terbaru dari situs. Tampilan berbagai versi mungkin bisa berubah jika Anda menggunakan versi yang lain.

source: 4.3 JOSM Setup
id: 4.3 Pengaturan JOSM

source: 4.3.1 Change Language
id: 4.3.1 Mengubah Bahasa

source: There are many settings that you can adjust in JOSM. One of settings you might want to adjust is the local JOSM language. JOSM has been localized with many language options, and you should choose the language that you want.
id: Terdapat banyak pengaturan yang dapat Anda sesuaikan di dalam JOSM. Salah satu pengaturan yang Anda mungkin ingin sesuaikan adalah bahasa yang digunakan JOSM. JOSM telah diterjemahkan dengan berbagai macam bahasa, dan Anda dapat memilih bahasa yang Anda inginkan.

source: To access Preferences windows, click :menuselection:`Edit ‣ Preferences...`
id: Untuk mengakses jendela **Preferences**, klik :menuselection:`Edit ‣ Preferences...`

source: *Bring up the preferences menu in JOSM*
id: *Memunculkan menu preferensi di JOSM*

source: On the left side, click icon that looks like a **paint can** and **paintbrush**.
id: Pada sisi sebelah kiri, klik ikon yang terlihat seperti kaleng cat dan kuas cat.

source: At the top of the window, click the tab that says :guilabel:`Look and Feel`.
id: Di atas jendela, klik kotak yang bernama :guilabel:`Look and Feel`.

source: Choose your language in the dropdown box next to the word **Language** as shown in the figure below.
id: Pilih bahasa Anda pada kotak daftar pilihan yang bertuliskan **Language** seperti ditunjukkan pada gambar di bawah ini.

source: *Change language in JOSM*
id: *Mengganti bahasa di JOSM*

source: 4.3.2 Account and Proxy Settings
id: 4.3.2 Mengatur AKun serta Proxy Jaringan

source: After changing the language we also need to enter the username and password of our OSM account in JOSM. This will be useful when we edit or add data on the OSM map, the server will recognize that the edits belong to a registered user. If you do not add your account information, you will not be able to upload data into OpenStreetMap. Here are the steps to add your account information:
id: Setelah mengubah bahasa yang digunakan di JOSM kita juga harus memasukkan nama akun OSM kita serta kata kuncinya di dalam JOSM. Tujuannya adalah agar ketika kita melakukan edit atau menambahkan data di peta OSM, server akan mengenali bahwa hasil edit tersebut adalah milik kita. Jika kita tidak memasukkan nama akun, Anda tidak dapat mengupload data ke dalam OpenStreetMap. Berikut cara untuk menambahkan informasi akun Anda:

source: Click icon that looks like a **Globe** at the left side of preferences box.
id: Silahkan klik ikon yang bergambar **Globe** di sebelah kiri kotak preferensi

source: Then enter your OSM username and password as shown in the figure below.
id: Kemudian masukkan nama akun OSM dan kata kunci seperti ditunjukkan di bawah ini

source: *Adding OSM username and password in JOSM*
id: *Memasukkan nama akun serta password OSM di JOSM*

source: If your internet connection is using proxy, you can also enter the proxy on the :guilabel:`proxy settings` tab then simply enter the appropriate proxy for your internet network.
id: Jika koneksi internet Anda menggunakan proxy, Anda juga dapat memasukkan proxy pada tab :guilabel:`Pengaturan proxy` kemudian silahkan masukkan proxy sesuai jaringan internet Anda.

source: 4.3.3 Adding Presets
id: 4.3.3 Menambahkan Presets

source: By now you should have entered your account name. Next is to configure JOSM by adding menu presets. What are menu presets? Menu presets are small files added to JOSM that can pre-supply the attribute fields for mapping features, such as name and address for a building, or street name for a road. If you are still a bit confused about presets, follow along and you. To add menu presets, follow these steps:
id: Sekarang kita telah memasukkan nama akun kita. Selanjutnya adalah pengaturan untuk memasukkan presets di JOSM. Apa itu presets? Presets adalah sebuah file yang dapat memberikan informasi terkait objek-objek yang kita petakan, seperti nama dan alamat untuk sebuah bangunan, atau nama jalan untuk sebuah jalan. Jika Anda belum jelas mengenai presets, kita akan mempelajarinya seiring dengan panduan ini. Cara menambahkan presets adalah sebagai berikut:

source: Click the icon that looks like a grid:
id: Klik ikon yang terlihat seperti sebuah grid:

source: Click the tab at the top that reads :guilabel:`Tagging Presets`.
id: Klik tab di sebelah atas yang bernama :guilabel:`Tagging Presets`.

source: Under **Available Presets** find and select the entry labelled **Buildings Indonesia**. Then click the blue arrow to the right of this box, as shown in the figure below.
id: Dibawah kotak **Presets Tersedia** cari dan pilih presets yang bernama **Buildings Indonesia**. Lalu klik tanda panah biru yang berada di sebelah kanan kotak, seperti ditunjukkan dibawah ini.

source: *Adding presets in JOSM*
id: *Menambahkan presets di JOSM*

source: If you already have your own presets file on your computer, you can insert it directly:
id: Jika Anda sudah memiliki file presets Anda sendiri di komputer Anda, Anda juga dapat langsung memasukkannya, dengan cara :

source: Click :guilabel:`+` beside active presets box
id: Klik :guilabel:`+` di samping kotak presets aktif

source: Then click this icon below to find your presets file
id: Kemudian klik ikon seperti di bawah ini untuk mencari file presets Anda

source: When you locate the presets file, click :guilabel:`Open` then :guilabel:`Ok`.
id: Jika sudah menemukan lokasi file presets, klik :guilabel:`Buka` kemudian :guilabel:`Ok`

source: 4.3.4 Adding a Plugin
id: 4.3.4 Menambahkan Plugin

source: Now we will try to add a plugin in JOSM. A plugin is a tool that we can add it as an extension in JOSM to help us during editing. Here are the steps to add plugin in JOSM:
id: Sekarang kita akan mencoba untuk menambahkan plugin di JOSM. Plugin merupakan alat yang dapat kita tambahkan sebagai ekstensi di JOSM untuk memudahkan kita dalam melakukan editing. Berikut adalah cara memasukkan plugin di JOSM:

source: Click :guilabel:`plugin` icon that looks like picture below
id: Klik ikon :guilabel:`plugin` yang bergambar seperti di bawah ini

source: Then click :guilabel:`Download list` to download all plugins that available in JOSM
id: Kemudian klik :guilabel:`Download daftar` untuk mendownload semua plugin yang tersedia di JOSM

source: In search box, type the name of the plugin, for example :guilabel:`building_tools`
id: Di kotak pencarian, ketikkan plugin yang Anda cari, misalnya :guilabel:`building_tools`

source: Then check the box beside the plugin name as shown in the figure below:
id: Kemudian centang kotak yang ada disamping tulisan plugin tersebut:

source: *Download plugin in JOSM*
id: *Mendownload plugin di JOSM*

source: 4.3.5 Activate Remote Control
id: 4.3.5 Mengaktifkan Remote Control

source: *Remote Control* in JOSM needs to be set in order for other sites, such as the HOT Tasking Manager to access your OpenStreetMap account and enable editing. To activate the remote control function:
id: *Remote Control* di JOSM perlu dilakukan agar kita bisa dapat mengambil dari situs lainnya, seperti saat menggunakan HOT Tasking Manager untuk mengakses akun OpenStreetMap dan memungkinkan melakukan editing. Untuk mengaktifkan fungsi remote control adalah sebagai berikut:

source: Click the icon depicted in the picture below
id: Silahkan klik ikon seperti di bawah ini

source: Then check on the box beside :guilabel:`Enable remote control`
id: Kemudian centang pada kotak disamping tulisan :guilabel:`Memperbolehkan remote kontrol diguna­kan`

source: Check any other box shown in the figure below according to your needs.
id: Silahkan centang beberapa kotak yang ada di bawahnya sesuai dengan keinginan Anda.

source: *Activate remote control in JOSM*
id: *Mengaktifkan remote kontrol di JOSM*

source: 4.3.6 Adding Satellite Imagery
id: 4.3.6 Memasukkan Citra Satelit

source: We will want to use satellite imagery as a background to identify features and trace them when making our map, so let’s add imagery from the Preference window.
id: Kita akan menggunakan citra satelit sebagai latar belakang untuk mengidentifikasi fitur dan mengikuti bentuk objek yang ada di citra ketika membuat peta kita, sehingga kita akan perlu untuk memasukkan melalui jendela Preferensi

source: Click on the icon that says **WMS TMS** like this:
id: Klik ikon yang menyatakan **WMS TMS** seperti di bawah ini:

source: Bing Satellite imagery is often the default choice, so click on :guilabel:`Bing Sat`. Then click :guilabel:`Activate` as shown in the figure below.
id: Citra satelit Bing seringkali menjadi pilihan pengaturan standar, klik :guilabel:`Bing Sat`. Kemudian klik :guilabel:`Aktifkan` seperti gambar di bawah ini.

source: *Satellite imagery layer list in JOSM*
id: *Daftar layer citra satelit di JOSM*

source: 4.4 JOSM Interface
id: 4.4 Tampilan Antar Muka JOSM

source: At this point, you’ve should have learned to customize and pre-configure the basic settings in JOSM, and now you’re ready to edit the map. In this chapter, we turn attention to the important parts of the JOSM editor and how to use them. The figure below shows the essential parts of the JOSM interface.
id: Sekarang, Anda sudah melakukan beberapa kustomisasi dan pengaturan dasar sebelum menggunakan JOSM, dan sekarang Anda sudah siap untuk melakukan editing peta. Pada bab ini, kita harus memperhatikan beberapa bagian penting dari editor JOSM dan bagaimana menggunakannya. Gambar di bawah ini menunjukkan bagian penting dari antar muka JOSM.

source: *JOSM interface*
id: *Tampilan Antar Muka JOSM*

source: The main window, as you have seen earlier, -is the map area, and where most of the editing activity takes place. Here you will view, interrogate, edit, and add data to OpenStreetMap.
id: Jendela utama yang sudah Anda kenal - ini adalah jendela peta, dan dimana sebagian besar kegiatan editing berlangsung. Disini Anda akan melihat, mengedit, dan menambahkan data ke OpenStreetMap.

source: To the right of the map area are stacked panels, each having a dedicated function. Usually when the first time you install JOSM, several panels that will be displayed with the default settings, such as **Layers, Properties**, and **Selection**. When you **select a node, way, or polygon** in map area, it'll be displayed on **Selection panel**. **Information about the object** will be displayed on **Properties panel**, and **username of the object author** will be displayed on **Author panel**.
id: Pada bagian kanan dari jendela peta adalah serangkaian panel, masing masing memiliki fungsi tersendiri. Biasanya ketika Anda pertama kali menginstal JOSM beberapa panel yang akan ditampilkan dengan pengaturan standar, seperti **Layers, Properties**, and **Pilihan**. Ketika Anda memilih sebuah **titik, garis, atau poligon** di dalam jendela peta, ini akan ditampilkan pada panel **Pilihan**. Informasi mengenai objek akan ditampilkan di panel **Properties**, dan nama pengguna dari pembuat objek yang akan ditampilkan di panel **Pembuat**.

source: To the left of the map area is a vertical toolbar, each icon corresponds to an editing function (see ‘Tools’ in figure above). For example, there are buttons for editing such as **Select object(s)** tool and **Draw nodes** tool. Other tools depicted in the above example include icons for deleting an object, drawing a polygon, and creating a way that is parallel to the other ways.
id: Pada bagian kiri dari area peta adalah toolbar vertikal, masing-masing ikon digunakan untuk editing (seperti *Tools* di atas). Sebagai contoh, terdapat tombol untuk mengedit seperti tool **Pilih Objek** dan tool **Gambar node**. Tools lainnya yang digambarkan di atas termasuk ikon untuk menghapus objek, menggambar sebuah poligon, dan membuat sebuah garis yang sejajar dengan garis lainnya.

source: 4.5 Learn Basic Drawing in JOSM
id: 4.5 Latihan Dasar Menggambar dengan JOSM

source: Let’s start by opening up a sample OSM file which we will use to learn the basic ways to draw maps with JOSM. Note that this map is not real, in that it is not a real map of a real place, so we will not save it on OpenStreetMap.
id: Mari mulai dengan membuka file contoh OSM yang kita akan gunakan untuk mempelajari cara dasar menggambarkan peta dengan JOSM. Perhatikan bahwa data ini hanya sebuah contoh dengan tempat yang tidak nyata, jadi kita tidak akan menyimpannya ke dalam OpenStreetMap.

source: Download the file here: `bit.ly/osmsample <http://bit.ly/osmsample>`_
id: Download file tersebut disini:`bit.ly/osmsample <http://bit.ly/osmsample>`_

source: Open JOSM. Click the **Open** button in the upper left.
id: Sekarang buka JOSM. Klik tombol :guilabel:`Buka` di bagian atas pada sudut kiri.

source: Find the file :file:`sample.osm` on your computer and open it. Your JOSM screen should look quite similar to the figure below:
id: Temukan file :file:`sample.osm` di komputer Anda kemudian buka. Layar JOSM Anda akan muncul tampilan seperti berikut ini:

source: *Display of sample file in JOSM*
id: *Tampilan file latihan di JOSM*

source: 4.5.1 Basic Operation
id: 4.5.1 Operasi Dasar

source: To **move the map** left or right, up or down, **hold your right mouse** button down, and **move your mouse**.
id: Untuk **menggerakkan peta** ke kanan atau ke kiri, naik atau turun, **klik kanan** lalu **tahan dan gerakkan** mouse Anda.

source: There are several ways to **zoom in** and **zoom out** of the map. If you have a mouse, you can use your scroll wheel to zoom in and out. If you are using a laptop and don’t have a mouse, you can zoom in and out using the scale bar in the upper left of the map window. **Drag the bar left and right by holding your left mouse down** **and moving the bar left or right** with your mouse.
id: Ada beberapa cara untuk **memperbesar dan memperkecil** peta. Jika Anda memiliki mouse, Anda dapat menggunakan scroll roda untuk memperbesar dan memperkecil peta. Jika Anda menggunakan sebuah laptop dan tidak memiliki sebuah mouse, Anda dapat memperbesar dan memperkecil menggunakan garis skala yang terletak di sebelah kiri atas dari jendela peta. Tahan dan geser ke kiri dan ke kanan dengan mouse Anda.

source: Look at the sample map. There a few different types of objects here. For example, there is a river, a forest, some buildings, several roads, and a couple of shops. **Select an object by clicking** on it with your left mouse button. Click on each of these objects and note the information in the panels on the right.
id: Lihat contoh data. Terdapat beberapa perbedaan jenis objek di sana. Sebagai contoh, ada sungai, hutan, beberapa bangunan, jalan dan sepasang tempat berbelanja. Untuk memilih objek-objek, klik dengan menggunakan mouse Anda. Klik di masing-masing objek dan catatan informasi pada panels di sebelah kanan.

source: 4.5.2 Node, Ways, and Polygons
id: 4.5.2 Titik, Garis, dan Poligon

source: As you click different objects on the sample map, notice that there are three different types of objects on the map. There are **nodes, ways**, and **polygons**.
id: Ketika Anda mengklik objek yang berbeda pada peta, perhatikan bahwa terdapat 3 jenis objek berbeda pada peta tersebut. Ketiga jenis objek tersebut adalah **titik, garis, dan poligon**.

source: Points are a single location, represented by symbols. On this sample map, there are two points, a clothing shop and a market. The clothing shop is represented by a shirt symbol, and the market is represented by a shopping cart. If you can not see these features clearly, please zoom in to the map.
id: Titik adalah suatu lokasi yang digambarkan dengan simbol. Dalam data contoh ini terdapat dua titik, yaitu toko baju dan pasar. Toko baju digambarkan dengan simbol kaos dan pasar digambarkan dengan keranjang belanja. Jika Anda tidak dapat melihatnya dengan jelas silahkan perbesar petanya.

source: There are several ways on the map as well, which represent roads. If you look closely you will see that within the ways, there are nodes as well. These nodes don’t have any symbols or other information associated with them, but they define where the line is located and give it shape.
id: Terdapat beberapa garis yang terdapat dalam peta, yang dimana menggambarkan jalan. Jika Anda melihat dengan lebih teliti Anda akan melihat dalam garis, terdapat titik-titik. Titik-titik tersebut tidak memiliki simbol atau informasi lainnya tetapi titik-titik tersebutlah yang membertuk garis tersebut.
