Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/osm/Chapter-05-editing-with-josm.po
Languages: id

source: There are some common mistakes that mappers make when they start using OpenStreetmap. In this chapter we’ll identify a few of the most frequent errors and offer some tips for better mapping.
id: Ada beberapa kesalahan umum yang dilakukan pembuat peta ketika mereka memulai menggunakan OpenStreetMap. Pada bab ini, kita akan mengidentifikasi beberapa kesalahan yang sering dilakukan dan memberikan beberapa tips untuk memetakan lebih baik.

source: 5.2.1 Connecting Objects
id: 5.2.1 Objek yang saling Terhubung

source: **Some objects should not connect...**
id: **Beberapa Objek Sebaiknya tidak Terhubung**

source: When you are creating polygon and line that are not supposed to be connected, make sure that they are not merged together by sharing a node. For example, highway nodes should not be snapped to buildings, because no one likes a road that leads directly into a wall! If you want to disconnect two or more objects that share the same node, select node and go to :menuselection:`Tools -> Unglue Ways` or press :kbd:`G` as shown in the figure below.
id: Ketika Anda membuat poligon dan garis yang tidak seharusnya terhubung, pastikan mereka tidak terhubung oleh satu titik. Sebagai contoh, titik pada jalan sebaiknya tidak menempel ke bangunan, karena tidak ada jalan yang langsung menempel dengan dinding! Jika anda ingin memutuskan hubungan dua atau lebih objek yang menempel di titik yang sama, pilih titik dan pergilah ke Menu :menuselection:`Tools -> Memisahkan titik/garis` atau tekan :kbd:`G` seperti gambar di bawah ini.

source: *Building and Road Connected*
id: *bangunan dan jalan yang tersambung*

source: *Building and Road Separated*
id: *bangunan dan jalan yang terpisah*

source: **...but some objects should connect**
id: **Tetapi, Beberapa Objek Harus Terhubung**

source: Roads that intersect should always share a node as shown in the figure below. If they do not share in a common node, then the computer has no way of knowing that the roads actually connect to each other. Therefore if you see the roads are not connecting to each other, please fix it by selecting the node from the road that you want to connect then go to :menuselection:`Tools -> Merge Node` or press :kbd:`M` in your keyboard and drag it.
id: Jalan yang bersinggungan seharusnya selalu terhubung pada titik. Jika mereka tidak terhubung pada satu titik, maka komputer tidak mengetahui bahwa jalan tersebut sebenarnya saling terhubung satu sama lain. Maka dari itu jika anda melihat ada jalan yang tidak saling terhubung satu sama lain silahkan perbaiki dengan pilih node/ titik dari jalan yang ingin dihubungkan kemudian pergilah ke Menu :menuselection:`Tools -> Gabungkan Node` atau tekan :kbd:`M` pada keyboard Anda dan geser.

source: *Road must connect to each other*
id: *Jalan harus terhubung satu sama lain*

source: 5.2.2 Overlapping Object
id: 5.2.2 Objek yang Saling Overlap

source: A common error is to have overlapping polygons when the objects they represent do not overlap in real life. A building can not overlap to another building. For example, a polygon drawn to represent a park outside a building should not overlap with the building. Instead it should be drawn next to the building.
id: Salah satu kesalahan umum adalah poligon saling overlap ketika objek yang digambarkan sebenarnya tidak saling overlap. Sebuah bangunan tidak bisa overlap dengan bangunan yang lain. Sebagai contoh, poligon yang dibangun untuk menggambarkan taman diluar bangunan sebaiknya tidak saling overlap dengan bangunannya. Seharusnya digambar di sebelah bangunannya.

source: *The example of overlap building*
id: *Contoh bangunan yang saling overlap*

source: There are some exceptions to this rule, such as school. Within a school yard you might identify individual buildings using polygons, yet you also might want to create a polygon around the entire school yard. In this case it is fine for the polygons to overlap, but the rule to follow here is to make sure that the buildings are completely inside the landuse polygon.
id: Ada beberapa pengecualian pada aturan ini, se­perti sekolah. Di dalam halaman sekolah mungkin Anda ingin mengidentifikasi bangunan menggunakan poligon, tapi mungkin Anda juga ingin membuat sebuah poligon yang meliputi seluruh halaman sekolah. Dalam kasus seperti ini, poligon diper­bolehkan untuk saling overlap, tetapi aturannya adalah pastikan bahwa bangunan­ se­cara menyeluruh berada dalam poligon peng­gunaan lahan.

source: *The example of overlap building that is true and false*
id: *Contoh overlap bangunan yang salah dan benar*

source: 5.2.3 Other Errors
id: 5.2.3 Kesalahan-Kesalahan yang Lain

source: Tag given in the node rather than on building
id: Tag Diberikan pada Node, Bukan pada Bangunan

source: *The example of building given a false tag (left) and true tag (right)*
id: *Contoh bangunan yang diberikan tag dengan salah (kiri) dan benar (kanan)*

source: A common error is adding tag on a node that makes up part of a line or polygon. This often happens when someone draws a building and then select one of the nodes that participate in the object. The way to avoid creating an improper way is by clicking directly on the line.
id: Satu masalah umum yaitu menambahkan tag pada node yang terdapat pada bagian dari sebuah garis atau poligon. Ini sering terjadi ketika seseorang menggambar sebuah bangunan dan kemudian memilih satu dari titik yang ada disekitar gambar tersebut. Cara untuk menghindari hal ini, dengan klik secara langsung pada garis.

source: Intersection that meets in road corner/ intersections should be separated
id: Persimpangan yang Bertemu di Sudut Jalan/Persimpangan Jalan Harus Dipisah

source: *The wrong intersection (left) and true intersection (right)*
id: *Pembuatan simpangan yang salah (kiri) dan benar (kanan)*

source: When roads intersect each other at road corners, you should not create a curved line at intersection. Line should form an angle of 90° that represents the actual conditions.
id: Ketika jalan bersinggungan satu sama lain di sudut jalan, Anda tidak boleh membuat garis melengkung di persimpangan. Garis seharusnya berbentuk sudut 90°, seperti dikondisi sebenarnya.

source: There is no tag in a node or a line
id: Tidak ada Tag pada Node atau Garis

source: To fix this, select an object and tag the object in accordance with the information that describes the object. Alternatively, the object can be removed if the object is in error.
id: Untuk memperbaiki ini, pilih objek dan tag objek yang sesuai dengan informasi yang dideskripsikan objek tersebut. Kemungkinan, objek bisa di hapus bila itu adalah kesalahan.

source: Line near, or with another line but they are not connecting
id: Garis Berada Dekat dengan Garis Lain Tetapi Tidak Terhubung

source: The figure below shows an example of lines that should connect but do not.
id: Gambar di bawah ini menunjukkan sebuah contoh dari garis yang seharusnya terhubung tetapi tidak

source: *The example of lines not connecting to each other*
id: *Contoh dari garis tidak saling terhubung*

source: To fix it, you can select a node from the line that you want to connect, and then select the :guilabel:`Draw Node` tool to add a node at the end of the line. Alternatively, you can use the :guilabel:`Merge Node` tool (if the front line is not connecting, that is a node), the following stages are:
id: Untuk memperbaikinya, Anda bisa memilih titik dari garis yang ingin dihubungkan dan kemudian pilih :guilabel:`Gambar node` untuk menambahkan titik di akhir garis. Alternatif lainnya, Anda bisa menggunakan :guilabel:`Gabungkan Node` (jika didepan garis yang belum terhubung tersebut merupakan sebuah titik), caranya:

source: Select the two adjacent nodes, which is in the second line you want to connect
id: Pilih kedua titik yang berdekatan, yang berada di dalam kedua garis yang ingin dihubungkan

source: Select :menuselection:`Merge Node > Tools` menu
id: pilih menu :menuselection:`Tools > Gabungkan Node`

source: If the end of the first line is not yet connected, and there is not a point to connect to in the second line, you can use the :menuselection:`Tools > Join Node to Way`.
id: Jika di depan garis yang belum terhubung tersebut tidak terdapat sebuah titik, Anda bisa menggunakan tool pada :menuselection:`Tools > Menggabungkan node/titik men­jadi way/garis`.

source: Way should not cross the building
id: Garis Tidak Boleh Melewati Bangunan

source: In the figure below, a linear feature runs directly through a building.
id: Pada gambar di bawah, sebuah fitur linear berjalan langsung melalui sebuah bangunan.

source: *The example of way cross the building*
id: *Contoh garis melewati bangunan*

source: To fix this, you need to use the latest satellite imagery so you can determine which objects are correctly placed. If you are already using the latest imagery, simply move the object to the appropriate place and delete any obsolete features.
id: Untuk mengatasinya, Anda perlu melihat menggunakan citra satelit objek mana yang berada pada lokasi yang salah. Jika sudah, Anda tinggal menggeser objek tersebut ke tempat yang sesuai.

source: 5.3 JOSM Editing Process
id: 5.3 Tahapan Mengedit di JOSM

source: Editing OpenStreetMap with JOSM is similar to editing with the iD editor. But because JOSM is a desktop application, it works a little bit differently. The general process of editing and adding to OpenStreetMap with JOSM will always follow this pattern:
id: Mengedit OpenStreetMap dengan JOSM sama dengan mengedit dengan iD editor. Namun karena JOSM adalah aplikasi desktop, akan ada sedikit perbedaan. Berikut adalah proses mengedit dan menambahkan ke OpenStreetMap dengan JOSM yang tahapannya sebagai berikut:

source: :guilabel:`Download` the current map data from OSM
id: :guilabel:`Download` data peta yang terbaru dari OSM

source: :guilabel:`Edit` it using satellite imagery, GPS or Field Papers
id: :guilabel:`Edit` ini menggunakan citra satelit, GPS atau FieldPapers

source: :guilabel:`Save` changes to OpenStreetMap
id: :guilabel:`Save` perubahan ke OpenStreetMap

source: In the following sections, we explore this pattern in greater detail.
id: Pada bagian ini, kita akan mempelajari hal secara lebih rinci

source: 5.3.1 Downloading OSM Data
id: 5.3.1 Mendownload Data OSM

source: The first step is to download the data for the area of interest that you want to map. Remember that you need to do this every time that you want to make changes to the map, because the map is often being updated by other users and you will want the latest data.
id: Langkap pertama mengedit adalah mendownload data untuk area yang akan kita tambahkan. Perhatikan bahwa Anda perlu melakukan ini setiap waktu sesuai dengan keinginan Anda untuk melakukan perubahan pada peta, karena peta ini sering kali diperbarui oleh pengguna lain.

source: Click on :guilabel:`File` in the top left corner of JOSM and click :guilabel:`Download from OSM`. This will open up the download window. You can access this window more simply by clicking on the :guilabel:`download` button, shown here:
id: Klik pada :guilabel:`File` di sudut kanan atas JOSM dan klik :guilabel:`Download dari OSM`. Kemudian jendela download akan terbuka. Anda juga dapat mengakses jendela ini dengan mengklik pada tombol :guilabel:`download`, seperti ini:

source: When the download window opens, you should see a map with a pink box drawn on it. If you don’t see the map, click on the tab marked :guilabel:`Slippy map` as shown in the figure below.
id: Ketika jendela download terbuka, Anda akan melihat peta dengan kotak berwarna merah muda yang tergambar di dalamnya. Jika peta Anda tidak muncul, klik pada tab yang bertanda :guilabel:`Pencarian peta secara cepat` seperti ditunjukkan gambar di bawah ini.

source: 3. The pink box represents the area of interest that we would like to download for editing. Use your mouse to pan and zoom to an area that you know very well, such as your hometown or neighborhood. The controls are the same as in the JOSM map window. The right mouse button lets you drag the map, and your scroll wheel allows you to zoom in and out.
id: 3. Kotak berwarna merah muda merupakan area peta yang akan kita download. Gunakanlah mouse Anda untuk menggeser dan memperbesar ke area yang ingin anda edit, seperti tempat tinggal Anda atau lingkungan sekitarnya. Klik kanan tahan berguna untuk menggeser peta, dan gulir mouse Anda berguna untuk memperbesar dan memperkecil peta.

source: 4. Draw a box around the area that you want to download. To draw a new box, click on the map, hold your left mouse button down, and drag your mouse to create a box. Release the mouse button to finish drawing the box.
id: 4. Gambarlah kotak disekitar area yang Anda ingin download. Untuk menggambar kotak baru, klik dan tahan pada peta lalu geser mouse Anda untuk membuat sebuah kotak. Lepaskan tom­bol mouse untuk mengakhiri menggambar ko­tak.

source: 5. When you are satisfied with the size and location of the box, click :guilabel:`Download` at the bottom of the window. JOSM will fetch the data for this area from OpenStreetMap and open it in your map window for editing.
id: 5. Apabila kotak yang Anda buat sudah benar dengan ukuran dan lokasi kotak, klik :guilabel:`Download` di bagian bawah jendela. JOSM akan mendownload data untuk area ini dari OpenStreetMap dan membukanya di jendela peta Anda untuk mengedit.

source: 5.3.2 Add Imagery
id: 5.3.2 Menambahkan Citra Satelit

source: If you followed along when we added our first points with the iD editor, you remember that beneath the map data there was a satellite image that helped us identify objects on the ground. This imagery was licensed from Microsoft Bing, which generously provides its imagery for OpenStreetMap users to use as a reference while contributing to the map.
id: Jika Anda masih mengingat cara mengedit menggunakan iD editor, Anda perhatikan bahwa di bawah data peta terdapat citra satelit yang dapat membantu kita untuk mengidentifikasi objek di permukaan. Citra satelit ini berasal dari Microsoft Bing, yang menyedikan citra satelit ini untuk para pengguna OpenStreetMap secara gratis sebagai referensi dalam berkontribusi untuk pemetaan.

source: To add the Bing satellite imagery in JOSM, click :guilabel:`Imagery` on the top menu of JOSM and selecting :guilabel:`Bing Sat`.
id: Untuk menambahkan citra satelit Bing di JOSM, klik :guilabel:`Citra Satelit` di bagian menu atas JOSM dan pilihlah :guilabel:`Bing Aerial Imagery`.

source: 5.3.3 Edit with JOSM
id: 5.3.3 Mengedit dengan JOSM

source: To this point, we have been doing some pre-edit steps in JOSM starting with downloading OSM data and adding satellite imagery as the background. Next, we’ll edit the map and add new objects on it.
id: Sekarang, kita telah melakukan beberapa langkah sebelum mengedit di JOSM, dimulai dengan mendownload data OSM dan menambahkan citra satelit sebagai latar belakang. Selanjutnya, kita akan mengedit peta dan menambahkan objek baru didalamnya.

source: You might rather see more or less data in your editing window. What you see will depend on the size of your editable area. Please note, the data you are working with is real data and the nodes, lines and polygon in your map area represents actual objects on the ground.
id: Anda mungkin akan mendapat banyak atau sangat sedikit data peta di JOSM, tergantung dari luas area yang Anda gunakan. Tetapi perhatikan bahwa data itu adalah jenis data yang sama seperti data contoh yang telah kita pelajari sebelumnya seperti titik, garis, dan poligon yang mewakili lokasi kehidupan nyata.

source: Use same steps that you have learned before to add nodes to your map. If you see any error in your object, please fix it.
id: Menggunakan cara seperti yang Anda telah pelajari sebelumnya untuk menambah titik ke peta wilayah. Jika Anda melihat suatu kesalahan pada objek tersebut, cobalah untuk memperbaikinya.

source: 2. You do not need to hurry, take your time to understand the steps. If you are not really sure about the outline or identify of some object, you should leave these off the map.
id: 2. Anda tidak perlu terburu-buru pada saat mempelajarinya. Jika Anda tidak yakin mengenai suatu objek jangan memetakannya.

source: 3. If you want to move nodes, lines, or polygon, you can use :guilabel:`Select Tools`. Click the object that you want to move and drag it to where it should be.This step could be used to fix location of objects which have wrong position.
id: 3. Jika Anda ingin memindahkan sebuah titik, garis, atau poligon, menggunakan :guilabel:`Alat Memilih Ob­jek`. Klik pada sebuah objek dan menggesernya ke tempat yang seharusnya. Hal ini dapat digunakan untuk memperbaiki lokasi objek yang berada di tempat yang salah.

source: 4. Use :guilabel:`Draw Tool` to draw nodes, lines, and polygon. Add description and information of your object using Presets menu. You have done this in previous chapter.
id: 4. Gunakan :guilabel:`Alat Menggambar` untuk menggambar titik, garis, dan poligon. Tambahkan deskripsi dan informasi objek tersebut dengan menggunakan menu Presets. Anda telah melakukannya pada bab sebelumnya.

source: JOSM Layer
id: Layer JOSM

source: You might be notice that everytime you add new object to JOSM, your object will be added to layer panel at right side in JOSM. Your :guilabel:`Panel Layer` should looks like this:
id: Anda mungkin telah memperhatikan bahwa setiap Anda menambahkan objek baru ke JOSM, objek Anda akan ditambahkan ke panel layer di sisi kanan JOSM. :guilabel:`Panel Layers` Anda mungkin terlihat seperti ini:

source: Every item listed is a different source of data that you have open in JOSM. In the example shown in the figure above, :guilabel:`Data Layer 1` is the OpenStreetMap data that we are currently editing. :guilabel:`BingSat` layer is satellite imagery that is used as a background in JOSM.
id: Setiap item dalam daftar ini merupakan sumber data yang berbeda yang Anda telah buka di JOSM. Pada contoh yang ditunjukkan gambar di atas, :guilabel:`Data Layer 1` adalah data OpenStreetMap yang kita edit. :guilabel:`Bing Sat` adalah layer citra satelit yang kita gunakan sebagai sebuah latar belakang di JOSM.

source: Those layers that are used as background images help us identify and digitize objects in JOSM. These include satellite imagery, but also GPS tracks and scans of Field Papers. We call these layers **base layers** and our OSM data layer is main layer that we use to digitize and edit, add objects, move objects, etc.
id: Layer-layer yang digunakan sebagai latar belakang untuk membantu identifikasi dan mendijitasi objek di JOSM. Seperti citra satelit, trek gps, dan hasil scan FieldPapers. Kita menyebutnya sebagai **base layers atau latar belakang** sedangkan layer dari data osm yang kita download adalah layer utama yang kita gunakan untuk digitasi dan melakukan editing, menambahkan objek, memindahkan objek, dsb.

source: To move a layer, click on that layer in :guilabel:`Layers` panel and click :guilabel:`up` or :guilabel:`down blue arrow` to move it.
id: Untuk memindahkan sebuah layer, klik pada :guilabel:`Layers` dan klik tanda panah guilabel:`ke atas` atau :guilabel:`ke bawah` untuk memindahkannya.

source: To hide a layer, select layer with your mouse and you can click :guilabel:`Show/Hide` button:
id: Untuk menghilangkan sebuah layer, pilih layer dengan mouse Anda dan klik tombol :guilabel:`Show/ Hide`:

source: You should see your layer that you select will be hide in JOSM. If you want to show it again, you can click the show/hide button and it would be automatically show in JOSM.
id: Anda seharusnya melihat layer yang Anda telah pilih akan menghilang pada jendela peta. Klik tombol Show/Hide dan ini secara otomatis akan muncul di JOSM.

source: You also can delete a layer using the :guilabel:`delete` button:
id: Anda dapat menghapus sebuah layer dengan menggunakan tombol :guilabel:`delete`:

source: 4. Last, it is very important to know that you only can edit the :guilabel:`Active` layer in JOSM. If you can not edit your map in JOSM, it might be because your layer is not active. Most layer, such as GPS point, Field Papers, and Aerial Imagery cannot be edited. The only layer that can be edited are data from OpenStreetMap, which are usually called **Data Layer 1**.
id: 4. Terakhir, ini penting untuk mengetahui bahwa Anda hanya dapat mengedit layer yang dianggap :guilabel:`Aktif` oleh JOSM. Jika Anda tidak dapat mengedit peta di dalam jendela peta Anda, ini mungkin karena Anda tidak memiliki layer yang aktif. Kebanyakan layer, seperti titik GPS, Field Papers, dan citra satelit tidak dapat diedit. Satu-satunya layer yang dapat diedit adalah data dari OpenStreetMap, yang biasa disebut **Data Layer 1**

source: To make a layer active, select it in the :guilabel:`Layers` panel, and click on the :guilabel:`Activate` button:
id: Untuk mengaktifkan suatu layer, pilih nama layer Anda pada panel :guilabel:`Layer`, kemudian klik tombol :guilabel:`Aktifkan`:

source: Tag is just like a label that you put to an object. For instance, if we add an object in some area and that object is a mosque and its name is **Masjid Raya Sabilal Muhtadin**; amenity that we can use is **place of worship** and mosque as we know, is Muslim place of worship. Therefore, you can add a **religion=Muslim** tag to the mosque as well as any other information you can supply about that object. The tag will be saved as text, specifically as a **key** and **value** combination. In OpenStreetMap, you can see all information about an objects in properties panel at right side of your JOSM window as shown in the figure below.
id: Sebuah tag adalah seperti sebuah label yang Anda dapat letakkan ke suatu objek. Misalnya, jika kita menambahkan sebuah objek di beberapa area dan objek adalah sebuah masjid dan itu bernama **Masjid Raya Sabilal Muhtadin**; amenity adalah **place of worship** dan masjid merupakan tempat ibadah umat muslim. Anda dapat menambahkan **religion=Muslim** untuk masjid sebagai informasi lain yang Anda inginkan ke sebuah objek. Tag disimpan sebagai sepasang teks, terutama sebagai sebuah **key** dan **values**. Di OpenStreetMap, Anda dapat melihat semua informasi tentang sebuah objek di panel properti di sebelah kanan dari jendela JOSM seperti ditunjukkan pada gambar di bawah ini.

source: *Example Tag of object in JOSM*
id: *Contoh Tag dari Objek di JOSM*

source: Editing Tags
id: Mengedit Tags

source: You can add, edit, and remove tags directly from properties panel. But, tags are automatically defined in English and sometimes it is confusing especially if you do not understand English. Hence, non-English speakers may find it is easier to manage tags using a Preset Menu. Needless to say, when you add or edit tag, the attribute of object will be change as well.
id: Anda dapat menambah, mengedit, dan menghapus tag dari panel Properties. Namun, tag secara manual dalam bahasa Inggris dan kadang-kadang dapat membingungkan terutama jika Anda tidak mengerti bahasa Inggris. Oleh karena itu, Anda lebih mudah mengatur tags menggunakan sebuah menu Presets. Ketika Anda menambah atau mengubah tag, atribut objek akan berubah.

source: To edit tag of an object, first **select the object**.
id: Untuk mengedit tag objek, pertama **pilih ob­jeknya**.

source: You can edit the tag either: (1) **Using Presets Menu**, or (2) **Edit Directly** in properties windows at right side of your JOSM.
id: Anda dapat mengedit tag: (1) **Menggunakan Menu Presets**, (2) **Mengedit tag secara langsung** di jendela Properties di sebelah kanan dari JOSM Anda.

source: 5.3.4 Save Changes
id: 5.3.4 Menyimpan Perubahan
