Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/osm/Chapter-05-editing-with-josm.po
Languages: id

source: Chapter 5: Editing with JOSM
id: Bab 5: Mengedit dengan JOSM

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Using the editing tools in JOSM
id: Dapat menggunakan alat (tool) edit di JOSM

source: Knowing the shortcut buttons in JOSM
id: Mengetahui tombol-tombol pintas di JOSM

source: Extending functionality with JOSM plug-ins
id: Mengetahui plugin-plugin di JOSM

source: Familiarity with errors and editing tips
id: Mengetahui kesalahan-kesalahan serta tips-tips mengedit

source: Knowing and understanding the stages of editing in JOSM
id: Mengetahui dan memahami tahapan-tahapan mengedit di JOSM

source: Saving OSM file
id: Dapat menyimpan file OSM

source: In a previous session, you have already installed and configured JOSM as well as master basic operations in JOSM such as drawing points, lines, and polygons. You also used menu presets to add attributes to an object you created on the map. Finally, you are to the point where you can digitize and edit features on the map using JOSM.
id: Pada sesi sebelumnya Anda telah menginstal JOSM dan mempelajari bagaimana operasi-operasi dasar di JOSM seperti menggambar titik. garis, dan poligon. Anda juga telah dapat menambah preset ke objek yang Anda buat untuk melampirkan informasi mengenai objek tersebut . Pad aakhirnya, Anda dapat menggambar peta Anda sendiri di JOSM.

source: In this session, we will look closely at the JOSM interface and learn how to stage the map editing process in JOSM and also how to maximize the tools that exist in JOSM.
id: Pada sesi ini kita akan melihat lebih dekat pada antarmuka JOSM dan juga bagaimana kita bisa memaksimalkan beberapa alat yang ada di JOSM untuk membantu kita dalam melakukan editing.

source: 5.1 Editing tools in JOSM
id: 5.1 Tools Editing di JOSM

source: In this section, we build on our command of basic tools and techniques to draw map features in JOSM and look closely at some advanced drawing tools. To follow along with this section and practice using advanced JOSM tools, please download in `Edit tools <http://bit.ly/edittools>`_ then open JOSM and point to the edittools package. It will look like the figure below:
id: Di sini kita akan melihat beberapa tool dasar dan teknik yang ada untuk menggambar fitur di JOSM, dan pada bab berikut kita akan melihat lebih dalam untuk tool menggambar lanjutan. Jika Anda suka untuk mengikuti dan mempraktikkan penggunaan tool JOSM, silahkan Anda download di `Edit tools <http://bit.ly/edittools>`_ kemudian buka JOSM dan file yang telah didownload. Ini akan terlihat seperti ini:

source: *The display of editing file in JOSM*
id: *Tampilan file latihan mengedit di JOSM*

source: 5.1.1 Drawing Tools
id: 5.1.1 Alat Menggambar

source: JOSM has some additional tools to make it easier to create high quality lines and polygons. These tools are found in the :guilabel:`Tools` menu at the top of JOSM. A quick glance reveals many functions that can help when drawing lines and polygons, and editing objects on the map. We discuss the most important of those tools in this section.
id: JOSM memiliki beberapa tool tambahan yang menjadikan pembuatan garis dan poligon dengann kualitas tinggi lebih mudah. Tool ini dapat ditemukan dalam menu :guilabel:`Alat` di bagian atas JOSM. Anda juga dapat melihat terdapat banyak fungsi lainnya yang dapat membantu Anda menggambar garis, poligon, dan mengedit objek pada peta. Kita akan mendiskusikan alat-alat paling enting pada sesi ini.

source: **Options in JOSM Tools Menu**
id: **Pilihan yang ada di Menu Alat pada JOSM**

source: In applying the functions in this menu, you first must select a point, line or polygon in the map window. The sample file you already downloaded contains various elements that are labeled the names of different tools on the menu.
id: Dalam mengaplikasikan fungsi dalam menu ini, Anda terlebih dahulu harus memilih sebuah titik, garis, atau poligon pada jendela peta. File contoh yang berisi macam elemen yang berlabelkan nama tool yang berbeda-beda di dalam menu.

source: Try to select one of the elements in the file. Then go to the :guilabel:`Tools` menu and click on the function identified on the feature you have selected.
id: Cobalah memilih salah satu elemen di file tersebut. Kemudian pergi ke menu :guilabel:`Alat` dan klik fungsi yang diidentifikasi di sebelah fitur yang Anda pilih.

source: For example, click on the asymmetric circle.
id: Sebagai contoh, klik pada lingkaran yang tidak beraturan untuk memilihnya.

source: Next go to the :menuselection:`Tools ‣ Align Nodes in Circle`
id: Selanjutnya, klik :menuselection:`Alat ‣ Sejajarkan Node Membentuk Lingkaran`

source: The irregular circle will be aligned and symmetrical.
id: Lingkaran yang tidak beraturan akan menjadi lebih simetris.

source: Experiment with each of the tools using this sample file. A description of some of the tools is provided below.
id: Percobaan dengan masing-masing tool menggunakan file contoh ini. Penjelasan mengenai beberapa tool lainnya disediakan di bawah ini.

source: **Split Way:** This allows you to divide a way into two separate ways. This is useful if you want to add the attribute to the different road, such as bridge. To use this function, select a point in the middle of way that you want to cut, then select **Split Way** from the :guilabel:`Tools` menu, and your way should be split into two ways.
id: **Split Way/Memisahkan garis/way:** Memungkinkan Anda untuk membagi sebuah garis menjadi dua garis terpisah. Ini berguna jika Anda ingin menambahkan atribut ke bagian jalan yang berbeda, seperti jembatan. Untuk menggunakan fungsi ini, pilih sebuah titik di tengah garis yang ingin Anda potong, kemudian pilih :guilabel:`Memisahkan garis/way` dari menu :guilabel:`Tools`, dan garis Anda seharusnya akan terpotong menjadi dua.

source: **Combine Way:** This is **the opposite of Split Way**. To combine two ways into one way, they have to share a single point. To use this function, select the way you want to combine. You can select more than one object by holding the **SHIFT** button on your keyboard and click on each way. When you have selected the both of the ways, select :menuselection:`Tools ‣ Combine Way`.
id: **Combine Ways/Menggabungkan garis/way:** Ini merupakan **kebalikan dari Split Way**. Untuk menggabungkan dua garis menjadi satu garis, mereka harus berbagi satu titik. Untuk menggunakan fungsi ini, pilih kedua garis yang ingin Anda gabungkan. Anda dapat memilih lebih dari satu objek dengan menahan tombol **SHIFT** pada keyboard Anda dan mengklik di setiap garisnya. Ketika Anda memilih kedua garis tersebut, pilih :menuselection:`Tools ‣ Menggabungkan garis/way`.

source: *The result of the combine way operation in JOSM*
id: *Hasil menggabungkan garis/way di JOSM*

source: That if you want to combine ways that have different directions, you will see this warning:
id: Jika Anda ingin menggabungkan jalan yang memiliki arah yang berbeda, Anda akan mendapatkan peringatan seperti ini:

source: If the ways are connected, they can be aligned in the same direction by selecting :guilabel:`Reverse and Combine`.
id: Jika jalan sudah terhubung, dan ingin berada pada arah yang sama, caranya dengan klik :guilabel:`Reverse and Combine`.

source: **Reverse Way**: This will change the direction of a way. All ways in OSM have a direction, shown in JOSM with an arrow pointing in the direction of alignment. Direction is usual not a problem, except in cases where the one way roads and river that flow in a certain direction. In this case, you need to reverse the way so that it flows in the right direction.
id: **Reserve Way/Membalikkan Jalur-Jalur**: Hal ini akan mengubah arah pada garis. Semua garis di dalam OSM memiliki sebuah arah, yang ditunjukkan di dalam JOSM dengan panah pada garis. Arah biasanya bukan masalah, kecuali pada kasus dimana jalan satu arah dan sungai yang mengalir dalam arah tertentu. Pada kasus ini Anda mungkin perlu membalikkan jalan sehingga garis tersebut dalam arah yang benar.

source: **Simplify Way**: If your way has too many points in it and you want to make it simpler, this operation will remove some points from a way without adversely affecting the shape.
id: **Simplify Way/Sederhanakan Jalur**: Jika garis Anda memiliki terlalu banyak titik di dalamnya dan Anda ingin membuatnya lebih sederhana, alat ini akan menghapus beberapa titik dari sebuah garis tanpa mempengaruhi bentuk .

source: *The example of ways which will be simplified in JOSM*
id: *Contoh garis yang akan disederhanakan di JOSM*

source: **Align Nodes in Circle**: If you try to make a circle, you draw a circle as best you can then select the object. This function will help distribute the points to make a perfect circle.
id: **Align Nodes in Circle/Sejajarkan Node Membentuk Lingkaran**: Jika Anda mencoba membuat sebuah bentuk lingkaran, gambarlah semampu Anda dan kemudian pilih objeknya. Fungsi ini akan membantu mengatur titik-titik untuk membuat lingkaran yang sempurna.

source: **Create Circle**: Alternatively, you can use this tool, it will make a perfect circle. Draw a way that represents the diameter of your circle.
id: **Create Circle/Buat Lingkaran**: Sebagai alternatif, Anda dapat menggunakan tool ini, tool ini akan membuat lingkaran yang sempurna. Menggambar sebuah garis yang mewakili diameter dari lingkaran Anda.

source: **Align Nodes in Line**: This function will align a series of points into a straight way. With long ways it is best to select sections of the line to straighten. Be careful as this does have the tendency to shift the line a little bit.
id: **Align Nodes in Line/Sejajarkan Node dalam Garis**: Fungsi ini akan menyelaraskan rangkaian titik menjadi garis lurus. Sebaliknya dengan garis yang panjang untuk memilih bagian dari garis yang akan diluruskan hati-hati karena hal ini memiliki kecenderungan untuk pergeseran garis walaupun sedikit.

source: *The Concept of Making A Way That Turned into A Straight*
id: *Konsep membuat garis yang berbelok menjadi garis lurus*

source: **Orthogonalize Shape**: This function is more useful to draw a regular shape such as building. After you draw an area, this function will reshaped it to have square corners.
id: **Orthogonalize Shape/Ortogonalisasi Bentuk**: Fungsi ini sangat berguna untuk menggambar bentuk teratur seperti bangunan. Setelah Anda menggambar sebuah area, fungsi ini akan membentuk kembali menjadi sudut-sudut persegi.

source: *The concept of perfect the shape of polygon*
id: *Konsep menyempurnakan bentuk poligon*

source: **Unglue way**: This tool allows you to detach the nodes that are connected. For example, the common error is for a road shares the point with the corner of a building. Of course roads don’t run into buildings usually, so this is a mistake, and you can unglue the objects from one another.
id: **Unglue Way/Memisahkan titik atau garis**: Tool ini memungkinkan Anda untuk melepaskan titik-titik yang terhubung. Sebagai contoh, kesalahan yang sering terjadi adalah jalan yang menempel dengan titik di sudut bangunan. Tentu saja jalan tidak bergabung dengan bangunan, sehingga ini adalah kesalahan, dan Anda dapat melepaskan objek satu dengan yang lain.

source: The common question is how to rotate a way or a polygon after the object was drew.
id: Sebuah pertanyaan umum adalah bagaimana memutar sebuah garis atau poligon setelah objek tersebut tergambar.

source: To rotate an object, first you need to select the object
id: Untuk memutar sebuah objek, pertama pilih objeknya.

source: Hold :kbd:`SHIFT+CTRL` in your keyboard
id: Tahan :kbd:`SHIFT+CTRL` pada keyboard Anda

source: Click and drag the mouse to rotate
id: Klik dan geser mouse untuk memutar

source: *The concept of rotating an object in JOSM*
id: *Konsep untuk memutar objek di JOSM*

source: 5.1.2 Keyboard Shortcuts
id: 5.1.2 Tombol Pintas di Keyboard

source: After editing in OpenStreetMap, you will realize that you are spending a lot of time with each click on the menu and submenu. To overcome this, JOSM has a shortcut button that substitutes the lengthy menu process. You can simply select the object directly and press the button in your keyboard. Here are the most important shortcut keys.
id: Setelah melakukan editing di OpenStreetMap, Anda akan menyadari bahwa Anda banyak membuang waktu untuk mengklik pada menu dan submenu. Untuk mengatasi hal ini, JOSM memiliki tombol pintas keyboard untuk mengganti proses menu yang panjang. Anda dapat memilih objek langsung dan menekan sebuah tombol pada keyboar Anda. Disini ada beberapa tombol pintas lain yang sering digunakan.

source: Select Tool
id: Pilih Objek

source: Draw Tool
id: Gambar Node

source: Remove Object
id: Hapus Objek

source: Zoom In
id: Perbesar

source: Zoom Out
id: Perkecil

source: 5.1.3 JOSM Plugins
id: 5.1.3 Plugin di JOSM

source: After you have acquired some skill in editing the map, you may want to use the additional JOSM features to improve your mapping skills. JOSM allows you to install various plugins, extending the functionality of the software. In this session, we will look some of the more useful plugins that exist for JOSM.
id: Ketika Anda sudah bisa terampil dalam mengedit peta Anda, Anda mungkin ingin menggunakan fitur JOSM tambahan untuk meningkatkan keterampilan pemetaan Anda. JOSM memungkinkan Anda untuk menginstal berbagai plugin, kemudian menambahkan fungsi tambahan ke perangkat lunak. Pada sesi ini kita akan melihat beberapa plugin yang sangat berguna yang sudah tersedia di JOSM.

source: **buildings_tools**: If you draw a lot of buildings, this tool will make the process faster and easier. **Building Tools Plugin** is useful to digitize the building. It allows you to digitize one side of square building and extend the shapes with ease, saving mouse clicks and saving time. After the plugin is installed, you will see the new button in left side of JOSM, that look like this:
id: **buildings_tools**: Jika Anda menggambar banyak bangunan, ini akan membuat proses menggambar lebih cepat dan mudah. **Plugin Building Tools** sangat membantu untuk digitalisasi bangunan. Ini memungkinkan Anda untuk mendigitasi satu sisi bangunan persegi, dan dengan mudah memperpanjang bentuk. Jika Anda mendijitasi banyak bangunan, plugin ini akan menghemat klik, dan menghemat waktu Anda. Setelah plugin terinstal Anda akan melihat tombol baru di bagian sisi kiri JOSM, yang terlihat seperti ini:

source: Open JOSM and make a new layer
id: Buka JOSM dan membuat layer kosong baru

source: Select :guilabel:`building_tools` and double click to draw a way on the map
id: Pilih :guilabel:`building_tools` dan klik ganda untuk menggambar sebuah garis pada peta

source: Then drag your mouse and click again to draw a square as shown in the figure below
id: Kemudian geser mouse Anda dan klik kembali untuk menggambar sebuah persegi seperti gambar dibawah ini

source: *The process of drawing a building with building tools plugin*
id: *Proses menggambar bangunan dengan building tools*

source: The tool not only creates a square with a triple click, but it also will automatically apply the **building=yes** tag into the polygon.
id: Ini tidak hanya membuat sebuah persegi panjang dengan tiga kali klik, tetapi juga akan secara otomatis menerapkan tag **building=yes** ke poligon.

source: **Creating Complex Buildings**
id: **Membuat Bangunan Kompleks**

source: You can also create building more complicated buildings by first drawing some overlapping buildings and merging them together.
id: Anda juga dapat membuat bangunan yang lebih rumit dengan terlebih dahulu menggambar beberapa overlap dan kemudian menggabungkan mereka bersama-sama.

source: Draw two buildings which overlap, so that they form a L shape.
id: Menggambar dua bangunan yang overlap, sehingga mereka berbentuk L.

source: Select both buildings (hold :kbd:`SHIFT` to select more than one object).
id: Pilih kedua bangunan (tahan :kbd:`SHIFT` untuk memilih lebih dari satu objek).

source: Go to :menuselection:`Tools > Join overlapping areas` or hold :kbd:`SHIFT+J` in your keyboard.
id: Pergi ke :menuselection:`Tools > Gabungkan area yang tumpang tindih` atau tekan :kbd:`SHIFT+J` pada keyboard Anda.

source: **DirectUpload:** If you collect a lot of GPS tracks and you want to save to the OSM database, this plugin will make it easier for bulk uploads.
id: **Direct Upload:** Jika Anda mengumpulkan banyak trek GPS dan Anda ingin menyimpannya di database OSM, plugin ini akan mempermudah Anda.

source: **editgpx**: If you want to upload the GPS track from Garmin device, you may need to use this plugin. Due to a technical glitch, OSM will not receive GPS track that have been saved on an external memory card in Garmin, but this plugin can fix the file so they can be uploaded.
id: **editgps:** Jika Anda ingin mengupload trek GPS dari perangkat Garmin, Anda mungkin perlu menggunakan plugin ini. OSM tidak akan menerima trek GPS yang telah disimpan pada kartu memori eksternal di Garmin, tetapi plugin ini dapat memperbaiki file sehingga mereka dapat diupload.

source: **fieldpapers**: This plugin loads Field Papers that have been scanned in JOSM.
id: **fieldpapers**: Plugin ini memuat Field Papers yang telah discan di dalam JOSM.

source: **imagery_offset_db**: This plugin for mappers who discover areas where the Bing satellite imagery is not aligned. This will be explained in more detail in the next chapter.
id: **imagery_offset_db**: Plugin ini bekerja sama dengan pembuat peta yang menemukan citra satelit Bing yang tidak sejajar. Masalah ini dibahas lebih detail dalam bab selanjutnya.

source: **mirrored_download**: With this plugin, you can download OSM data with a wider area to edit.
id: **mirored_download**: Dengan plugin ini, Anda dapat mendownload data OSM dengan area yang lebih luas untuk mengedit.

source: **print**: To add Print function, if you want to print an area quickly and where it need not look very good.
id: **print**: Menambahkan fungsi Print, Jika Anda ingin mencetak sebuah area dengan cepat dan tidak perlu terlihat sangat baik.

source: **utilsplugin2**: To add additional tools and menus in JOSM.
id: **utilsplugin2**: Menambahkan banyak tool tambahan dan menu pada JOSM.

source: If you haven’t done so already, install the plugin shown in the figure below following the instructions for `JOSM Plugins <http://learnosm.org/bi/editing/josm-plugins>`__.
id: Jika Anda belum selesai, berikut instruksi cara menginstal plugin ini di JOSM Plugin <http://learnosm.org/bi/editing/josm-plugins>`__.

source: *The display of utilsplugin 2*
id: *Tampilan dari tilsplugin 2*

source: After you install this plugin and restart JOSM, you will have a new menu at the top of JOSM labeled :guilabel:`More Tools` as shown in the figure below.
id: Setelah Anda menginstall plugin ini dan restart JOSM, Anda akan memiliki sebuah menu baru di atas yang bernama :guilabel:`More Tools` seperti ditunjukkan gambar di bawah.

source: *The option of more tools menu in JOSM*
id: *Pilihan menu more tools di JOSM*

source: Create new layer and experiment with some of the new tools. We will explain some of the new tools that are very useful:
id: Membuat layer baru dan berlatih dengan beberapa tools baru. Kita akan menjelaskan beberapa dari tools baru yang sangat berguna:

source: **Add Nodes at Intersections**: This tool is very useful to add a missing node in the selected way intersections. It’s good practice that the way should have common nodes where they intersect.
id: **Add Node at Intersections**: Tambah node atau titik di persimpangan: Tool ini sangat berguna untuk menambahkan titik yang hilang di persimpangan garis yang terpilih. Ini baik untuk dipratekkan bahwa jalan seharusnya selalu memiliki titik di mana mereka berpotongan.

source: *Adding node at intersections*
id: *Menambahkan node/titik di persimpangan*

source: **Copy Tags from Previous Selection**: This function is very useful for copying a tag easily. Suppose you want to create a lot of objects with the same tagging scheme. Click on an object with the tagging scheme you want to apply and press :kbd:`SHIFT+R` to copy a tag from the previously selected object. You can repeat this process for all objects that you want to apply a tag. Remember that the tags will be copied from the previously selected object, so if you click on an object that has not been tagged the copy function will have no effect..
id: **Copy Tags from Previous Selection/Salin tag dari pilihan sebelumnya**: Fungsi ini sangat berguna untuk menyalin sebuah tag dengan mudah. Jika Anda ingin membuat banyak objek dengan tag yang sama. Klik pada objek yang lain dan tekan :kbd:`SHIFT+R` untuk menyalin tag dari objek yang dipilih sebelumnya. Anda dapat melakukan ini untuk semua objek yang ingin Anda beri tag. Ingatlah bahwa tag akan disalin dari objek yang terpilih sebelumnya, jika Anda mengklik pada objek yang belum diberi tag, maka fungsi ini tidak dapat berjalan.

source: *Copying tag from the selected building*
id: *Menyalin tag dari bangunan yang dipilih*

source: **Add Source Tag**: This tool simplifies adding a source tag, given that the last specified source will be added as source tag to your object. You can insert source with just one click.
id: **Add Source Tag/Tambahkan tag sumber**: Tool ini untuk menyederhanakan dalam menambahkan sumber tag, ini mengingat bahwa sumber yang ditentukan terakhir dan menambahkannya sebagai sumber data ke objek Anda. Anda dapat memasukkan sumber dengan hanya mengklik satu kali.

source: **Replace Geometry**: This tool is very good if you want to improve the drawing of an object, but retain the history, the attribute and the object ID. Example, if you find a complex building drawn in a way that is not appropriate, you can draw the object again, select the old object and new object, select :guilabel:`Replace Geometry` to transfer all of the above information.
id: **Replace Geometry/Ganti Geometri**: Tool ini sangat berguna jika Anda ingin memperbaiki gambar objek, tetapi riwayat, atribut, dan objek ID tersebut tetap tidak berubah. Contohnya, Jika Anda menemukan sebuah bangunan yang rumit dan digambarkan dengan cara yang tidak sesuai, maka untuk mengubah setiap titiknya, Anda dapat menggambar objeknya kembali, memilih objek lama dan baru, dan pilih guilabel:`Ganti Geometri`, untuk mentransfer semua informasi di atas.

source: *Replace Geometry in JOSM*
id: *Mengganti bentuk objek di JOSM*

source: **Selection**
id: **Tool Selection**

source: Utilsplugin2 also provides a lot of tools in :guilabel:`Selection` menu. Try experimenting with each of these tools.
id: **Utilsplugin2** juga menyediakan lebih banyak tool pada menu :guilabel:`Selection`. Cobalah bereksperimen dengan tool tersebut.

source: *The display of menu in selection tools*
id: *Tampilan menu tools Selection*

source: One of the selection tools which we use frequently is **Unselect Nodes**: This tool deselects all points. This can be useful if you draw a square to select a lof of objects, but you don’t want to select a point that contains all the lines and polygons. An example is shown in the figure below.
id: Salah satu tool selection yang sering kita gunakan adalah **Membatalkan pilihan node/titik**: Tool ini membatalkan pilihan semua titik. Ini dapat berguna jika Anda menggambar kotak untuk memilih banyak objek, tetapi Anda tidak ingin memilih titik yang berisi semua garis dan poligon. Seperti ditunjukkan pada gambar di bawah ini

source: *The example cancel node in JOSM*
id: *Contoh membatalkan node/titik di JOSM*

source: 5.2 Editing Tips
id: 5.2 Tips Editing
