Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/osm/Chapter-02-getting-started.po
Languages: id

source: Chapter 2: Getting Started
id: Bab 2: Memulai OSM

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Navigating to the OpenStreetMap Website
id: Navigasi ke Situs OpenStreetMap

source: Know how to navigate OpenStreetMap (search, move, zoom in/zoom out)
id: Dapat mengoperasikan Situs OpenStreetMap (pencarian, menggeser, memperbesar/memperkecil)

source: Know how to export OpenStreetMap into image and changing layers
id: Dapat mengekspor OpenStreetMap ke dalam bentuk gambar dan mengubah tampilan layer peta

source: Know how to create an account in OpenStreetMap
id: Mengetahui cara untuk membuat akun OpenStreetMap

source: In this section we will learn step by step how to navigate the OpenStreetMap website, view maps, and sign up for a user account. After you have your OpenStreetMap account, you will be able to contribute your first points to the map.
id: Dalam sesi ini, kita akan mempelajari langkah demi langkah cara untuk menavigasikan situs OpenStreetMap, melihat serta mengoperasikan peta dan mendaftar untuk membuat akun OpenStreetMap. Setelah anda memiliki akun OpenStreetMap, anda dapat melakukan kontribusi seperti menambahkan objek ke dalam OpenStreetMap.

source: 2.1 Visit the OpenStreetMap Website
id: 2.1 Mengunjungi Situs OpenStreetMap

source: Before you begin, be sure your computer is connected to the internet. Then, follow these steps:
id: Sebelum anda memulai, pastikan komputer/laptop anda telah tersambung dengan koneksi internet. Kemudian, ikuti langkah-langkah berikut:

source: Open your web browser. Common browsers are Firefox, Chrome, Opera, or Internet Explorer.
id: Buka browser internet anda, seperti Firefox, Chrome, Opera atau Internet Explorer.

source: In the address bar at the top of your browser, type `www.openstreetmap.org <http://www.openstreetmap.org/>`__ and enter
id: Silakan ketik `www.openstreetmap.org <http://www.openstreetmap.org/>`__ di kolom alamat pada browser anda kemudian tekan enter

source: When the page has finished loading, you should see something like this:
id: Ketika halaman pada situs OpenStreetMap telah selesai dimuat, anda akan melihat tampilan seperti berikut:

source: *OpenStreetMap Interface*
id: *Tampilan OpenStreetMap*

source: 2.2 Navigate the Map
id: 2.2 Menavigasikan Peta

source: The main thing you should see is the map. Move the map by clicking on it with your left mouse button, holding the button down, and dragging your mouse around (see figure below).
id: Hal utama yang seharusnya Anda lihat adalah peta. Geser peta tersebut dengan mengklik peta kemudian tahan tombol tersebut, dan geser mouse Anda (lihat gambar di bawah).

source: *Some Tools in OpenStreetMap*
id: *Beberapa Alat di OpenStreetMap*

source: If you have mouse with scroll wheel, you can zoom in and zoom out your map using scroll wheel in your mouse. If you do not have, you can use :guilabel:`+` and :guilabel:`-` button at the top right corner on your map.
id: Jika Anda memiliki mouse dengan roda-gulir, anda dapat memperbesar dan memperkecil peta dengan menggunakan roda gulir tersebut. Jika tidak, anda dapat menggunakan tombol :guilabel:`+` and :guilabel:`-` yang berada di sudut kanan atas pada halaman peta anda.

source: *Navigation Instruction Using a Mouse*
id: *Petunjuk Navigasi Menggunakan Mouse*

source: To search for a place, left-click in the box labeled :guilabel:`search` on the left side of the page. Type name of your town or village and press Enter. A window should appear to the left of the map with the results of your search. Click on the location that looks like the one you want. The map will automatically re-center on the location chosen from the list.
id: Untuk melakukan pencarian suatu objek atau lokasi, klik pada kotak yang bertuliskan :guilabel:`Search` pada sisi kiri halaman peta. Ketik nama tempat atau objek yang Anda cari dan tekan :guilabel:`Enter`. Sebuah jendela akan muncul di sebelah kiri halaman peta dengan hasil pencarian Anda. Klik pada hasil yang paling sesuai dengan kriteria yang Anda cari. Peta secara otomatis akan menggeser ke lokasi yang Anda pilih.

source: *OpenStreetMap Search Result*
id: *Hasil Pencarian OpenStreetMap*

source: 2.3 View with Different Map Styles
id: 2.3 Melihat Beberapa Tampilan Peta

source: OpenStreetMap contains geographic data from all over the world. Although it is a single database, the data can be interpreted and styled in different ways. To see this in action, click the :guilabel:`layers` button at right side in your map window.
id: OpenStreetMap memiliki informasi data geografis dari seluruh dunia. Walaupun tersebut tersimpan dalam satu basis data, data OpenStreetMap dapat diinterpretasikan ke dalam beberapa tampilan. Untuk melihatnya, silahkan klik tombol :guilabel:`layers` di sisi kanan pada halaman peta anda.

source: *Layer Button to change layers in OpenStreetMap*
id: *Tombol Layer untuk mengubah tampilan OpenStreetMap*

source: Click on the different layer options for the map. Each layer has a different style. For instance, the Transport Map emphasizes transportation routes such as roads and bus stations, while the Humanitarian Map emphasizes public facilities such as schools, hospitals and government offices. All of these views are possible because of the structured data contained in the OSM database. See the figure below for a comparison of the Transport Map and the Humanitarian Map.
id: Silahkan klik pada beberapa pilihan layer pada peta. Setiap layer memiliki tampilan yang berbeda. Sebagai contoh, layer Peta Transportasi akan memperlihatkan rute transportasi untuk berbagai kendaraan seperti jalan dan halte bis, sedangkan layer Peta Humanitarian akan memperlihatkan berbagai fasilitas publik seperti sekolah, rumah sakit dan kantor pemerintah. Berbagai macam tampilan tersebut dapat ditampilkan karena struktur data yang dimiliki OpenStreetMap.

source: *(Top) Humanitarian (Bottom) Transport Map*
id: *(Atas) Peta Humanitarian (Bawah) Peta Transportasi*

source: 2.4 Export Map into Image
id: 2.4 Mengekspor Peta menjadi Gambar

source: In addition to changing the layers in OpenStreetMap, you also can export your map as an image. The steps are as follow:
id: Sebagai tambahan untuk mengganti tampilan layer OpenStreetMap, Anda juga dapat mengekspor peta tersebut ke dalam bentuk gambar. Berikut langkah-langkahnya:

source: Click the :guilabel:`Share` icon at your right side on your map window, as shown in the figure below:
id: Klik ikon :guilabel:`Share` di sisi kanan dari halaman peta Anda, seperti yang ditunjukkan dalam gambar di bawah ini:

source: *Share Button in OpenStreetMap*
id: *Tombol Bagi di OpenStreetMap*

source: After determining the area that want to be exported, tick :guilabel:`Set custom dimensions` box and adjust size of the area that you want to export. You also can change the scale.
id: Setelah menentukan area yang ingin ada ekspor, silahkan centang kotak :guilabel:`Set custom dimensions` dan atur luasan area yang ingin anda ekspor. Anda juga dapat menentukannya dengan mengatur skala peta.

source: When you are finished adjusting the size of the download area, click :guilabel:`download`
id: Ketika anda sudah selesai mengatur luasan area yang ingin Anda download, klik :guilabel:`download`

source: *Export Map in OpenStreetMap*
id: *Mengekspor Map di OpenStreetMap*

source: 2.5 Create an Account in OpenStreetMap
id: 2.5 Membuat Akun di OpenStreetMap

source: Now that you have seen what the main website looks like, youâ€™re now ready to learn how to create an account in OpenStreetMap and make your first additions to the map. The steps are as follows:
id: Sekarang Anda telah melihat dan menavigasikan tampilan dari situs OpenStreetMap, sekarang Anda telah siap untuk membuat akun di OpenStreetMap dan memberikan kontribusi anda untuk OpenStreetMap. Ikuti langkah-langkah berikut ini:

source: On the OpenStreetMap website, click :guilabel:`sign up` in the top right corner of the page.
id: Silahkan klik :guilabel:`sign up` di sudut kanan atas dari halaman situs OpenStreetMap.

source: You should see a new page that looks like the figure below:
id: Anda akan melihat sebuah halaman baru seperti ini:

source: *Interface to make account in OpenStreetMap*
id: *Tampilan membuat akun di OpenStreetMap*

source: There are five boxes on this page that you need to fill in to register an account with OSM.
id: Akan ada lima kolom di halaman tersebut yang wajib anda isi untuk dapat membuat akun di OSM.

source: Enter your :guilabel:`email address` in the first two boxes. You should enter the same email address in both boxes. Later, you will need to open your email to confirm your account with OpenStreetMap.
id: Masukkan :guilabel:`alamat email` anda di 2 kolom pertama. Silahkan masukkan email yang sama di 2 kolom tersebut. Setelah itu, anda nantinya butuh untuk membuka email tersebut untuk melakukan konfirmasi terhadap akun OpenStreetMap yang anda buat.

source: In the third box, enter the :guilabel:`username` that you would like to have. Your username will be unique to you, and you will not be able to choose a username that someone else has chosen, so be creative. If you try to enter something simple, like your first name, it is likely that someone has already claimed that name.
id: Pada kolom ketiga, silahkan masukkan :guilabel:`nama pengguna` yang anda inginkan. Nama pengguna anda harus unik dan anda tidak dapat memilih nama pengguna yang telah diambil oleh orang lain, jadi silahkan menjadi kreatif untuk membuat nama pengguna. Jika anda mencoba nama pengguna yang sederhana seperti nama depan anda, kemungkinan besar nama tersebut sudah dipakai oleh orang lain.

source: Enter a :guilabel:`new password` in the fourth and fifth boxes. Take care to enter the same password in both boxes. It does not need to be the same as the password for your email.
id: Masukkan :guilabel:`kata kunci` yang anda inginkan pada kolom keempat dan kelima. Hati-hati dalam memasukkan kata kunci tersebut dan pastikan anda memasukkan kata kunci yang salam di kedua kolom tersebut. Kata kunci yang anda gunakan dapat sama dengan kata kunci pada email anda atau bisa juga berbeda.

source: You may want to write down your OSM username and password. You will need it to log in later.
id: Anda harus menuliskan nama pengguna OSM dan kata kunci anda ketika ingin masuk lagi ke dalam situs OpenStreetMap

source: After you have completed all the boxes, click :guilabel:`Sign Up` at the bottom of the page.
id: Setelah anda selesai dalam mengisi semua kolom yang ada, klik :guilabel:`Sign Up` yang berada di bawah halaman situs.

source: Open a separate window or tab in your internet browser, and open your email.
id: Buka jendela atau tab baru di browser internet anda, dan silahkan buka email anda.

source: Enter your email address and your email password to open your email.
id: Masukkan alamat dan kata kunci email anda untuk membuka email anda

source: If everything was successful with your registration, you should see an email from OpenStreetMap in your inbox. Open the email. It should look like the image below. Click on the link that is identified below:
id: Jika registrasi Anda telah berhasil, Anda akan melihat email dari OpenStreetMap di kotak masuk email Anda. Kotak masuk Anda akan terlihat seperti gambar di bawah ini. Klik tautan yang disertakan dalam email tersebut seperti yang terlihat di bawah ini:

source: *Notification from OSM in your inbox*
id: *Pemberitahuan dari OSM di Kotak Masuk email anda*

source: A new tab or window will open. You now have an OSM account!
id: Sebuah tab atau jendela baru akan terbuka. Anda sekarang telah memiliki akun OSM!

source: On the OpenStreetMap page, click :guilabel:`Sign Up` in the top right corner. Enter your OpenStreetMap username and password and press Enter. You should now be logged in. You should see your username in the upper right corner of the page.
id: Pada halaman OpenStreetMap, klik :guilabel:`Sign Up` yang berada di sudut kanan atas. Masukkan nama pengguna OpenStreetMap dan kata kunci Anda kemudian tekan enter. Anda akan masuk ke dalam akun OSM Anda dan anda akan melihat nama pengguna Anda di sudut kanan atas pada halaman situs OpenStreetMap.

source: If there are any problems, an error message may pop up. Check top make sure that your email is the same in the first two boxes, and your password is the same in the bottom two boxes. If the third box is highlighted red, it means that someone else has already chosen your username, and you should try a different name.
id: Jika Anda menemukan masalah saat akan masuk ke akun Anda, sebuah pesan kesalahan akan muncul. Pastikan alamat email Anda sama dengan kotak pertama, dan kata sandi Anda sama dengan dua kotak dibawah. Jika kotak ketiga ditandai berwarna merah, itu berarti seseorang telah memilih nama pengguna Anda, dan Anda harus mencoba nama yang berbeda.

source: Summary
id: Ringkasan

source: Congratulations! If all went as expected, you have your own OpenStreetMap account and you know how to navigate the OSM website. In next chapter, we will learn how to add our data into OpenStreetMap using online editor called iD Editor.
id: Selamat! Anda telah berhasil membuat akun OpenStreetMap dan Anda sudah dapat mengedit OpenStreetMap. Sekarang kita akan belajar menambahkan data dan mengedit menggunakan sebuah editor yang berjalan di browser yang dinamakan iD Editor

source: :ref:`Go to next chapter --> <ch3-introducing-the-id-editor>`
id: :ref:`Lihat bab selanjutnya --> <ch3-introducing-the-id-editor>`
