Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/osm/Chapter-07-field-papers.po
Languages: id

source: Chapter 7: Field Papers
id: Bab 7: Field Papers

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: How to use Field Papers
id: Memahami bagaimana cara kerja Field Papers

source: Make and print Field Papers
id: Membuat dan mencetak Field Papers

source: Add data to print using Field Papers
id: Menambahkan data untuk dicetak dengan menggunakan Field Papers

source: Scan and upload Field Papers to Field Papers website
id: Melakukan scan dan upload Field Papers ke situs Field Papers

source: Open Field Papers into JOSM
id: Membuka Field Papers ke dalam JOSM

source: In this module we will see how we can record the coordinates of places without a GPS. We will use a paper-based tool called Field Papers, which allows you to print a map of an area, draw on it, add notes, and load the paper back into JOSM, where you can add your locations to OpenStreetMap.
id: Pada bab ini kita akan melihat bagaimana kita dapat merekam koordinat suatu tempat tanpa menggunakan GPS. Kita akan menggunakan sebuah alat bernama Field Papers, yang memungkinkan Anda untuk mencetak peta suatu wilayah, menggambar di dalamnya, menambahkan catatan, dan membuka kertas tersebut di dalam JOSM, dimana Anda dapat menambahkan lokasi Anda ke OpenStreetMap.

source: 7.1 Overview of Field Papers
id: 7.1 Gambaran Field Papers

source: Before going into detail about Field Papers, let’s look at a general overview of how the Field Papers process works:
id: Sebelum kita mempelajari lebih jauh tentang Field Papers, mari kita lihat gambaran bagaimana Filed Papers bekerja:

source: Locate the area of interest you want to map on the Field Papers website. Create a map for the area of interest. Print out a map of this area. You can choose to print the area of interest using the default OpenStreetMap backdrop, or you may choose to print aerial imagery, if it is a available in your area.
id: Carilah wilayah yang Anda ingin petakan di dalam situs Field Papers. Buatlah peta untuk wilayah itu. Anda dapat memilih untuk mencetak peta tersebut dengan latar belakang OpenStreetMap atau Anda dapat mencetak dengan latar belakang citra satelit, jika citra tersebut tersedia di wilayah Anda.

source: *Interface Field Papers*
id: *Tampilan Awal Field Papers*

source: Use your printed map to survey the area. Add more places by drawing them on the map. Draw lines for roads, shapes for buildings, and so forth. Write notes about each location directly on the map, or write numbers on the map that relate to numbers in your notebook, where you can write more detailed information about each object.
id: Gunakan Field Papers yang telah dicetak untuk melakukan survey pada wilayah Anda. Tambahkan lebih banyak tempat dengan menggambarnya di atas peta. Gambarlah garis untuk jalan, poligon untuk bangunan, dan seterusnya. Menulis catatan setiap lokasi secara langsung pada peta, atau menulis angka pada peta untuk menghubungkan gambar dengan kode pada catatan, dimana Anda dapat menulis informasinya lebih rinci pada setiap objeknya.

source: Scan your paper into the computer. If you do not have a scanner, you can take a photograph of the paper, if your camera is able to take high quality pictures. Upload the image to the Field Papers website.
id: Scan Field Papers Anda ke dalam komputer. Jika Anda tidak memiliki sebuah scanner, Anda dapat mengambil foto Field Papers tersebut, jika kamera Anda dapat mengambil gambar dengan resolusi tinggi. Upload gambar ke situs Field Papers.

source: *Field Papers Image*
id: *Foto Field Papers*

source: In JOSM, load the Field Papers. Use the objects you drew as a reference to add the digitally into OpenStreetMap.
id: Pada JOSM, tambahkan Field Papers. Gunakan objek - objek yang telah Anda gambar sebagai acuan untuk menambahkan secara digital ke dalam OpenStreetMap.

source: *Interface Field Papers in JOSM*
id: *Tampilan Field Papers di JOSM*

source: 7.2 How does Field Papers Work?
id: 7.2 Bagaimana Field Papers Bekerja?

source: If you follow the Field Papers process described above, you will be collecting accurate geographic coordinate of places with nothing more than paper. How is this possible?
id: Jika Anda mengikuti bagaimana cara kerja Field Papers, sebagaimana dijelaskan di atas, Anda akan mengumpulkan koordinat geografis dari suatu tempat dengan akurat hanya dengan menggunakan kertas. Bagaimana mungkin?

source: When you print a Field Papers, the paper comes with a square barcode on the bottom of the page. This barcode allows Field Papers to determine the exact location of the map that you are using to survey. Later, when you load the paper back into JOSM, all the objects that you drew will be in shown relative to their actual locations. This is same with you using GPS for collecting actual coordinates, except all you need is paper!
id: Ketika Anda mencetak sebuah Field Paper, kertas tersebut dengan sebuah barcode di bagian bawah halaman. Barcode ini memungkinkan Field Papers untuk menentukan lokasi yang akurat dari peta yang Anda gunakan untuk survey. Selanjutnya, ketika Anda menambahkan Field Papers ke dalam JOSM, semua objek yang Anda gambar akan ditampilkan pada lokasi sebenarnya. Hal ini seperti menggunakan GPS untuk mengumpulkan koordinat yang tepat, kecuali semua yang Anda butuhkan adalah kertas!

source: Now let’s learn how to create and use Field Papers.
id: Sekarang mari belajar bagaimana membuat dan menggunakan Field Papers.

source: 7.3 Create and Print Field Papers
id: 7.3 Membuat dan Mencetak Field Papers

source: Open your web browser. In the address bar at the top of the window, enter `http://fieldpapers.org/ <http://fieldpapers.org>`_ and press :kbd:`Enter`
id: Buka browser internet. Pada kolom alamat situs di bagian atas jendela, masukkan teks `http://fieldpapers.org/ <http://fieldpapers.org>`_ dan tekan :kbd:`Enter`

source: The website should look something like the figure below:
id: Situs seharusnya terlihat seperti ini:

source: Click :guilabel:`Make yourself an Atlas` to select the area that you want print out.
id: Klik :guilabel:`Buat atlas anda sendiri` untuk memilih wilayah yang ingin Anda cetak.

source: *Make Field Papers*
id: *Membuat Field Papers*

source: You will be directed to a page like this where you can see there are some setting at left panel and main map at the right.
id: Anda akan diarahkan ke sebuah halaman seperti berikut dimana anda dapat melihat beberapa pengaturan pada panel di sisi sebelah kiri dan peta utama di sebelah kanan.

source: *Compose Field Papers*
id: *Membuat Field Papers*

source: On the main map, to find the area that you want to map, you can click search button and type the location name OR you can drag manually the map with the same way when you drag map in OpenStreetMap website, use the left button your mouse for drag map, and scroll your mouse for zoom in and zoom out. Click on :guilabel:`+` and :guilabel:`-` buttons in the upper left corner for zoom in and zoom out.
id: Pada peta, arahkan ke area / lokasi yang ingin Anda survei, Anda dapat klik tombol pencarian dan ketikkan nama lokasi ATAU Anda dapat menggeser peta secara manual seperti yang Anda lakukan di peta situs OpenStreetMap, gunakan tombol klik kiri pada mouse Anda untuk menggeser dan gulirkan roda di mouse Anda untuk memperbesar dan memperkecil peta. Klik tombol :guilabel:`+` and :guilabel:`-` di pojok kiri atas untuk memperbesar dan memperkecil.

source: *Setting the area in Field Papers*
id: *Mengatur Wilayah di Field Papers*

source: Here you also can define the boundaries of your Field Papers. The boundaries is displayed as hollow box with black border. You want to make sure that the window displays the area of interest that you intend to map. You can add more page or less page. Make sure that your map can display building and road for field survey.
id: Anda juga dapat menentukan batas dari Field Papers Anda. Batas wilayah yang ditampilkan berupa kotak transparan berwarna dengan sisi batas berwarna hitam. Pastikan bahwa jendela peta menampilkan seluruh area yang ingin anda survei. Anda dapat menambahkan halaman atau mengurangi halaman sesuai dengan kebutuhan anda. Pastikan bahwa Field Papers anda sudah menampilkan bangunan dan jalan untuk membantu anda melakukan survei lapangan.

source: *Setting the page in Field Papers*
id: *Mengatur Halaman di Field Papers*

source: At the left panel are some setting for print out Field Papers. The first is give information to your atlas by type a name on the **Atlas Title** column. If you want, you can add notes to be printed on the map, such as questions you want to remember to answer or specific places you want to identity by give a check mark on **Print notes** and type your notes on the **Notes** column.
id: Pada panel di sebelah kiri terdapat beberapa pengaturan untuk mencetak Field Papers. Pertama memberikan informasi tentang field papers Anda dengan memasukkan nama Field Papers anda pada kolom **Atlas Title**. Jika ingin, Anda dapat menambahkan catatan di field papers yang ingin anda cetak, seperti pertanyaan yang ingin anda ingat untuk dijawab atau tempat spesifik yang ingin anda tandai dengan memberikan tanda ceklis pada **Print notes** dan ketik catatan anda di kolom **Notes**

source: *Setting atlas information in Field Papers*
id: *Pengaturan Informasi Atlas di Field Papers*

source: The second is the Grid Layout setting. The **Paper Size** is used to adjust the paper size that you want use for print out Field Paper. You can choose :guilabel:`letter`, :guilabel:`A3`, or :guilabel:`A4`. Then the **Orientation** is used to adjust the paper orientation that you want use for print out Field Paper. You can choose between :guilabel:`portrait` or :guilabel:`landscape` as shown in the figure below.
id: Pengaturan kedua yaitu pengaturan tampilan grid. **Paper Size** digunakan untuk menentukan ukuran kertas yang akan digunakan saat mencetak Field Paper. Anda dapat memilih ukuran :guilabel:`letter`, :guilabel:`A3`, or :guilabel:`A4`. Kemudian, **Orientation** digunakan untuk mengatur orientasi dari kertas yang akan digunakan saat mencetak Field Paper. Anda dapat memilih antara :guilabel:`portrait` atau :guilabel:`landscape` seperti yang ditunjukkan di bawah ini.

source: *Setting the paper size and paper orientation in Field Papers*
id: *Mengatur ukuran kertas dan orientasi kerta di Field Papers*

source: Still in Grid Layout setting, next you can select the type data for your Field Papers. You can select different **Basemap** for change map background. In this example shown in the figure below, we will select :guilabel:`Satellite Only`.
id: Masih di pengaturan tampilan grid, Anda selanjutnya dapat memilih tipe data yang ingin ditampilkan di Field Papers Anda. Anda dapat memilih beberapa **Basemap** yang berbeda untuk menjadi latar belakang peta Field Paper Anda. Dalam contoh yang ditunjukkan di bawah ini, kita akan menggunakan latar belakang :guilabel:`Satellite Only`.

source: *Setting Map Background on Field Papers*
id: *Mengatur Latar Belakang Peta pada Field Papers*

source: When you’re finished, click :guilabel:`MAKE ATLAS`
id: Ketika Anda telah selesai, klik :guilabel:`MAKE ATLAS`

source: *Next step to create Field Papers*
id: *Langkah selanjutnya untuk membuat Field Papers*

source: It may take a few minutes to prepare your final Field Papers map. When finished, you will see your Field Paper on this page, shown in the figure below.
id: Tunggu beberapa menit untuk mempersiapkan peta Field Papers. Ketika selesai, Anda akan melihat Field Papers pada halaman ini, seperti ditunjukkan pada gambar di bawah.

source: *The process preparing Field Papers*
id: *Proses penyelesaian Field Papers*

source: When your print is ready, Click :guilabel:`Download PDF`. The Field Paper should begin downloading. If it loads in your browser, you may need to save it by going to :menuselection:`File ‣ Save`.
id: Ketika peta cetak Fied Paper Anda telah siap, klik :guilabel:`Men-download PDF`. Field Paper mulai mendownload. Jika itu termuat di browser Anda, Anda dapat menyimpannya dengan klik :menuselection:`File ‣ Save`.

source: When the download is finished, open the PDF file. Connect your computer to a printer and print the page. If everything goes well, you should now have map printed on paper.
id: Ketika proses telah selesai, buka file PDF. Koneksikan komputer Anda ke perangkat printer dan cetak halaman tersebut. Jika semua berjalan dengan baik, peta Anda telah tercetak di atas kertas.

source: 7.4 Mapping with Field Papers
id: 7.4 Pemetaan dengan Field Papers

source: Take your Field Papers outside, and use it as a guide to walk and identify new places that are not on the map.
id: Bawalah Field Papers Anda keluar, dan gunakan Field Papers sebagai panduan untuk berjalan dan mengidentifikasi tempat-tempat baru yang belum ada pada peta.

source: Draw lines for roads, shapes for buildings, and so forth. Write notes about each location directly on the map, or write numbers on the map that relate to numbers in your notebook, where you can write more detailed information about each object.
id: Gambarlah garis untuk jalan, bentuk untuk bangunan, dan seterusnya. Tulislah catatan tentang setiap lokasi secara langsung pada peta, atau tulislah angka pada peta yang menghubungkan objek pada peta dengan catatan, dimana Anda menuliskan informasi yang lebih detail tentang objek Anda.

source: When you are satisfied with your additions on the paper map, then you can add them digitally into OpenStreetMap.
id: Ketika Anda sudah merasa puas dengan penambahan pada Field Papers, kemudian Anda dapat menambahkannya secara digital ke dalam OpenStreetMap.

source: 7.5 Scan and Upload Field Papers
id: 7.5 Scan dan Upload Field Papers

source: Field Papers are very useful for mapping with nothing more than paper, but they are not a 100% solution. We will still need to load our paper map into JOSM, add our information digitally, and save our changes on OpenStreetMap.
id: Field Paper sangat berguna untuk pemetaan dengan tidak lebih dari kertas, tetapi field papers bukan 100% solusi. Kita akan tetap perlu menambahkan Field Paper kita ke dalam JOSM, menambahkan informasi kita secara digital, dan menyimpan perubahan kita di OpenStreetMap.

source: The first step is to scan your Field Papers into your computer. You can do this by attaching a scanner to your computer, scanning the paper, and saving it as an image file. If you don’t have a scanner, you can take a photography of the paper, but you should be careful to take a very good photo. Make sure that the paper is flat and your camera is directly in front of it. Be sure to include the barcode in the image, as Field Papers will not work without it. Here is an example of a scanned/photographed image:
id: Langkah pertama adalah men-scan Field Papers Anda ke dalam komputer Anda. Anda dapat melakukan ini dengan memasang scanner ke komputer Anda, men-scan kertas, dan menyimpannya sebagai sebuah file gambar. Jika Anda tidak memiliki scanner, Anda dapat mengambil foto Field Paper dengan kamera, tetapi Anda harus berhati-hati agar foto yang diambil sangat baik. Pastikan bahwa Field Paper rata dengan kamera Anda secara langsung di depannya. Pastikan untuk menyertakan barcode pada foto, Field Paper tidak akan bekerja tanpa barcode. Di bawah ini terdapat contoh gambar yang telah di-scan/difoto:

source: Once you have your Field papers scanned and saved on the computer, open your web browser and return to Field Papers website just as before.
id: Setelah Anda memiliki Field Paper Anda yang telah discan dan disimpan di komputer, bukalah browser internet Anda dan kembali ke situs fieldpapers.org, seperti sebelumnya.

source: Click the :guilabel:`Upload` tab at the top of the page.
id: Klik pada :guilabel:`Upload` di sisi atas halaman.

source: Click :guilabel:`Browse...` and navigate to the file where you scanned/photographed your Field Papers.
id: Klik :guilabel:`Browse...` dan arahkan menuju file tempat Anda menyimpan hasil foto/scan dari Field Papers Anda.

source: *Select the to be uploaded to Field Papers website*
id: *Pilih untuk diupload ke situs Field Papers*

source: It may take a few minutes for your paper to upload, depending on the speed of your connection.
id: Mungkin Anda harus menunggu beberapa saat agar Field Paper Anda selesai di upload, hal ini tergantung dari kecepatan koneksi internet Anda.

source: *Field Papers uploading process*
id: *Proses Upload Field Papers*

source: When the upload finished, you can see the page interface as in the figure below:
id: Ketika upload telah selesai, anda dapat melihat tampilan halaman seperti di bawah ini:

source: *The result from upload Field Papers*
id: *Hasil Upload dari Field Papers*

source: 7.6 Add Plugin Field Papers
id: 7.6 Menambahkan Plugin Field Papers

source: Before we open Field Papers in JOSM, we need install the Field Papers plugin. The fieldpapers plugin enables JOSM to open Field Papers that have been uploaded to the Field Papers website. The Field Papers will be used as background, and we open it using the same procedure for opening satellite imagery in JOSM.
id: Sebelum kita membuka Field Paper di JOSM, kita perlu menginstal plugin Field Paper. Plugin Field Papers memungkinkan kita untuk membuka Field Paper yang sudah terupload ke situs Field Papers. Field Papers akan digunakan sebagai latar belakang, dan kita buka itu menggunakan metode yang sama dengan cara membuka citra satelit di JOSM.

source: Open JOSM and go to :menuselection:`Edit --> Preferences`.
id: Buka JOSM dan klik :menuselection:`Edit > Preferensi`

source: Click on :guilabel:`Plugins` tab.
id: Klik pada tab :guilabel:`Plugin`.

source: Type :kbd:`fieldpapers` in the :guilabel:`Search` box. After you find it, tick the fieldpapers box and Click :guilabel:`OK` as shown in the figure below.
id: Ketikkan :kbd:`fieldpapers` pada kotak :guilabel:`Cari`. Sesudah Anda menemukannya, beri tanda centang pada kotak fieldpapers dan Klik :guilabel:`OK` seperti ditunjukkan gambar di bawah ini.

source: *Field Papers Plugin*
id: *Plugin Field Papers*

source: Restart JOSM so the plugin loads.
id: Restart JOSM agar plugin berhasil terpasang.

source: 7.7 Open Field Papers from JOSM
id: 7.7 Membuka Field Papers di JOSM

source: Now you can add the results of your scanned Field Papers to JOSM and add your information to OpenStreetMap. Return to the `Field Papers website <http://fieldpapers.org>`_ in browser address bar.
id: Sekarang Anda dapat menambahkan hasil dari scan Field Papers ke JOSM dan menambahkan informasi ke OpenStreetMap. Kembali ke `situs Field Papers <http://fieldpapers.org>`_ pada browser.

source: Click :guilabel:`Watch` – move your mouse to the bottom and click :guilabel:`Snapshots` until your browser page looks like the figure below:
id: Klik :guilabel:`Pantau` - pindahkan mouse Anda ke bawah dan klik :guilabel:`Foto` sampai halaman browser Anda terlihat seperti gambar di bawah:

source: *List Field Papers in Snapshots*
id: *Daftar hasil upload foto Field Papers*

source: To open Field Papers in JOSM, we need copy the photo ID from the Field Papers that have been scanned. We can get the ID from the snapshot URL at the Field Papers website. Click on the image until the url appears as shown below, then copy the URL for example: *http://fieldpapers.org/snapshots/cdq5bfq4#17/-6.81299/107.61451*
id: Untuk membuka Field Paper di JOSM, kita perlu menyalin ID foto dari Field Papers yang telah di-scan. Kita bisa mendapatkan ID dari URL pada situs Field Papers. Klik pada gambar sampai URL tersebut muncul seperti di bawah ini, kemudian salin URL. Berikut contohnya: *http://fieldpapers.org/snapshots/cdq5bfq4#17/-6.81299/107.61451*

source: *URL from Snapshot Field Papers*
id: *URL dari Foto Field Papers*

source: Copy the URL by selecting it and pressing :kbd:`CTRL + C`.
id: *Copy* URL dengan memilihnya dan tekan :kbd:`CTRL + C`.

source: Open JOSM and make sure the Field Papers plugin is listed in the menu on the top of toolbar. Click :menuselection:`Field Papers ‣ Scanned Map...`
id: Buka JOSM dan pastikan plugin Field Papers sudah ada berada di atas menu toolbar. Klik :menuselection:`Field Papers ‣ Scanned Map...`

source: *Field Papers Menu in JOSM*
id: *Menu Field Papers di JOSM*

source: Then paste the URL that we have copied from the Field Papers site by pressing :kbd:`Ctrl + V` on your keyboard.
id: Kemudian paste URL yang telah di-copy dari situs Field Papers dengan tekan :kbd:`Ctrl + V` pada keyboard Anda.

source: *Input Field Papers URL in JOSM*
id: *Memasukkan URL Field Papers di JOSM*

source: Click :guilabel:`OK`.
id: Klik :guilabel:`OK`.

source: If everything goes well, the Field Papers will open in JOSM. The next module, we can see how to add objects from the scanned Field Papers to OpenStreetMap.
id: Jika semuanya berjalan dengan baik, Anda seharusnya melihat Field Paper Anda terbuka di dalam JOSM. Pada bab selanjutnya, kita akan melihat bagaimana cara menambahkan objek-objek dari hasil scan Field Papers ke OpenStreetMap.

source: Also note that you can use scanned Field Papers in other online editors such as ID Editor or Potlatch2 by clicking the link :guilabel:`Edit in... ID` or :guilabel:`Edit in... Potlatch` on page Field Papers that have been scanned.
id: Perhatikan pula bahwa Anda dapat juga menggunakan Field Papers yang telah anda scan pada editor online yang lain seperti iD atau Potlatch2 dengan mengklik tautan :guilabel:`Edit in... ID` atau :guilabel:`Edit in Potlatch` di halaman Field Papers yang telah discan.

source: *Editing Field Papers with iD Editor*
id: *Editing Field Papers dengan iD Editor*

source: *Interface Editing OSM data on iD Editor*
id: *Tampilan editing data OSM di iD Editor*

source: Excercise!
id: Ulangi!

source: After you add your changes to OSM, they will be saved to the OSM servers. When you want add some information to your map, you can print a Field Paper that includes the changes you made. As this process is repeated, and you acquire more details, the map will steadily improve!
id: Setelah Anda menambah perubahan Anda ke OSM, mereka akan tersimpan ke server OSM. Kemudian pada saat Anda ingin meningkatkan informasi peta, Anda dapat mencetak sebuah Field Paper yang mencakup perubahan yang Anda buat. Proses ini diulang, peta akan menjadi lebih baik dan lebih baik lagi, semakin banyak Anda memetakan!

source: Summary
id: Ringkasan

source: In this module, You have learned how to use Field Papers and how Field Papers works as a data collection device. You have learned how to print, mapping, and scans Field Paper, and how you can use them to improve OpenStreetMap.
id: Pada bab ini, Anda telah mempelajari proses menggunakan Field Papers dan bagaimana mereka bekerja sebagai sebuah koleksi data. Anda telah mempelajari bagaimana mencetak, memetakan, dan men-scan sebuah Field Paper, dan bagaimana Anda dapat menggunakan mereka untuk meningkatkan OpenStreetMap.

source: :ref:`Go to next chapter --> <ch8-conflict-resolution-in-osm>`
id: :ref:`Pergi ke bab selanjutnya --> <ch8-conflict-resolution-in-osm>`
