Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/osm/Chapter-04-getting-started-with-josm.po
Languages: id

source: Lastly, there are numerous polygons on the sample map, representing different places - a forest, a river, and buildings. A polygon generally represents an area, like a field or a building. A polygon is exactly like a way - the only difference is that the way begins and ends at the same node. That is to say, they are closed.
id: Terakhir, ada beberapa poligon dalam peta contoh ini yang menunjukkan tempat-tempat yang berbeda seperti hutan, sungai, dan bangunan. Suatu poligon secara umum mewakili suatu area seperti lapangan atau bangunan. Poligon sama seperti garis - akan tetapi perbedaannya poligon terdiri dari beberapa garis yang membentuk dimana titik akhir berada sama dengan titik awal garis tersebut.

source: It's easy to think about the map that contains three basic types of objects - points, lines, and polygons. OpenStreetMap contained in specific terms that you will learn as you progress. In OSM, a point called node, and lines are ways. Polygon called closed way because this is just a line that starts and ends at the same point.
id: Sangat mudah berpikir tentang peta yan berisi tiga jenis objek dasar - titik, garis, dan poligon. OpenStreetMap terapat istilah khusus yang akan Anda pelajari sebagai kemajuan Anda. Di OSM, titik disebut *nodes*, dan garis disebut *ways*. Poligon disebut *closed way* karena ini hanya sebuah garis yang berakhir pada titik awalan yang sama.

source: You may notice that when you select an **object**, it will be highlighted in **red** and a list appears to the right of the map in a window called **“Properties”**. These are known as tags and are depicted in the figure below.. **Tags** are **attributes of the selected point, line or polygon that identify and describe** **that feature**. But for now, all you need to know is that this information helps describe whether our object is a forest, a river, a building, or something else. Think about drawing a map by hand, and how you are also drawing points, lines, and shapes. What other places are best represented by points? Lines? Shapes?
id: Anda akan menyadari ketika **objek** yang Anda pilih, akan berwarna merah dan muncul beberapa daftar di sebelah kanan jendela yang disebut "**Properties**". Hal ini disebut sebagai tags. **Tags** adalah **informasi yang dimana merupakan bagian dari sutu titik, garis, ataupun poligon yang memberitahukan informasi objek tersebut**. Untuk sekarang yang Anda butuhkan adalah mengetahui informasi ini untuk menjelaskan apakah objek Anda itu hutan, sungai atau bangunan atau bentuk lainnya. Pikirkan tentang menggambarkan peta dengan tangan, dan bagaimana Anda juga menggambar titik, garis, dan bentuk. Objek apa yang paling tepat untuk mewakili titik? Garis? Poligon?

source: *Information of object in JOSM Properties Panel*
id: *Informasi objek di Panel Properti JOSM*

source: 4.5.3 How to Change Object
id: 4.5.3 Cara Mengubah Objek

source: Select the forest on the left side of the map. Be sure to click on the line around the forest, not one of the points on the line. Now **hold your left mouse button down and drag your mouse**. You should be able to move the forest to a new location on the map.
id: Pilih hutan yang berada di sebelah kiri peta. Pastikan Anda mengklik garis pada hutan tersebut bukan pada titiknya. Sekarang **klik dan tahan objek tersebut kemudian geser**. Anda akan dapat untuk menggerakkan hutan ke lokasi yang baru pada peta.

source: **Click on one of the points** on the line around the forest. Hold your left mouse button down and drag your mouse. You should be able to move the point. This is how you can change the shape of an object, or move a point.
id: **Klik salah satu titik** pada garis sekitar hutan. Klik dan tahan titik tersebut kemudian geser titiknya. Anda dapat menggerakan titik. Dengan menggerakkan titik ini anda dapat mengubah bentuk dari sebuah objek.

source: 4.5.4 Drawing an Object
id: 4.5.4 Menggambar Objek

source: On the left side of a JOSM is a column of buttons. Many of these buttons open new windows on the right side that provide more information about the map. The most important buttons, however, are at the top of these column. These buttons change the operations you do with your mouse.
id: Pada bagian sisi sebelah kiri JOSM terdapat kolom tombol. Terdapat banyak tombol membuka jendela pada sisi kanan yang menyediakan lebih banyak informasi mengenai peta. Tombol yang paling penting, terdapat di atas kolom tersebut. Tombol - tombol ini mengubah apa yang Anda lakukan dengan mouse Anda.

source: **Select button** is one of the keys that you will use frequently. This button is useful for selecting objects and to draw new objects. The **Select button** looks like this:
id: **Tombol Memilih Objek**, adalah salah satu tombol yang akan sering Anda gunakan. Tombol ini berguna untuk memilih objek dan untuk menggambar objek baru. **Tombol Memilih objek** yang akan terlihat seperti ini:

source: Before you draw, you need to make sure that nothing is selected. Click in the black space on the map, where it is empty, to make sure nothing is selected.
id: Sebelum Anda menggambar objek, Anda perlu memastikan bahwa tidak ada objek yang terpilih. Klik diluar objek peta, dimana tidak terdapat objek, untuk memastikan tidak ada yang terpilih.

source: Click on the second button, the **Draw** tool.
id: Klik pada tombol kedua, yaitu **Tool Menggambar Objek**.

source: Find an empty area on the map, and **double-click** with your mouse. This **will draw a single point**.
id: Temukan area kosong pada peta, dan **klik dua kali** dengan mouse Anda. Kemudian akan tergambar sebuah titik tunggal.

source: To **draw a line, single-click** with your mouse. **Move your mouse** and click again. **Continue until you are happy with your line**. To **end the line, double-click** your mouse.
id: Untuk **Menggambar sebuah garis, klik sekali** dengan mouse Anda. **Gerakkan mouse** Anda dan klik kembali. **Lanjutkan hingga membentuk sebuah garis**. Untuk **mengakhiri garis, klik dua kali** pada mouse Anda.

source: **Draw a polygon** the **same way** that you **draw a line, but** finish the polygon by double-clicking on the point where you started the line.
id: **Gambarlah sebuah poligon** dengan cara yang sama seperti **menggambar garis**, tetapi untuk mengakhiri poligon dengan klik dua kali di atas titik yang pertama kali kita buat.

source: 4.5.5 How to Add Presets
id: 4.5.5 Cara Menambahkan Presets

source: Now we know how to draw points, lines and shapes, but we still haven’t defined what they represent. We want to be able to say that our points are shops, schools, or something else, and whether our shapes are fields, buildings, or something else. To provide information on the objects that we create or edit we need to include presets in the object. Here are the steps:
id: Sekarang kita telah memahami bagaimana menggambar titik, garis, dan poligon, akan tetapi kita masih belum menemukan objek tersebut adalah apa. Kita ingin supaya objek yang kita gambar memiliki informasi seperti apakah objek tersebut merupakan toko, sekolah, atau sesuatu yang lain, dan apakah bentuk yang kita buat itu bangunan atau lainnya. Untuk memberikan informasi terhadap objek yang kita buat atau edit, kita perlu memasukkan presets di objek tersebut. Berikut adalah langkah-langkahnya:

source: Click on the **Select tool**, in the column of buttons on the left.
id: Klik pada **tombol Select**, pada kolom tombol di sebelah kiri.

source: Select one of the objects that you drew with the Draw tool. On the top menu, click :guilabel:`Presets`. Move your mouse through the sub-menu to the type of location you would like to define.
id: Pilih salah satu objek yang akan Anda gambar dengan tombol Gambar. Pada menu diatas klik :guilabel:`Presets`. Gerakkan mouse Anda ke sub menu ke lokasi yang Anda ingin tentukan.

source: Go to Preset menu. Click on item named **Building**, which has been added at the bottom of the menu as shown in the figure below.
id: Pergilah ke menu Presets. Klik pada item yang bernama **Bangunan**, yang saat ini telah ditambahkan di bagian bawah menu.

source: *Building presets box in JOSM*
id: *Kotak presets bangunan di JOSM*

source: When you click on a preset, a form will pop up asking you for more information. You do not have to fill in every field, but **you may wish to add some of the important fields, such as the name of the object**.
id: Ketika Anda klik pada preset, akan muncul kolom-kolom dan menanyakan Anda tentang informasi lebih lanjut tentang objek tersebut. Anda tidak harus mengisi semua kolom tetapi **Anda harus mengisi kolom penting, seperti nama dari objek yang Anda buat**.

source: When you are finished entering the information, click :guilabel:`Apply Preset`. If all goes as expected, your point, line, or shape should change colors or display a symbol. This is because you have defined what it is.
id: Ketika Anda sudah selesai memasukkan informasi, klik :guilabel:`Apply Preset`. Jika semuanya berjalan dengan lancar, titik, garis, atau poligon yang Anda buat akan berubah warna atau memiliki suatu simbol. Ini tergantung dari informasi yang Anda masukkan ke dalam objek tersebut.

source: 4.6 Draw Your Own Map
id: 4.6 Menggambar Peta Anda Sendir

source: Now let’s draw a map in order to practice the techniques you have learned. You may wish to redraw the map that you drew on paper in previous module.
id: Sekarang Anda akan membuat peta Anda sendiri untuk meningkatkan teknik-teknik yang telah kita pelajari. Anda bisa saja menggambar peta yang telah Anda buat di kertas ketika mempelajari bab sebelumnya.

source: **Drag the map away** from the sample map. Hold the right mouse button and drag your mouse, **until you have a nice empty area** to draw on.
id: **Tahan dan geser** jendela dari peta contoh. Tahan tombol kanan dan geser mouse Anda **hingga Anda mendapatkan area kosong** untuk Anda menggambar.

source: **Use the Draw tool to create points, lines, and polygon**. Describe what your objects are by selecting from the Presets menu.
id: **Gunakan alat menggambar untuk membuat titik, garis, dan poligon**. Jelaskan objek apa yang Anda buat dengan memilih Menu Presets.

source: When you are finished, you should have your own map, similar to the sample map that we opened in sample.osm.
id: Ketika Anda sudah selesai, Anda akan memiliki peta sendiri, yang sama dengan contoh yang ada pada file sample.osm.

source: Summary
id: Ringkasan

source: At this point, you should have learned how to setup JOSM on your computer and how to use basic editing tools available in JOSM. In the next module, we will take a closer look into the process of editing OpenStreetMap using the JOSM editor.
id: Jika semua berjalan dengan baik, Anda telah mempelajari bagaimana melakukan pengaturan pada JOSM di komputer Anda dan juga mengenai bagaimana menggunakan tools atau alat dasar dalam menggambar peta. Pada bab selanjutnya, Anda akan melihat lebih dekat bagaimana proses mengedit peta OpenStreetMap di editor JOSM.
