Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/getting_involved.po
Languages: fr

source: Getting involved
fr: Participer

source: If you like the work we are doing with |project_name| and would like to contribute, we will welcome your involvement. We spend a lot of time and effort trying to make a robust, user-friendly and useful software platform, but there is no substitute for having interested users participating and sharing their needs, problems and successes! Here are a few simple ways you can get involved:
fr: Si vous aimez le travail que nous fournissons pour |project_name| et que vous voudriez participer, nous apprécierons votre contribution. Nous investissons beaucoup de temps et d'efforts pour élaborer une plateforme logicielle robuste, intuitive et pratique, mais rien ne remplace l'aide que peuvent apporter des utilisateurs passionnés en participant et en exprimant leurs besoins, leurs problèmes et leurs réussites. Voici quelques manières simples de vous impliquer :

source: Visit our web site!
fr: Visitez notre site web !

source: The web site will always contain the latest information on how to use |project_name|. We encourage anyone who wants to get involved with the project to first read the content available on the site to familiarise themselves with the content. The website is available at:
fr: Ce site web est constamment actualisé avec les informations les plus récentes détaillant comment utiliser |project_name|. Nous encourageons tous les utilisateurs souhaitant s'impliquer dans le projet à lire tout d'abord les explications disponibles sur le site pour se familiariser avec son contenu. L'adresse du site est :

source: If you need help in solving problems with |project_name| take a look at :ref:`getting_help`.
fr: Si vous avez besoin d'aide pour résoudre des problèmes concernant |project_name|, consultez :ref:`getting_help`.

source: Add yourself to the |project_name| Usermap!
fr: Inscrivez-vous dans la liste des utilisateurs de |project_name| !

source: As a User/Trainer/Developer of |project_name| you are encouraged to add yourself to the Usermap page available at:
fr: En tant qu'utilisateur/formateur/développeur de |project_name|, vous êtes vivement encouragé à vous inscrire sur le répertoire des utilisateurs sur la page :

source: Use the :guilabel:`Add me to map!` button on the left side and point the cross to the place where you live. Fill in your user data and click on :guilabel:`Done!`. Here you may also download the coordinates of all entered |project_name| users as a CSV file.
fr: Utilisez le bouton :guilabel:`M'ajouter à la carte !` à gauche de l'écran et placez la croix sur l'endroit où vous vivez. Remplissez vos données utilisateurs et cliquez sur :guilabel:`Terminé !` Sur cette page, vous pouvez également télécharger sous forme de fichier CSV les coordonnées de tous les utilisateurs inscrits sur le projet |project_name|.

source: Use our issue tracker!
fr: Utilisez notre répertoire de problèmes connus !

source: We maintain an issue tracker here:
fr: Nous gardons à jour un répertoire de problèmes connus ici :

source: On this page you can browse and search existing issues and create new issues. The issue tracker is a great place to let us know about specific bugs you encounter or tell us about new features you would like to see in the software. Information about how to correctly file an issue is available in the :ref:`issue_howto` section.
fr: Sur cette page, vous pouvez parcourir et rechercher les problèmes connus ou en signaler de nouveaux. Notre répertoire de problèmes connus est l'endroit idéal pour nous informer des bugs spécifiques que vous avez pu rencontrer ou pour solliciter les nouvelles fonctionnalités dont vous souhaiteriez voir le logiciel doté. Plus des informations plus détaillées expliquant comment signaler correctement un problème, référez-vous à la section :ref:`issue_howto`.

source: Chat live to developers on IRC!
fr: Discutez en direct avec les développeurs sur IRC !

source: Internet Relay Chat (IRC) is a chat room environment where you can talk (by typing messages) to other |project_name| users and developers to discuss ideas and get help. You can use your own IRC client and join #inasafe on the irc.freenode.net network. We also have a direct link on http://www.inasafe.org. Click on :guilabel:`Chat live!` at the top of the page and join us in the channel. Alternatively, you can use your web browser to join the chat room using the link below:
fr: Internet Relay Chat (IRC) est un environnement de canaux de discussion où vous pouvez dialoguer (en tapant des messages) avec d'autres utilisateurs et des développeurs de |project_name|, débattre de nouvelles idées et recevoir de l'aide. Vous pouvez utiliser votre propre client IRC et rejoindre #inasafe sur le réseau irc.freenode.net. Un lien direct est également disponible sur http://www.inasafe.org. Cliquez sur :guilabel:`Discutez en direct !` en haut de la page pour entrer dans le canal de discussion. Sinon, vous pouvez le rejoindre via votre navigateur en cliquant sur le lien ci-dessous :

source: On the form that appears, choose a user name, enter :kbd:`#inasafe` in the :guilabel:`Channels:` box and complete the rest of the details in the form. After logging in wait a few moments and you will be taken to the #inasafe channel.
fr: Sur le formulaire qui apparaît, choisissez un nom d'utilisateur, tapez :kbd:`#inasafe` dans le champ :guilabel:`Channels:` et remplissez le reste des informations demandées dans le formulaire. Une fois connecté, attendez quelques instants pour être transféré vers le canal #inasafe.

source: Other people in the room may not be actively watching the channel, so just ask your question, leave the chat window open and check back every now and then until you see other chat room members become active.
fr: Comme les autres personnes présentes dans le canal peuvent ne pas être en train de regarder l'interface, vous pouvez simplement poser votre question, laisser la fenêtre de discussion ouverte et y jeter un œil de temps en temps jusqu'à ce que vous voyez d'autres membres du canal devenir actifs.

source: Submit your code!
fr: Envoyez votre code !

source: We must emphasise that |project_name| is **free** and **open source**. That means anyone (or any organisation) can freely modify, adapt and improve the software. We welcome any contributions to |project_name|.
fr: Nous insistons sur le fait que |project_name| est **gratuit** et **open source**. Cela signifie que que n'importe qui (ou n'importe quelle organisation) peut librement modifier, adapter ou améliorer notre logiciel. Toutes les contributions au projet |project_name| sont les bienvenues.

source: The easiest way to do this is to `fork <https://help.github.com/articles/fork-a-repo>`_ the |project_name| code base on GitHub and then send us a `pull request <https://help.github.com/articles/using-pull-requests>`_.
fr: Pour ce faire, la méthode la plus facile est de `cloner (fork) <https://help.github.com/articles/fork-a-repo>`_ le code de |project_name| sur GitHub puis de nous `transmettre une requête (pull request) <https://help.github.com/articles/using-pull-requests>`_.

source: We also welcome small improvements, translations or other fixes via the issue management system mentioned above.
fr: Les petites améliorations, traductions ou autres corrections envoyées via le système de gestion des problèmes mentionné plus haut sont également bienvenues.

source: We have strict requirements that all code submitted to |project_name| is compliant with high coding_standards and is continually tested by a comprehensive regression testing system. We have this requirement in place to ensure a good experience for our users and to ensure that users can have confidence in the results produced by |project_name|.
fr: Nous avons pour stricte exigence que tout code envoyé pour |project_name| soit conforme à des règles de codage optimales et soit constamment testé par un système de test de régression. Notre but en imposant une telle contrainte est d'assurer une bonne expérience à tous nos utilisateurs et que ces derniers puissent se fier aux résultats produits par |project_name|.
