Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/getting_help.po
Languages: id

source: Getting Help
id: Mendapatkan bantuan

source: If you need help using |project_name|, join the |project_name| mailing list or connect with other local users.
id: Jika Anda membutuhkan bantuan dalam menggunakan |project_name|, bergabunglah dengan *mailing list* |project_name| atau terhubung dengan pengguna lokal lainnya.

source: |project_name| Google Group mailing list
id: *Mailing list* Grup Google |project_name|

source: You do not need a google account to use this forum/mailing list!
id: Anda tidak membutuhkan akun google untuk menggunakan forum/*mailing list*!

source: If you experience problems using |project_name|, have suggestions on improving the software or simply would like to get in contact with other |project_name| users, join our google group by sending an email to:
id: Jika Anda mengalami masalah dalam menggunakan |project_name|, memiliki saran untuk meningkatkan perangkat lunak atau Anda hanya ingin terkoneksi dengan pengguna |project_name| yang lain, Anda dapat bergabung di grup google kami dengan mengirimkan email ke:

source: You can unsubscribe from the list at any time by sending an email to:
id: Anda dapat berhenti berlangganan setiap saat hanya dengan mengirimkan email ke:

source: You can view the message archive of this forum on the |project_name| users group page at:
id: Anda dapat membaca dan menelusuri arsip pertanyaan yang diajukan ke halaman grup pengguna |project_name| pada:

source: Localised help
id: Bantuan lokal

source: For users in Indonesia, there is a Facebook group where you can request help in Indonesian language.
id: Untuk pengguna di Indonesia, terdapat grup Facebook dimana Anda dapat meminta bantuan dalam Bahasa Indonesia.

source: Getting involved
id: Ikut Terlibat

source: To help in the development of |project_name| or report a bug, visit :ref:`getting_involved`.
id: Untuk membantu dalam pengembangan |project_name| atau melaporkan *bug*, kunjungi :ref:`getting_involved`.
