Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/toolbar.po
Languages: id

source: Here the different icons (buttons) in the toolbar and the function of each are explained.
id: Bagian ini berisi penjelasan dari ikon (tombol) yang berbeda dalam *toolbar* dan fungsi dari yang telah dijelaskan.

source: Toggle |project_name| Dock
id: Tombol untuk beralih ke |project_name|

source: *Toggle Dock*
id: *Tombol untuk beralih ke InaSAFE*

source: This button shows and hides the |project_name| dock. After enabling the dock you are able to move it around your screen. Dock it as a panel within the QGIS interface, or undock it so that it floats as a separate window.
id: Tombol ini memunculkan dan menyembunyikan dok |project_name|. Setelah mengaktifkan dok Anda dapat memindahkannya di sekitar layar Anda. Dok sebagai panel dalam tampilan antarmuka InaSAFE, atau non-aktifkan dok sehingga ada sebagai jendela yang terpisah.

source: Find more information about the dock in the :ref:`toolbar_dock` section.
id: Temukan informasi lebih lanjut mengenai dok pada bagian :ref:`toolbar_dock`.

source: |project_name| Keyword Editor
id: |project_name| Editor Kata Kunci

source: *Keyword Editor*
id: *Editor Kata kunci*

source: The :guilabel:`Keyword Editor` button opens the editor which is is used to edit the keywords needed for |project_name| to create useful output. Keywords are explained in more detail in :ref:`keywords_system`.
id: Tombol :guilabel:`Editor Kata Kunci InaSAFE` akan membuka editor dimana digunakan untuk meengedit kata kunci yang dibutuhkan untuk |project_name| untuk membuat *output* yang berguna. Kata kunci dijelaskan lebih rinci di :ref:`keywords_system`.

source: |project_name| Options
id: Pilihan |project_name|

source: *Options*
id: *Pilihan*

source: This button opens the |project_name| Options window which is described in detail in :ref:`toolbar_options`.
id: Tombol ini membuka jendela pilihan |project_name| yang dijelaskan di :ref:`toolbar_options`.

source: |project_name| Impact Functions Browser
id: Browser Fungsi Dampak |project_name|

source: *Impact Functions Browser*
id: *Browser Fungsi Dampak InaSAFE*

source: This button opens the Impact Function Browser, which allows you to filter and browse impact functions that are available in |project_name|. More information can be found in :ref:`impact_functions`.
id: Tombol ini membuka Browser Fungsi Dampak, yang memungkinkan Anda untuk menyaring dan menjelajah fungsi dampak yang tersedia di |project_name|. Informasi lebih lanjut dapat ditemukan di :ref:`impact_functions`.

source: |project_name| Minimum Needs Tool
id: *Tool* Kebutuhan Minimum |project_name|

source: *Minimum Needs Tool*
id: *Tool Kebutuhan Minimum InaSAFE*

source: This tool calculates minimum needs for evacuated people. For guidance on how to use this tool visit :ref:`minimum_needs`.
id: *Tool* ini akan menghitung kebutuhan minimum untuk penduduk yang dievakuasi. Untuk petunjuk menggunakan *tool* ini silahkan lihat di :ref:`minimum_needs`.

source: *Converter*
id: *Konverter*

source: This tool converts an earthquake 'shakemap' that is in grid xml format to a GeoTIFF file. For more detailed information visit :ref:`converter`.
id: *Tool* ini akan mengkonvert sebuah peta kejadian 'gempa bumi' yang dalam format grid xml ke file GeoTIFF. Untuk informasi yang lebih lanjut silahkan lihat di :ref:`converter`.

source: |project_name| Batch Runner
id: Batch Runner |project_name|

source: *Batch Runner*
id: *InaSAFE Batch Runner*

source: The Batch Runner is used to load saved scenarios (:ref:`save_scenario`) and batch run them in one go. Find more information about this tool in :ref:`batch_runner`.
id: *Batch Runner* digunakan untuk memuat skenario yang telah disimpan (:ref:`save_scenario`) dan jalankan *batch* mereka dalam satu kali perintah. Anda dapat menemukan informasi lebih lanjut tentang *tool* ini di :ref:`batch_runner`.

source: Save current scenario
id: Simpan skenario saat ini

source: *Save Current Scenario*
id: *Simpan skenario saat ini*

source: This is the tool to prepare/save scenarios for the :ref:`tb_batch_runner` tool. It lets you save the current visible scenario in QGIS to a :file:`.txt` file. Then this file can be opened as a scenario again in Batch runner and recalculated. A more detailed description is available in :ref:`batch_runner`.
id: Ini adalah *tool* yang dibutuhkan untuk menyiapkan/menyimpan skenario untuk *Tool* :ref:`tb_batch_runner`. Ini memungkinkan Anda menyimpan skenario yang terlihat saat ini di QGIS ke file :file:`.txt`. Kemudian file ini dapat terbuka sebagai skenario lagi dalam *Batch runner* dan dihitung ulang. Penjelasan lebih rinci dari *batch runner* tersedia di :ref:`batch_runner`.

source: |project_name| OpenStreetMap Downloader
id: Alat download OpenStreetMap untuk |project_name|

source: *OpenStreetMap downloader*
id: *Alat Download OpenStreetMap InaSAFE*

source: This tool fetches building (structure) data from |OSM|.
id: Alat ini akan memperoleh data bangunan (struktur) dari |OSM|.
