Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/socialisation/inasafe_concepts.po
Languages: id

source: |project_name| concepts
id: Konsep |project_name|

source: In this section we explain the key concepts of |project_name| and explore the merits of disaster management planning.
id: Dalam sesi ini kita akan membahas tentang konsep utama dari |project_name| dan memahami ciri-ciri dari rencana manajemen penanggulangan bencana.

source: How does |project_name| work?
id: Bagaimana |project_name| bekerja?

source: |project_name| combines one exposure data layer (e.g. location of buildings) with one hazard scenario (e.g. the footprint of a flood) and returns a spatial impact layer along with a statistical summary and action questions. |project_name| is framed around answering questions such as: *'In the event of a flood similar to the 2013 Jakarta event how many people might need evacuating.'*
id: |project_name| menggabungkan satu layer data keterpaparan (co: bangunan) dengan satu layer ancaman (co: kejadian banjir) kemudian akan menghasilkan layer dampak spasial dari bencana tersebut beserta dengan ringkasan informasi statistik dan beberapa pertanyaan untuk mengambil suatu tindakan. |project_name| ditujukan untuk bisa menjawab beberapa pertanyaan seperti: *'Dalam kejadian banjir di Jakarta pada tahun 2013, berapa banyak penduduk yang mungkin butuh untuk dievakusi.'*

source: |project_name| is also able to divide the impact results by administrative boundary and provide a breakdown of information about the gender and age of affected people.
id: |project_name| juga dapat menampilkan hasil dampak dengan batas administrasi dan menyediakan rincian informasi terkait dengan jenis kelamin dan usia dari penduduk terdampak.

source: Definitions:
id: Definisi:

source: Before we start, here are some definitions you may find useful.
id: Sebelum kita mulai, berikut adalah beberapa definisi yang mungkin akan berguna untuk Anda.

source: **Risk assessment:**
id: **Kajian Risiko:**

source: *"A methodology to determine the nature and extent of risk by analysing potential hazards and evaluating existing conditions of vulnerability that together could potentially harm exposed people, property, services, livelihoods and the environment on which they depend. "*
id: *"Sebuah metodologi untuk menentukan besaran risiko suatu bencana dengan menganalisa potensi ancaman dan melakukan evaluasi kondisi kerentanan di suatu wilayah yang berpotensi dapat membahayakan penduduk, harta benda, layanan, kehidupan dan lingkungan masyarakat di wilayah tersebut."*

source: **Contingency planning:**
id: **Rencana Kontinjensi:**

source: *"A management process that analyses specific potential events or emerging situations that might threaten society or the environment and establishes arrangements in advance to enable timely, effective and appropriate responses to such events and situations."*
id: *"Proses manajemen perencanaan yang menganalisa secara spesifik potensi terjadinya kejadian dan situasi bencana yang dapat membahayakan penduduk atau lingkungan sekitar serta dapat membuat suatu kebijakan dalam melakukan respon secara tepat dan efektif jika kejadian dan situasi bencana tersebut benar-benar terjadi."*

source: **Response:**
id: **Respon:**

source: *"The provision of emergency services and public assistance during or immediately after a disaster in order to save lives, reduce health impacts, ensure public safety and meet the basic subsistence needs of the people affected."*
id: *"Aktifitas yang harus dilakukan berupa pelayanan untuk kondisi darurat dan layanan publik ketika atau tepat setelah terjadinya suatu bencana dalam rangka untuk menyelamatkan nyawa, meminimalisir dampak gangguan kesehatan, memastikan penduduk aman dan menyediakan kebutuhan dasar untuk penduduk yang terdampak."*

source: Source: `<http://www.unisdr.org/we/inform/terminology>`_
id: Sumber: `<http://www.unisdr.org/we/inform/terminology>`_

source: What is disaster management?
id: Apa itu manajemen penanggulangan bencana?

source: In the context of disaster management, the expected 'normal' situation is that there is no disaster in progress, and people are going about their normal daily lives. Disaster managers need to plan for the occasions when the 'normal' situation has been replaced by a disaster and people can no longer go about their normal daily lives. In order to prepare for such situations, disaster managers need to have a basic understanding of questions like:
id: Dalam konteks manajemen penanggulangan bencana, situasi 'normal' adalah kondisi dimana tidak terdapat potensi bencana akan terjadi, dan masyarakat menjalani kehidupan sehari-hari mereka dengan normal. Manajer penanggulangan bencana butuh untuk memiliki suatu rencana jika sewaktu-waktu kondisi 'normal' tersebut berubah menjadi kondisi bencana dan masyarakat menjadi terancam serta tidak dapat menjalani kehidupan sehari-hari mereka dengan normal. Dalam rangka mempersiapkan situasi seperti itu, manajer penanggulangan bencana perlu untuk memiliki pengertian mendasar untuk menjawab pertanyaan-pertanyaan sebagai berikut:

source: how many people might be in the affected area?
id: berapa banyak jumlah orang yang berada di area terdampak?

source: how might those people be impacted?
id: bagaimana dampak yang dapat ditimbulkan untuk masyarakat?

source: For example are they likely to be injured, stranded, deceased, or unable to continue with their normal economic activities; have they lost access to food and water?
id: Sebagai contoh apakah penduduk akan terluka, hilang, meninggal dunia, atau tidak dapat menjalankan aktifitas ekonomi mereka; apakah mereka kehilangan akses untuk mendapatkan makanan dan air?

source: how will roads in the affected area be impacted?
id: bagaimana dampak terhadap jalan-jalan yang berada di area terdampak?

source: how many dwellings in the affected will be affected? And to what degree?
id: berapa banyak rumah penduduk yang terdampak? seberapa parah tingkat kerusakannya?

source: For example in a flood are buildings dry, wet (but still possibly habitable) or flooded (with occupants evacuated)?
id: Sebagai contoh di suatu kejadian banjir apakah bangunan-bangunan tersebut kering, basah (tapi masih dapat ditempati) atau kebanjiran (dengan penghuni harus dievakuasi)?

source: if people are affected, how many of them are likely to be women, children, pregnant, elderly etc.?
id: jika penduduk terdampak, berapa banyak dari mereka yang merupakan wanita, anak-anak, wanita hamil, orang tua, dsb.?

source: Knowing the likely answers to these questions can be helpful to disaster managers. For example if you are aware of how many people live in flood prone areas you can estimate how many temporary shelters might be needed in the event of a disaster, how many provisions should be stockpiled in order to provide for the daily needs of affected people and so on. Having demographic breakdowns for the people likely to be affected, can help disaster managers include things like special dietary requirements for lactating women in their disaster management planning.
id: Mengetahui jawaban untuk pertanyaan-pertanyaan tersebut akan sangat membantu untuk manajer penanggulangan bencana. Sebagai contoh jika anda mengetahui berapa banyak penduduk yang tinggal di wilayah rawan banjir maka anda dapat mengestismasi berapa banyak pos-pos evakuasi yang butuh disediakan jika banjir terjadi di wilayah tersebut, berapa banyak persediaan yang sebaiknya disediakan dalam rangka memenuhi kebutuhan dari penduduk yang terdampak dan seterusnya. Memiliki rincian demografis dari penduduk yang mungkin akan terdampak, akan membantu manajer penanggulangan bencana untuk memasukkan hal-hal khusus seperti kebutuhan untuk ibu menyusui dalam rencana penanggulangan bencana yang mereka miliki.

source: This planning might also take into account expected impacts on infrastructure - for example by planning to have sufficient rescue boats should all the local roads be flooded.
id: Rencana penanggulangan bencana ini juga dapat memasukkan beberapa kebutuhan untuk fasilitas infrastruktur yang terdampak - sebagai contoh dengan memasukan jumlah perahu karet yang dibutuhkan jika jalan-jalan lokal yang ada terdampak banjir.

source: What is a hazard?
id: Apa itu ancaman?

source: In the context of |project_name| a hazard is any natural or human caused event or series of events that may negatively impact the population, infrastructure or resources in an area.
id: Dalam konteks |project_name| sebuah ancaman merupakan kejadian yang disebabkan oleh alam ataupun manusia atau sebuah rangkaian kejadian yang memiliki dampak negatif untuk penduduk, infrastruktur ataupun sumber daya di suatu wilayah.

source: Some examples of natural hazards:
id: Beberapa contoh dari ancaman alam:

source: a flood (caused by overflowing rivers, storm surge, localised precipitation that cannot drain effectively, or by engineering failure such as a dam or levee breach)
id: banjir (disebabkan oleh luapan sungai, hujan/badai, aliran air yang tidak diresap/dialirkan secara sempurna, atau kegagalan teknis seperti bendungan atau tanggul yang retak)

source: an earthquake and the resulting ground shaking that is produced by it
id: gempa bumi yang menyebabkan getaran di dalam dan permukaan tanah.

source: a volcano eruption and its associated hazards (lava flow, ash fall, lahar, pyroclastic flow)
id: letusan gunung berapi dan ancaman lain yang dibawanya (aliran lava, abu vulkanik, lahar, aliran piroklastik)

source: a tsunami
id: tsunami

source: Some examples of non-natural hazards:
id: Beberapa contoh dari ancaman non-alam:

source: a chemical spill
id: tumpahan bahan kimia

source: a nuclear plant failure
id: kegagalan pembangunan teknologi nuklir

source: an industrial fire / explosion
id: ledakan / kebakaran pabrik atau kawasan industri

source: It is important to note that |project_name| is not a hazard modelling tool. That means that you need to obtain your hazard data from elsewhere and bring it along ready to use in |project_name|. In this training course we will focus on natural hazards, so we will take a moment here to explain how hazard datasets might be made.
id: Sangat penting untuk diingat bahwa |project_name| bukan alat utuk membuat suatu model ancaman. Artinya, Anda harus memiliki data ancaman yang dapat Anda dapatkan dari tempat lain dan setelah itu dapat digunakan di |project_name|. Dalam panduan pelatihan ini kita akan fokus dalam ancaman alam, jadi sekarang kami akan menjelaskan bagaimana sebuah dataset ancaman dibuat.

source: There are three main ways that can be used to generate hazard datasets:
id: Ada tiga cara utama yang dapat digunakan untuk membuat dataset ancaman:

source: Local knowledge
id: Pengetahuan Lokal

source: Modelling
id: Pemodelan

source: Mapping
id: Pemetaan

source: This is probably the most practical way to gather hazard data quickly. One approach that has been effective in Indonesia is to hold mapping workshops where village chiefs and local officials are invited. The officials are asked to indicate which villages and sub-villages within their area of responsibility flood regularly.
id: Ini mungkin merupakan cara paling praktis untuk mendapatkan data ancaman secara cepat. Satu kajian yang telah terbukti efektif dilakukan di Indonesia adalah melakukan lokakarya pemetaan dimana melibatkan perwakilan desa seperti kepala desa dan aparat pemerintahan lokal terkait. Aparat pemerintahan lokal kemudian akan diminta untuk menjelaskan wilayah mana saja di desa mereka yang sering terkena banjir.

source: Instead of simply mapping which areas are flooded, it is also possible to take another approach and map each flood event, using the same boundaries (village / sub-village). During the event community officials can use online systems to update the status of the flood waters in their area.
id: Disamping memetakan area mana saja yang terkena banjir, dimungkinkan pula menggunakan pendekatan lain dan memetakan setiap kejadian banjir yang pernah terjadi menggunakan batas administrasi yang sama (desa/RW). Selama kegiatan tersebut, aparat pemerintah lokal dapat menggunakan sistem online untuk memperbaharui kondisi banjir di area mereka.

source: A key requirement for any local knowledge based process is that there are suitable mapping units available to use for deciding if an area is flood prone or not. In some cases participants may need to capture these, in other cases village or sub-village boundaries can be used. Using administrative boundaries may not always be ideal since the flood extents are unlikely to align well with the boundaries, but it may be sufficient for broad planning purposes; especially when response activities are managed at the same administrative level.
id: Syarat kunci untuk proses yang berbasiskan pengetahuan lokal adalah tedapat unit pemetaan yang sesuai yang tersedia untuk digunakan dalam menentukan apakah suatu wilayah merupakan rawan banjir atau tidak. Dalam beberapa kasus, peserta mungkin butuh untuk melihat hal tersebut, dalam kasus yang lain penggunaan batas administrasi desa atau RW juga dimungkinkan. Menggunakan batas administrasi mungkin tidak dapat selalu menjadi ide yang baik karena luasan banjir biasanya tidak selalu sama dengan batas administrasi, akan tetapi mungkin akan cocok untuk tujuan jangka panjang; khususnya ketika respon tanggap bencana diaktifkan dan dikelola di tingkat administrasi yang sama.

source: Modelling floods is an entire discipline in its own right. Flood modelling can be carried out by combining factors such as precipitation, geology and runoff characteristics, terrain etc. to derive a model of impending or current flood. Modelling can use data interpolation techniques - e.g. by taking flood depth readings manually or using telemetry from various sites around the flood prone area, flood depths can be interpolated to estimate the depth at places that were not sampled.
id: Pemodelan banjir adalah seluruh disiplin ilmu dalam banjir itu sendiri. Pemodelan banjir dapat dilakukan dengan menggabungkan beberapa faktor seperti curah hujan, geologi dan karakteristik limpasan, kondisi medan dll untuk mendapatkan model banjir yang akan datang atau banjir saat ini. Pemodelan ini dapat menggunakan teknik interpolasi Data - contohnya dengan mengambil kedalaman banjir secara manual atau menggunakan telemetri dari berbagai tempat di sekitar wilayah rawan banjir, kedalaman banjir dapat diinterpolasi untuk memperkirakan kedalaman di tempat-tempat yang belum diberikan sampel.

source: Another modelling approach used by engineers is to install depth sensors upstream of the catchment and then try to model how much water is coming into the catchment area based on depth and flow rates. This has the potential advantage of giving early warning before floods enter the flood prone area, although it also has the disadvantage that localised rainfall may not be accurately considered in the model.
id: Metode pemodelan lain yang digunakan oleh para peneliti adalah menginstal sensor kedalaman permukaan dari area tangkapan dan mencoba memodelkan berapa banyak air yang akan masuk ke area tangkapan tersebut berdasarkan kedalaman dan kecepatan aliran air. Metode ini memiliki keuntungan karena dapat memberikan peringatan awal sebelum banjir memasuki wilayah rawan bencana, walaupun metode ini juga memiliki kekurangan yaitu perhitungan model ini akan menjadi kurang akurat apabila yang dihitung adalah curah hujan lokal.

source: Using a digital elevation model (DEM) and a stream network, it is also possible to generate a simple model of which areas might be inundated by a water rise in the river network of a certain amount. DEM cells adjacent to the stream network which are below the flood-rise threshold will be considered flooded and then those cell neighbours can in turn be considered so as to ensure that only contiguous areas in the DEM are flagged as inundated. There are various other approaches that can be used to model flood potential that involve using a DEM.
id: Menggunakan model ketinggian dijital (DEM) dan jaringan sungai, juga dapat menjadi salah satu cara untuk membuat model banjir sederhana dimana suatu area dapat tergenang akibat dari kenaikan air di salah satu jaringan sungai. Sel DEM yang bertampalan dengan jaringan sungai dan berada di bawah ambang batas kenaikan banjir akan dianggap terdampak banjir begitu juga sel-sel yang berada di sekitarnya sehingga hanya DEM yang berada di area itu saja yang ditandai sebagai area terdampak. Terdapat beberapa macam pendekatan yang dapat digunakan untuk membuat model potensi banjir menggunakan DEM.

source: One advantage of using a modelling approach is that it allows us to forecast less frequent events. For example, there may not be localised knowledge about 1 in 50 or 100 year flood events and their impacts, but these can be estimated using modelling techniques.
id: Salah satu keuntungan menggunakan metode pemodelan adalah dapat memungkinkan kita untuk membuat model untuk kejadian bencana yang jarang terjadi. Sebagai contoh, mungkin kejadian banjir yang terjadi setiap 50 hingga 100 tahun sekali tidak dapat diukur menggunakan pengetahuan lokal, akan tetapi dengan menggunakan teknik pemodelan hal ini dapat dilakukan.

source: Single-event versus multiple-event hazards
id: Ancaman kejadian-tunggal melawan ancaman kejadian-majemuk

source: Hazard data used in |project_name| can represent either single-event or multiple-event. Single event hazards are useful when you want to estimate scenarios like *'how many people would be affected if we had another flood like in 2013'.* A single event hazard covers a short span of time - like a single flood or earthquake event. Single event data is also the most suitable to use for events which are stochastic e.g. earthquakes which seldom occur at the same place and with the same intensity more than once.
id: Data ancaman yang digunakan dalam |project_name| dapat mewakili kejadian-tunggal ataupun kejadian-majemuk. Ancaman kejadian tunggal berguna ketika Anda ingin menghitung skenario seperti *'berapa banyak penduduk yang dapat terdampak jika terjadi banjir seperti di tahun 2013'.* Suatu ancaman kejadian tunggal terjadi dalam kurun waktu yang cepat dan spesifik- seperti kejadian banjir tunggal ataupun kejadian gempa bumi. Data kejadian tunggal juga cocok digunakan dalam kejadian bencana seperti gempa bumi dimana akan sangat jarang terjadi suatu gempa bumi di tempat dan waktu yang sama dengan intensitas yang sama untuk kedua kalinya.

source: Multiple-event data are useful when you would like to plan for disasters that repeatedly affect the same area. For example over the course of 10 years, the same districts or sub-districts may get flooded, though not on every event. Flood and volcano eruptions may be good candidates for using multiple-event data in your disaster management planning.
id: Data kejadian-majemuk berguna ketika anda ingin membuat suatu rencana untuk bencana yang terjadi secara terus-menerus di area yang sama. Sebagai contoh lebih dari 10 tahun, suatu kabupaten atau kecamatan hampir selalu terkena banjir, walaupun tidak dalam setiap kejadian. Banjir dan letusan gunung berapi merupakan contoh yang baik untuk mewakili data kejadian-majemuk dalam rencana manajemen penanggulangan bencana anda.

source: Requirements for using flood data in |project_name|
id: Persyaratan untuk menggunakan data banjir di |project_name|

source: **Key notes for floods**
id: **Catatan penting untuk banjir**

source: Vector polygon data or raster data
id: Data vektor poligon atau data raster

source: Vector
id: Vektor

source: A field representing whether the polygon is flood prone or not.
id: Sebuah area menunjukkan apakah poligon tersebut merupakan area terdampak banjir atau tidak.

source: A simple grid with cell values that represent water depth
id: Sebuah kotak yang memiliki nilai piksel yang menunjukan ketinggian air

source: Source
id: Sumber

source: Can be obtained from community mapping or a national mapping agency
id: Dapat didapatkan dari komunitas pemetaan atau Badan Informasi Geospasial

source: What is exposure?
id: Apa itu keterpaparan?

source: In the context of |project_name|, exposure refers to people, infrastructure or land areas that may be affected by a disaster. Currently |project_name| supports four kinds of exposure data:
id: Dalam konteks |project_name|, keterpaparan merujuk kepada penduduk, infrastruktur atau area penggunaan lahan yang mungkin terdampak akibat dari kejadian suatu bencana. Saat ini |project_name| telah dapat mendukung 4 jenis data keterpaparan:

source: roads
id: jalan

source: buildings
id: bangunan

source: population / people
id: populasi / penduduk

source: landcover
id: tutupan lahan

source: Roads data
id: Data jalan

source: Road datasets are a useful data source when you want to understand the impact of a flood on roads infrastructure. With the |project_name| flood on roads impact functions; you can calculate which roads of which type might be impacted by a flood.
id: dataset jalan merupakan sumber data yang sangat berguna ketika anda ingin melihat dampak suatu kejadian banjir terhadap infrastruktur jalan. Dengan fungsi dampak banjir terhadap jalan di |project_name|; anda dapat menghitung jalan mana saja dan tipe jalan apa yang terdampak banjir.

source: Very often there will be national datasets available for roads. In this case you should contact your national mapping agency for up-to-date datasets. The OpenStreetMap project is an excellent source of exposure data. The data is freely available, generally well maintained and a vital resource for disaster management planners. There are numerous ways to download OpenStreetMap roads data, but our recommended way is to download the data using the OSM download tool provided with |project_name|.
id: Seringkali terdapat dataset nasional untuk jalan yang tersedia. Dalam hal ini anda harus menghubungi Badan Informasi Geospasial untuk memeriksa dan memperbaharui dataset tersebut. Proyek OpenStreetMap merupakan salah satu sumber data keterpaparan yang sangat baik. Data yang ada tersedia secara gratis, secara umum mudah untuk dikelola, dan merupakan sumber penting untuk rencana penanggulangan bencana. Terdapat beberapa cara untuk men-download data OpenStreetMap seperti jalan, tetapi kami merekomendasikan untuk menggunakan alat Download OSM yang telah disediakan di |project_name|.

source: **Key notes for road data**
id: **Catatan penting untuk data jalan**

source: Vector line data
id: Data vektor garis

source: A field representing road type
id: Sebuah field yang menunjukkan jenis jalan

source: Notes
id: Catatan

source: Topologically correct data are best but not essential
id: Koreksi topologi data itu bagus tetapi tidak esensial

source: Buildings (structure) data
id: Data bangunan (struktur)

source: Like roads, building footprints can be a useful dataset to have for understanding the impacts of a flood. For example you may wish to know 'how many buildings might be flooded, and what types of buildings are they?'. In |project_name| you do not need to use engineering quality data. We are more concerned with the numbers and types of structures affected by a disaster and do not work at engineering tolerances needed when, for example, planning a new water mains system.
id: Seperti jalan, bangunan juga merupakan dataset yang sangat berguna untuk memahami dampak dari kejadian banjir. Sebagai contoh, Anda mungkin ingin mengetahui 'berapa banyak bangunan yang mungkin terdampak banjir dan jenis bangunan apa saja?'. Dengan |project_name| anda tidak perlu untuk menggunakan teknik kualitas data. Kami sangat memperhatikan jumlah serta jenis struktur bagunan terdampak dari suatu bencana dan tidak menggunakan teknik toleransi, sebagai contoh, merencanakan membuat sistem saluran air baru.

source: **Key notes for buildings data**
id: **Catatan penting untuk data bangunan**
