Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/socialisation/inasafe_concepts.po
Languages: id

source: Minimum needs are a population specific reporting component for the impact summary. They are based on generic or regional preferences and define the daily food and well-being requirements for each individual who may be displaced during a disaster. For example you could specify that each person should receive 20l of fresh drinking water per day, 50l of bathing water and so on. |project_name| will calculate these numbers to provide an estimate of the total needs for the displaced population.
id: Kebutuhan minimum adalah laporan spesifik untuk analisis yang terkait dengan kependudukan. Laporan ini berdasarkan peraturan umum atau daerah dan menjelaskan kebutuhan makanan perhari dan kebutuhan untuk setiap individu yang diungsikan ketika terjadi bencana. Sebagai contoh anda bisa menentukan bahwa setiap orang harus mendapatkan 20l air minum tiap hari, 50l air bersih dan sebaganya. |project_name| akan menghitung angka ini untuk memberikan sebuah estimasi dari kebutuhan total untuk penduduk yang mengungsi.

source: What are action checklists?
id: Apa itu daftar tindakan?

source: Action checklists are generated lists of things disaster managers should consider when implementing their disaster management plan. Currently the action checklists are fairly simplistic - they are intended to prompt discussion and stimulate disaster managers to think about the important contingencies they should have in place.
id: Daftar tindakan merupakan daftar pertanyaan yang dihasilkan untuk manager bencana dan bisa dijadikan pertimbangan ketika ingin mengimplementasikan manajemen bencana mereka. Saat ini daftar tindakan yang ada sangatlah simple - ditujukan untuk memunculkan diskusi dan menstimulasi manager bencana untuk berpikir tentang pentingnya rencana kontijensi.
