Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/socialisation/inasafe_concepts.po
Languages: id

source: Vector polygon data
id: Data vektor poligon

source: A field representing building type
id: Field yang menunjukkan jenis bangunan

source: |project_name| does not need 'engineering quality' data
id: |project_name| tidak membutuhkan data dengan 'kualitas teknik'

source: Population data
id: Data populasi

source: Population data can often be obtained from your census bureau or through various online data sources. One problem with population data is that it is often quite coarse (represented using a raster with a large pixel size) and so analysis at large scales (e.g. a small neighbourhood) using population data may not always be the best idea. Currently |project_name| only supports raster based census data, but in the near future we will be releasing a version that supports assigning population estimates to buildings using census data. One of the best online resources for population data is 'WorldPop' - a project that aims to provide population data for anywhere in the globe produced in a standardised and rigorous way.
id: Data populasi sering didapatkan dari badan sensus atau melalui sumber data secara online. Satu masalah yang sering didapat dengan data populasi adalah nilai data yang dimiliki kasar (diwakili oleh data raster dengn ukuran piksel yang besar) sehingga analisis menggunakan skala besar ( contohnya wilayah administrasi RT) untuk data populasi bukan menjadi hal yang baik. Saat ini |project_name| hanya mendukung data raster berdasarkan data sensus, akan tetapi di masa yang akan datang kami akan mengeluarkan versi terbaru yang sudah mendukung perkiraan populasi untuk bangunan menggunakan data sensus. Salah satu sumber data populasi yang bagus dapat anda dapatkan di 'WorldPop' - sebuah proyek yang menyediakan data populasi seluruh dunia dan diproduksi secara global serta distandarisasi secara cermat.

source: **Key notes for population data**
id: **Catatan penting untuk data populasi**

source: Raster 'cell' data
id: 'Sel' data raster

source: Requirements
id: Persyaratan

source: Currently the data should be in EPSG:4326 CRS
id: Saat ini data harus sudah memiliki sistem referensi koordinat EPSG:4326

source: Make sure you know if your data represent density or count
id: Pastikan anda mengetahui bahwa data populasi anda menunjukkan kepadatan atau jumlah penduduk

source: Can be obtained from a national mapping agency
id: Dapat diperoleh dari Badan Informasi Geospasial

source: Landcover data
id: Data tutupan lahan

source: Landcover data can often be obtained from national mapping agencies or through various online data sources. Landcover data are useful if you want to assess the impact of a hazard event such as a volcanic eruption on crops.
id: Data tutupan lahan dapat diperoleh dari Badan Informasi Geospasial atau melalui berbagai sumber data yang dapat anda temukan di internet. Data tutupan lahan akan sangat berguna jika anda ingin menghitung dampak dari suatu kejadian bencana seperti letusan gunung berapi pada ladang ataupun sawah.

source: **Key notes for landcover data**
id: **Catatan penting untuk data tutupan lahan**

source: A field representing landcover type
id: Field yang menunjukkan jenis tutupan lahan

source: National mapping agency
id: Badan Informasi Geospasial

source: Places data
id: Tempat data

source: Places data can often be obtained from national mapping agencies or through various online data sources. Places data are useful if you want to assess the impact of a hazard event such as a volcanic ash event on place.
id: Tempat data dapat diperoleh dari Badan Informasi Geospasial atau melalui berbagai sumber data online. Tempat data berguna jika anda ingin menilai dampak dari kejadian ancaman seperti kejadian abu vulkanik.

source: **Key notes for places data**
id: **Catatan kunci untuk data tempat**

source: Vector point data
id: Data titik vektor

source: A field representing place name
id: Sebuah field mewakili nama tempat

source: There must be a field representing place name
id: Terdapat field yang mewakili nama tempat

source: What is aggregation?
id: Apa itu aggregasi?

source: Aggregation is the process whereby we group the results of the analysis by district so that you can see how many people, roads or buildings were affected in each area. This will help you to understand where the most critical needs are, and to generate reports as shown in the image below. Aggregation is optional in |project_name| - if you do not use aggregation, the entire analysis area will be used for the data summaries. Typically aggregation layers in |project_name| have as attributes the name of the district or reporting area. It is also possible to use extended attributes to indicate the ratio of men and women; youth, adults and elderly living in each area. Where these are provided and the exposure layer is population, |project_name| will provide a demographic breakdown per aggregation area indicating how many men, women etc were probably affected in that area.
id: Agregasi adalah proses dimana kita mengelompokkan hasil analisis berdasarkan batas administrasi seperti kabupaten sehingga Anda dapat mengetahui berapa banyak penduduk, jalan atau bangunan yang terkena dampak di masing-masing wilayah adminitrasi. Hal ini akan membantu Anda untuk memahami dimana area yang paling membutuhkan bantuan , dan untuk menghasilkan laporan seperti yang ditunjukkan pada gambar di bawah. Agregasi merupakan pilihan yang terdapat di |project_name| - Jika Anda tidak ingin menggunakan agregasi, maka hasil dampak anda akan ditunjukkan sebesar area analisis. Layer aggregasi di |project_name| memiliki nama masing-masing wilayah administrasi di area analisis. Selain itu, dimungkinkan juga memasukkan atribut lain seperti untuk menunjukkan rasio laki-laki dan perempuan ; remaja , dewasa dan orang tua di masing-masing wilayah administrasi. Ketika aggregasi ini digunakan beserta dengan layer keterpaparan penduduk, |project_name| akan memberikan rincian demografis per area agregasi yang menunjukkan berapa banyak pria, wanita dll yang mungkin terkena dampak di daerah itu.

source: What is contextual data?
id: Apa itu data kontekstual

source: Contextual data are data that provide a sense of place and scale when preparing or viewing the results of analysis, while not actually being used for the analysis. For example you may include online maps to show the underlying relief of the study area, or an aerial image to show what buildings and infrastructure exist in the area.
id: Data kontekstual adalah data yang menyediakan gambaran dan skala menyeluruh dari suatu lokasi untuk membantu kita melihat hasil dari analisis dengan lebih baik, akan tetapi tidak digunakan sebagai data utama dalam membuat analisis. Sebagai contoh, Anda mungkin butuh untuk memasukkan peta online untukmenunjukkan kondisi topografi area analisis anda, atau sebuah citra satelit untuk menunjukkan bangunan serta infrastruktur apa saja yang ada di area tersebut.

source: Bing Aerial imagery for Jakarta, courtesy Bing Maps Open Layers
id: Citra satelit Bing untuk Jakarta, berasal dari Open Layers Bing Maps

source: What is the difference between raster and vector data?
id: Apa perbedaan antara data raster dan vektor?

source: Vector data is arguably the most common kind of data you will find in the daily use of GIS. It describes geographic data in terms of points that may be connected into lines and polygons. Every object in a vector dataset is called a feature, and is associated with data that describes that feature. The basic shape of objects stored in the vector data is defined with a two-dimensional coordinate system / Cartesian (x, y).
id: Data vektor dapat dikatakan sebagai jenis data yang paling umum yang akan Anda temukan dalam penggunaan SIG sehari-hari. Data Ini menggambarkan data geografis dalam bentuk poin, yang dapat dihubungkan menjadi garis dan poligon. Setiap objek dalam dataset vektor disebut fitur, dan berhubungan dengan data yang menggambarkan fitur tersebut. Bentuk utama dari objek data vektor ditunjukkan dengan bentuk dua dimensi dan memiliki sistem koordinat / kartesius (x,y).

source: Raster data is different from vector data. While vector data has discrete features constructed out of vertices, and perhaps connected with lines and/or areas; raster data, is like an image. Although it may portray various properties of objects in the real world, these objects don't exist as separate objects; rather, they are represented using pixels or cells of various different numerical values. These values can be real and represent different characteristics of the geography, such as water depth or amount of volcanic ash; or they can be a code than is related to the type of land use or the hazard class.
id: Data raster berbeda dengan data vektor. Jika data vektor memiliki bentuk yang tersusun dari titik dan simpul yang saling terhubung satu sama lain sehingga dapat menghasilkan bentuk garis dan/atau area; data raster, lebih mirip sebuah foto. Walaupun data raster ini menangkap berbagai macam bentuk informasi objek di dunia nyata, informasi tersebut tidak terpisah satu dengan yang lain; bahkan, informasi atribut tersebut direpresentasikan dengan piksel atau sel yang memiliki nilai angka yang berbeda-beda. Nilai ini dapat merupakan nilai nyata dan menunjukkan karakteristik geografi yang berbeda, seperti kedalaman air atau jumlah dari abu vulkanik; atau mereka bisa berupa kode yang menunjukkan jenis penggunaan lahan atau tingkatan ancaman.

source: Creating vector data is like using a pen, where you can draw a point, a line or a polygon, Raster data is like taking a picture with a camera, where each square has one value, and all the squares (pixels) combine to make a picture.
id: Membuat data vektor seperti menggunakan sebuah pulpen, dimana Anda dapat menggambar sebuah titik, garis atau poligon. Data raster seperti mengambil sebuah gambar dengan kamera, dimana setiap kotak memiliki nilai, dan semua kotak (pixel) tergabung menjadi sebuah gambar.

source: Both vector and raster data can be used in |project_name|. For example, we use vector data for the extent of a flood hazard and as well as roads and building footprint; but we use raster data for modelled hazards such as flood depth, tsunami inundation and for population exposure.
id: Baik data vektor maupun raster dapat digunakan dalam |project_name|. Sebagai contoh, kita menggunakan data vektor untuk ancaman banjir serta jalan dan bangunan; tetapi kita menggunakan data raster untuk model ancaman seperti kedalaman banjir, genangan tsunami dan keterpaparan populasi.

source: What is the difference between continuous and classified data?
id: Apa perbedaan antara data kontinyu dan data terklasifikasi?

source: In |project_name| we differentiate between data which is continuous and data which is classified. The terms can be applied equally to both hazard and exposure data. **Continuous** data represent a **continuously varying phenomenon** such as depth in meters, population counts and so on.
id: Dalam |project_name| kita membedakan antara data mana yang merupakan data kontinyu dan mana yang merupakan data terklasifikasi. Ketentuan tersebut juga dapat digunakan baik untuk data ancaman dan data keterpaparan. Data **Kontinyu** mewakilkan sebuah **fenomena yang bervasiasi secara terus menerus** seperti kedalaman air dalam meter, jumlah penduduk dan seterusnya.

source: Continuous population data - courtesy WorldPop
id: Data kontinyu populasi - berasal dari WorldPop

source: **Classified** data represent **named groups of values**, for example, high, medium and low hazard. Grouping values works well when you wish to reduce data preparation complexity or deal with local variances in the interpretation of data. For example, a flood depth of 50cm may represent a high hazard zone in an area where people commonly have basements in their houses, and a low hazard zone in areas where people commonly build their houses on raised platforms.
id: Data **terklasifikasi** menunjukkan **kelompok dari sebuah nilai**, sebagai contoh ancaman tinggi, medium, dan rendah. Mengelompokkan nilai akan membantu ketika anda ingin menyederhanakan data atau ketika memiliki banyak variasi nilai dalam melakukan intrepetasi data. Sebagai contoh, kedalaman banjir sebesar 50 cm mungkin akan dianggap area ancaman tinggi pada area yang penduduknya memiliki rumah sejajar dengan permukaan tanah, tetapi dianggap area ancaman rendah pada area yang penduduknya memiliki rumah panggung / tinggi.

source: Classified raster flood data - courtesy BNPB/Australian Government
id: Data Raster Banjir Terklasifikasi - sumber BNPB/Pemerintah Australia

source: What is the analysis extent?
id: Apa itu area analisis?

source: In |project_name| you need to explicitly state what the intended analysis extent should be. In other words, you need to tell InaSAFE where the analysis should be carried out. There is a tool in InaSAFE that will allow you to drag a box around the intended analysis area - you should always check that you have done this before starting your analysis.
id: Di |project_name| Anda butuh untuk secara eksplisit menjelaskan seberapa besar luas area analisis Anda. Dengan kata lain, Anda butuh memberitahukan InaSAFE dimana area analisis yang anda inginkan. Terdapat sebuah alat di InaSAFE yang akan membantu anda membuat sebuah kotak untuk menentukan area analisis Anda - Anda sebaiknya mengecek apakah area analisis Anda sudah sesuai sebelum memulai analisis.

source: |project_name| will show you what your current desired analysis extent is (blue line in green box), what the extent of your last analysis was (red box in the image above) and what your effective extent is (green box in the image above). The effective extent may not correspond exactly to your desired analysis extent because |project_name| always aligns the extent to the edge of raster pixels.
id: |project_name| akan menunjukkan batas dan luasan area analisis anda saat ini (garis biru di dalam kotak hijau), batas dan luasan area analisis anda sebelumnya (kotak merah pada gambar di atas) serta batas dan luasan area analisis yang efektif untuk anda (kotak hijau pada gambar di atas). Area analisis yang efektif mungkin tidak akan terlalu sesuai dengan area analisis yang anda inginkan karena |project_name| selalu mensejajarkan luasan area analisis dengan luas dari piksel data raster.

source: What is an Impact Function?
id: Apa itu Fungsi Dampak?

source: An Impact Function (often abbreviated to IF) is software code in |project_name| that implements a particular algorithm to determine the impact of a hazard on the selected exposure. Running an impact function is done when you have prepared all your input data, defined your analysis extent and wish to now see the impact outputs.
id: Fungsi Dampak (biasa disingkat dengan IF) adalah kode perangkat lunak di |project_name| yang mengimplementasikan algoritma tertentu untuk menentukan dampak dari suatu ancaman terhadap data keterpaparan tertentu. Menjalankan fungsi dampak dapat dilakukan jika Anda telah memasukkan semua data yang ingin anda analisis, menentukan area analisis anda dan melihat bentuk hasil dari dampak analisa.

source: Again, we should emphasise here that Impact Functions **do not model hazards** - they **model the effects** of one or more hazard events on an exposure layer. |project_name| groups its impact functions according to the kind of hazard they work on:
id: Tetapi, perlu diingat bahwa Fungsi Dampak itu **tidak membuat model ancaman** - dia hanya **memodelkan dampak** dari satu atau lebih kejadian ancaman untuk sebuah layer keterpaparan. |project_name| mengelompokkan fungsi dampak berdasarkan jenis ancaman yang dikerjakan:

source: Supported data types for each hazard type in |project_name|
id: Tipe data yang didukung oleh masing-masing tipe ancaman di |project_name|

source: Name Impact Functions
id: Nama Fungsi Dampak

source: Detail
id: Rincian

source: **Earthquake Impact Functions**
id: **Fungsi Dampak Gempa Bumi**

source: **Earthquake hazard**: continuous raster, classified raster, and classified polygon
id: **Ancaman Gempa Bumi**: raster kontinyu, raster klasifikasi, dan poligon terklasifikasi.

source: **Population exposure**: continuous raster with counts
id: **Populasi terpapar**: raster kontinyu dengan nilai pre pixel menunjukkan jumlah populasi

source: **Building exposure**: classified polygon or point with a type attribute
id: **Bangunan terdampak**: poligon terklasifikasi atau titik dengan atribut tipe

source: **Flood Impact Functions**
id: **Fungsi Dampak Banjir**

source: **Flood hazard**: continuous raster or classified polygon
id: **Ancaman banjir**: raster kontinyu atau poligon terklasifikasi

source: **Road exposure**: classified line with a type attribute
id: **Jaringan jalan terpapar**: klasifikasi garis dengan tipe attribut

source: **Tsunami Impact Functions**
id: **Fungsi Dampak Tsunami**

source: **Tsunami hazard**: continuous raster or classified polygon
id: **Ancaman Tsunami**: raster kontinyu atau poligon terklasifikasi

source: **Building exposure**: classified polygon with a type attribute
id: **Bangunan terpapar**: poligon terklasifikasi dengan tipe atribut

source: **Volcano Impact Functions**
id: **Fungsi Dampak Gunung Berapi**

source: **Volcano hazard**: continuous polygon, classified polygon, and point
id: **Ancaman Gunung Berapi**: poligon kontinyu, poligon terklasifikasi, dan titik

source: **Volcanic Ash Impact Functions**
id: **Fungsi Dampak Abu Vulkanik**

source: **Volcano hazard**: clasified polygon or continuous raster
id: **Ancaman Abu Vulkanik**: poligon terklasifikasi atau raster kontinyu

source: **Cyclone Impact Functions**
id: **Fungsi Dampak Angin Topan**

source: **Cyclone hazard**: clasified polygon or continuous raster
id: **Ancaman Angin Topan**: poligon terklasifikasi atau raster kontinyu

source: **Generic Impact Functions**
id: **Fungsi Dampak Umum**

source: **Generic hazard**: classified polygon, classified raster or continuous raster
id: **Ancaman umum**: poligon terklasifikasi, raster terklasifikasi, atau raster kontinyu

source: **Landcover exposure**: classified polygon with a type
id: **Keterpaparan Tutupan Lahan**: poligon terklasifikasi dengan tipe

source: A note about generic impact functions: Generic IF's are useful when your data does not conform to the a priori expectations of |project_name|. For example, you may wish to produce a report on buildings that might be affected by a landslide, drought, smoke haze or any other hazard that does not have an explicit Impact Function in |project_name|.
id: Catatan untuk fungsi dampak umum: fungsi dampak tersebut berguna ketika data anda tidak sesuai dengan fungsi yang tersedia di |project_name|. Sebagai contoh, anda mungkin ingin untuk menghasilkan laporan pada bangunan yang mungkin terdampak longsor, kekeringan atau asap kebakaran hutan atau mungkin bencana lain yang belum ada di fungsi dampak di |project_name|.

source: Each Impact Function will generate outputs that may include: - an impact map layer - an impact summary - minimum needs - action checklists
id: Setiap Fungsi Dampak akan menghasilkan keluaran yang mungkin termasuk - layer peta dampak - laporan analisis dampak - kebutuhan minimum - daftar tindakan

source: What is an impact layer?
id: Apa itu layer dampak?

source: An impact layer is a new GIS dataset that is produced as the result of running an impact function. It will usually represent the exposure layer. For example, if you do a flood analysis on buildings, the impact layer produced will be a buildings layer but each building will be classified according to whether it is dry, wet or flooded. |project_name| will typically apply its own symbology to the output impact layer to make it clear which are the impacted buildings. This is illustrated in the image below.
id: Layer dampak adalah dataset GIS baru yang dihasilkan sebagai hasil perhitungan analisis fungsi dampak. Ini biasanya merepresentasikan layer paparan. Contoh, jika anda menjalankan analisis banjir terhadap bangunan, layer dampak akan menghasilkan layer bangunan tetapi tiap bangunan akan terklasifikasikan sesuai dengan kondisi bangunan apakah bangunan tersebut kering, tergenang atau terendam. |project_name| akan mengaplikasikan simbologi mereka kedalam keluaran layer dampak untuk memberi informasi dimana bangunan terdampak. Seperti contoh dibawah ini.

source: It should also be noted that the impact layer will only include features / cells that occur within the analysis extent. All others will be 'clipped away'. It is very important to remember this when interpreting the map legend and the impact summary (see section below) because they are only relevant to the analysis area. The impact layer is not saved by default. If you want to save this spatial data you need to do this yourself.
id: Harap diingat bahwa layer dampak hanya akan berisikan fitur/sel yang muncul dalam area analisis. Lainnya akan dipotong. Sangatlah penting untuk mengingat ini ketika ingin mengintrepetasi legenda peta dan laporan analisis dampak (lihat bagian dibawah) karena mereka hanya relevan dalam area analisis. Layer analisis dampak ini tidak tersimpan otomatis dikomputer anda. Jika anda ingin menyimpan data spasial ini, anda harus melakukan sendiri.

source: What is the impact summary?
id: Apa itu laporan analisis dampak?

source: Whereas the impact layer represents spatial data, the impact summary is tabular and textual data. The impact summary provides a table (or series of tables) and other textual information with the numbers of buildings, roads or people affected, and includes other useful information such as minimum needs breakdowns, action checklists and summaries. The impact summary presents the results of the impact function in an easy to digest form. Our expectation that the numbers show here would form part of the input to your emergency management planning process - typically as a launch point for discussion and planning on how to have sufficient resources in order to cater for the impacted people, buildings or roads should a similar event to the one on which the scenario is based occur. An example of an impact summary is shown below.
id: Jika layer dampak merepresentasikan data spasial, maka laporan analisis dampak merupakan data tabel dan teks. Laporan analisis dampak ini menyediakan sebuah tabel (atau beberapa tabel) dan informasi teks lain dengan jumlah bangunan, jalan, atau penduduk terdampak, dan juga informasi tambahan lain seperti penjabaran kebutuhan minimum, daftar tindakan, dan rangkuman. Laporan analisis dampak menyediakan hasil fungsi dampak menjadi kedalam format yang lebih mudah dibaca. Ekspetasi kami adalah angka yang muncul disini bisa menjadi bagian masukan ke proses perencanaan managemen respon bencana - terutama untuk bahan diskusi dan perencanaan bagaimana mendapatkan sumber daya yang cukup untuk membantu orang yang terdampak, bangunan, atau jalan dalam skenario kejadian yang sejenis dengan skenario kejadian yang biasa muncul. Contoh fungsi dampak seperti dibawah ini.

source: Example impact summary table showing breakdown of buildings flooded.
id: Contoh tabel analisis dampak menunjukkan penjabaran dari bangunan terdampak banjir.

source: What are minimum needs?
id: Apa itu kebutuhan minimum?
