Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/socialisation/introduction.po
Languages: id

source: Introducing |project_name|
id: Pengantar |project_name|

source: In this section we will introduce |project_name| and provide some background on the |project_name| project.
id: Dalam bab ini kami akan memperkenalkan |project_name| dan memberikan gambaran umum tentang |project_name|.

source: About the |project_name| project
id: Tentang proyek |project_name|

source: The |project_name| project (http://inasafe.org) was started in order to provide a tool for disaster managers who want to understand what the potential impacts of a disaster will be. Initially the focus of activity was in Indonesia - a country that is highly vulnerable to different disasters including flood, tsunami, volcano, earthquakes, as well as other localised disasters such as landslides, wildfire and so on. InaSAFE has since been adopted for use in many other countries - it is not 'Indonesia specific'.
id: Proyek |project_name| (http://inasafe.org) dimulai dengan tujuan untuk menyediakan alat bagi para manager penanggulangan bencana yang ingin mempelajari potensi dampak dari suatu bencana. Awal mula fokus kegiatan ini adalah di Indonesia - negara yang rentang terhadap berbagai bencana seperti banjir, tsunami, gunung berapi, gempa bumi, dan juga bencana lokal seperti longsor, kebakaran hutan, dsb. InaSAFE saat ini sudah diadopsi ke berbagai negara - tidak hanya spesifik Indonesia saja.

source: The underlying goal of InaSAFE is to encourage and facilitate better planning for disasters - our slogan is **"better planning saves lives"**.
id: Tujuan utama dari InaSAFE adalah untuk memfasilitasi dan membantu perencaanaan yang lebih baik dalam menghadapi bencana - slogan kami yaitu **"better planning saves lives"** (perencanaan yang baik menyelamatkan banyak nyawa).

source: Each country in the world faces its own unique challenges. According to the "Global Assessment Report for Disaster Risk Reduction (GAR)" for Indonesia the chief concerns are volcanoes and floods - other countries will face different challenges.
id: Tiap negara di dunia menghadapi tantangan tersendiri. Berdasarkan "Global Assessment Report for Disaster Risk Reduction (GAR) / Laporan Awal Global untuk Pengurangan Ancaman Bencana" untuk bencana yang diperhatikan oleh Indonesia adalah gunung berapi dan banjir - negara lain menghadapi kendala yang berbeda.

source: Key disaster risks for Indonesia - Image courtesy `<http://www.preventionweb.net/english/hyogo/gar/2015/en/profiles/GAR_Profile_IDN.pdf>`_
id: Resiko bencana untuk Indonesia - foto berdasarkan `<http://www.preventionweb.net/english/hyogo/gar/2015/en/profiles/GAR_Profile_IDN.pdf>`_

source: Losses resulting from disasters in Indonesia - Image courtesy `<http://www.preventionweb.net/english/hyogo/gar/2015/en/profiles/GAR_Profile_IDN.pdf>`_
id: Kerugian akibat bencana di Indonesia - foto dari `<http://www.preventionweb.net/english/hyogo/gar/2015/en/profiles/GAR_Profile_IDN.pdf>`_

source: In the |project_name| project we strive to provide a tool that will enhance the abilities of disaster managers to prepare for disasters and to reduce the impact of those disasters on the local population and infrastructure.
id: Pada proyek |project_name| kita menyediakan alat yang akan meningkatkan kemampuan manager penanggulangan bencana untuk menyiapkan kajian untuk bencana dan mengurangi dampak bencana tersebut tehadap populasi lokal dan infrastruktur.

source: Open source
id: Sumber terbuka

source: From the beginning, |project_name| has been an open source project (GPL license). This means there are no licensing fees, the software can be freely copied and shared with anyone, and the source codes used to create the software are freely available which means that anyone with a little technical knowledge can contribute to the project. Being an Open Source project is important for us because we want as many people as possible to be able to use and improve the software. If 'better planning saves lives', having a tool that can be used by everyone to do better planning makes sense, right?
id: Dari awal, |project_name| merupakan proyek dengan sumber terbuka (GPL license). Ini berarti tidak ada biaya untuk lisensi, perangkat lunak dapat secara gratis di sebarluaskan dan dibagikan ke semua orang, dan sumber kode yang digunakan untuk membuat perangkat lunak ini tersedia secara gratis yang berarti semua orang yang memiliki kemampuan teknis dapat ikut berkontribusi kedalam proyek. Menjadi proyek dengan sumber terbuka merupakan hal yang penting untuk kami karena kami ingin banyak orang yang bisa menggunakan dan meningkatkan perangkat lunak ini. Jika mempunyai alat yang bisa digunakan untuk semua orang dalam mengembangkan kemampuan perencanaannya, hal ini tidaklah buruk bukan?

source: Open data
id: Data terbuka (Open data)

source: A key driving force in the ability to use tools such as |project_name| is open access to relevant, up-to-date and well maintained geospatial data. Without roads, buildings, administrative areas, flood and population data etc., a tool like |project_name| would be impossible to use. OpenStreetMap.org, WorldPop and many government and non-government agencies around the world have been leading the effort to make such datasets available. We cannot emphasise enough the importance of government in taking a lead role in making their data freely available so that it can be used for the benefit of their citizens.
id: Salah satu faktor yang berpengaruh dalam menggunakan alat |project_name| ini adalah akses terbuka terhadap data yang relevan, terbaru dan data geospasial yang dikelola secara baik. Tanpa jaringan jalan, bangunan, batas administrasi, data bencana dan data populasi, dst, sebuah |project_name| tidak mungkin digunakan. OpenStreetMap.org, WorldPop, dan banyak sekali pemerintah dan non pemerintah di seluruh dunia yang membuat data tersebut tersedia. Kita tidak bisa lebih menekankan pentingnya peran pemerintah dalam memimpin untuk membuat data mereka tersedia secara bebas sehingga kita bisa menggunakannya untuk keuntungan penduduk mereka sendiri.

source: Watch the |project_name| promotional movie
id: Lihat video promosi untuk |project_name|

source: If you want to know more you can watch the promotional movie. `<http://data.inasafe.org/Movies/InaSAFE_Promo_EN.mp4>`_
id: Jika anda ingin mengetahui lebih lanjut anda bisa melihat video promosi `<http://data.inasafe.org/Movies/InaSAFE_Promo_EN.mp4>`_
