Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/socialisation/run_intermediate_inasafe.po
Languages: id

source: Take a look at the |project_name| panel dock to make sure building polygons and roads have a keyword defined. If they do not you can define one using :guilabel:`InaSAFE Keyword Wizard`. After the keyword has been already set, we are ready to run |project_name| for building polygons and roads.
id: Lihat pada dek panel |project_name| untuk memastikan poligon bangunan dan jalan memiliki sebuah kata kunci yang sudah ditentukan. Jika data tersebut tidak memiliki kata kunci, Anda dapat menentukan kata kunci menggunakan :guilabel:`InaSAFE Keyword Wizard`. Setelah kata kunci ditentukan, kita siap menjalankan analisis |project_name| untuk poligon bangunan dan jalan.

source: C. Run |project_name| analysis for building polygons
id: C. Menjalankan analisis |project_name| untuk poligon bangunan

source: Let us run analysis for building polygons first. Make sure you set the |project_name| dock as pictured below:
id: Mari kita jalankan analisis untuk poligon bangunan terlebih dahulu. Pastikan Anda mengatur dek |project_name| seperti gambar di bawah:

source: We will run |project_name| for flood vector hazard and building polygons with data aggregated by Jakarta district Click :guilabel:`Run` to begin |project_name| analysis. After running, you will find the impact result layer in Layer List.
id: Kta akan menjalankan |project_name| untuk data vektor ancaman dan poligon bangunan dengan data agregasi Jakarta district, klik :guilabel:`Hitung` untuk memulai analisis |project_name|. Setelah menjalankan analisis, Anda akan melihat layer hasil terdampak baru di Daftar Layer.

source: Look at the **Detailed building type report** (picture above) it shows that five districts in Jakarta are affected by flood. Your results may vary since it depend on the analysis area selected and also the aggregation layer that you used for analysis.
id: Lihat **Laporan Detil Tipe Bangunan** (gambar di atas) yang menunjukkan bahwa lima kotamadya di Jakarta terdampak banjir. Hasil analisis dapat bervariasi tergantung area analisis yang dipilih pengguna dan juga layer agregasi yang digunakan.

source: |project_name| did not separate the impact result into three categories as in the :ref:`Run Basic InaSAFE <run_basic_inasafe>` because in the previous exercise we used raster data containing information of flood depth in each pixel yet in this exercise, the hazard data that we use only depicts affected areas. Therefore, |project_name| will calculate how many buildings are inside the affected area but not level of impact on each building.
id: |project_name| tidak memisahkan hasil analisis dampak ke dalam tiga kategori seperti di :ref:`Menjalankan InaSAFE Dasar <run_basic_inasafe>` karena pada materi sebelumnya kita menggunakan data raster yang memiliki informasi kedalaman banjir di masing-masing piksel, sedangkan di materi ini, data ancaman yang digunakan hanya memiliki informasi area terdampak saja. Oleh karena itu, |project_name| hanya menghitung banyaknya bangunan yang terdampak saja tetapi tidak menghitung seberapa parah dampaknya untuk bangunan-bangunan tersebut.

source: We just succeeded running |project_name| on flood vector hazard with building polygon. Next, we will run |project_name| for roads. What are the results that you expect to get when you run |project_name| for roads?
id: Kita baru saja berhasil menjalankan |project_name| untuk data vektor banjir terhadap poligon bangunan. Selanjutnya, kita akan menjalankan |project_name| untuk jalan. Hasil apa yang Anda harapkan ketika Anda menjalankan |project_name| untuk jalan?

source: D. Run |project_name| for roads
id: D. Menjalankan |project_name| untuk jalan

source: In this last exercise, we will run |project_name| on roads data that we previously downloaded from OpenStreetMap. Make sure that you select roads as exposure data in the |project_name| dock, as shown in the screenshot below:
id: Pada latihan sebelumnya, kita akan menjalankan |project_name| pada data jalan yang sebelumnya sudah diunduh menggunakan OpenStreetMap. Pastikan Anda memilih layer jalan sebagai data keterpaparan di dek |project_name|, seperti yang terlihat di *screenshot* di bawah:

source: Click :guilabel:`Run` to start |project_name| analysis. A new impact layer will be added to your Layer List and in the map canvas you will see green roads as not flooded and red as flooded. Select the **Flooded roads** layer to see statistics from the |project_name| analysis.
id: Klik :guilabel:`Hitung` untuk memulai analisis |project_name|. Sebuah layer dampak baru akan muncul di Daftar Layer dan di kanvas peta Anda akan melihat jalan berwarna hijau yang berarti bahwa jalan tersebut tidak banjir dan jalan berwarna merah yang terdampak banjir. Pilih layer **Flooded roads** untuk melihat statistik hasil analisis |project_name|.

source: In this analysis, |project_name| will generate statistics on how many roads are temporarily closed in the affected area and also a breakdown of the result by road type. If you are using aggregation, there will be detailed results for each aggregation. In the action checklist, you will see several questions that can be used for points of discussion related to road impact, and disaster logistics planning, for example: *Which roads can be used to evacuate people or to distribute logistics?*
id: Pada analisis ini, |project_name| akan menghasilkan statistik berapa banyak jalan yang ditutup sementara di area terdampak dan juga rincian analisis berdasarkan tipe jalan. Jika Anda menggunakan agregasi, akan ada hasil rinci untuk masing-masing agregat. Pada daftar tindakan, Anda akan melihat beberapa pertanyaan yang digunakan untuk diskusi mengenai dampak pada jalan dan rencana logistik bencana, misalnya: *Jalan mana yang dapat digunakan untuk mengevakuasi penduduk atau untuk mendistribusikan logistik?*

source: Summary
id: Ringkasan

source: In this exercise, you have learned how to run |project_name| analysis with different hazard data formats and with new type of exposure data. You have also learned two fundamental steps to remember before you run |project_name|:
id: Pada bab ini, Anda telah mempelajari bagaimana menjalankan analisis |project_name| menggunakan format data ancaman yang berbeda dan menggunakan jenis data keterpaparan baru. Anda juga telah mempelajari dua langkah penting yang harus diingat sebelum Anda menjalankan analisis |project_name|:

source: First, you learned how to define a keyword for your data so it can be analysed with |project_name|. Without a keyword, |project_name| will not recognize your data, so you need to define it whether the data is hazard, exposure or aggregation data. You can set the keyword using the :guilabel:`Keyword Creation Wizard` feature.
id: Pertama, Anda belajar bagaimana menentukan kata kunci untuk data Anda sehingga data Anda dapat dianalisis menggunakan |project_name|. Tanpa kata kunci, |project_name| tidak dapat mengenali data Anda, sehingga Anda perlu menentukan apakah data itu adalah ancaman, keterpaparan, atau agregasi. Anda dapat menentukan kata kunci menggunakan fitur :guilabel:`Wizard Pembuat Keyword`.

source: Second, it is important to review the analysis area using *Toggle Scenario Outline* before you run |project_name| analysis. This is because, |project_name| sometimes does not automatically set the analysis area according to the intersection of hazard and exposure data. If |project_name| did not set the analysis area, you need to define it manually using the :guilabel:`Set Analysis Area` feature.
id: Kedua, penting untuk meninjau area analisis menggunakan *Tombol untuk beralih ke garis bantu skenario* sebelum Anda menjalankan analisis |project_name|. Hal ini dikarenakan |project_name| biasanya tidak secara otomatis mengatur area analisis menurut perpotongan antara data ancaman dan keterpaparan. Jika |project_name| tidak mengatur area analisis, Anda perlu menentukannya secara manual menggunakan fitur :guilabel:`Tentukan Daerah Analisis`.

source: In this exercise, you have learned how to download buildings and roads data from OpenStreetMap using :guilabel:`OpenStreetMap Downloader`. With this feature you can define the size of the area and what type of data you want to download. The availability of the data depends on how complete the data are in OpenStreetMap.
id: Pada bab ini, Anda juga telah mempelajari bagaimana mengunduh bangunan dan jalan dari OpenStreetMap menggunakan :guilabel:`OpenStreetMap Downloader`. Dengan fitur ini, Anda dapat menentukan ukuran area dan jenis data apa yang Anda ingin unduh. Ketersediaan data bergantung pada kelengkapan data di OpenStreetMap.

source: In the next section, you will learn how to run |project_name| with other type of hazard data such as tsunami, earthquake, volcano and generic data.
id: Pada sesi selanjutnya, Anda akan mempelajari bagaimana menjalankan |project_name| dengan jenis data ancaman yang lain seperti tsunami, gempa bumi, gunung berapi dan data umum.
