Repository: inasafe/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/socialisation/run_intermediate_inasafe.po
Languages: id

source: Run Intermediate |project_name|
id: Menjalankan |project_name| Tingkat Menengah

source: Introduction
id: Pengantar

source: In `Run Basic InaSAFE <http://docs.inasafe.org/en/training/socialisation/run_basic_inasafe.html>`__ we learned how to run a flood analysis on population and buildings, adjust the flood impact default settings and analyse impact summary report, and change analysis threshold. We also learned how to save our work and generate a pdf of the analysis results. In this exercise we will learn more techniques such as how to run |project_name| with aggregation data to produce reports broken down by districts or regions. We will also learn how to download data using the OpenStreetMap downloader and how to run |project_name| analysis on the downloaded building polygons and roads. Last but not least, we will learn how to define the analysis area.
id: Pada `Menjalan InaSAFE Dasar <http://docs.inasafe.org/en/training/socialisation/run_basic_inasafe.html>`__ kita telah mempelajari bagaimana menjalankan analisis banjir terhadap populasi dan bangunan, mengubah pengaturan fungsi dampak dan menganalisis laporan hasil analisis, dan mengubah ambang batas analisis. Kita juga telah mempelajari bagaimana menyimpan hasil kerja kita dan membuat pdf dari hasil analisis. Pada bagian ini kita akan mempelajari teknik lebih lanjut terkait dengan bagaimana menjalankan |project_name| dengan data agregasi untuk menghasilkan laporan berdasarkan wilayah administrasi. Kita juga akan mempelajari bagaimana mengunduh data menggunakan OpenStreetMap downloader dan bagaimana menjalankan analisis |project_name| terhadap bangunan dan jalan yang telah diunduh. Terakhir, kita juga mempelajari bagaimana menentukan area analisis.

source: Learning Objective
id: Tujuan Pembelajaran

source: To improve the participant’s understanding of additional |project_name| function and features. By the end of this exercise, participants will be able to:
id: Untuk meningkatkan pemahaman peserta mengenai fungsi dan fitur lain dari |project_name|. Pada akhir bab ini, peserta akan mampu untuk:

source: Define keywords using the |project_name| keyword wizard
id: Menentukan kata kunci menggunakan |project_name| Wizard Pembuat Keyword

source: Run |project_name| with aggregation data
id: Menjalankan |project_name| menggunakan data agregasi

source: Use the OpenStreetMap Downloader to download data for |project_name|
id: Menggunakan OpenStreetMap Downloader untuk mengunduh data |project_name|

source: Set the |project_name| analysis area using the |project_name| analysis area tool.
id: Mengatur analisis area |project_name| menggunakan *tool* |project_name| analisis area.

source: Data for this exercise
id: Data untuk materi ini

source: The data for this exercise are available in Run Intermediate InaSAFE.zip which can be downloaded from `InaSAFE Training Data <http://data.inasafe.org/Socialisation%20Training/>`__. We will use the following data:
id: Data untuk latihan ini tersedia di Run Intermediate InaSAFE.zip yang dapat diunduh melalui `InaSAFE Training Data <http://data.inasafe.org/Socialisation%20Training/>`__. Data yang akan digunakan adalah:

source: Exercise
id: Latihan

source: 1. Running |project_name| for Population Data
id: 1. Menjalankan |project_name| untuk Data Populasi

source: A. Add and symbolise vector data
id: A. Menambahkan dan mengubah simbol data vektor

source: Click :guilabel:`Open` and select :file:`DKI Jakarta Intermediate.qgs`. There is a notification to save the current project, choose whether to save your current work or discard your current work. Once :file:`DKI_Jakarta_Intermediate` is opened, you will see the following:
id: Klik :guilabel:`Buka` dan pilih :file:`DKI Jakarta Intermediate.qgs`. Akan ada notifikasi untuk menyimpan proyek yang sedang dikerjakan, silahkan pilih apakah Anda ingin menyimpan pekerjaan anda atau menghapus pekerjaan anda saat ini. Setelah :file:`DKI_Jakarta_Intermediate` terbuka, Anda akan melihat:

source: Next, add :file:`Jakarta Flood 18113 WGS84` data from :file:`Run Intermediate InaSAFE > DKI Jakarta > 01 Hazard Data`. This is the flood hazard data for Jakarta from an actual flood event. During Jakarta floods in January 2013, the provincial disaster manager collected information about the flood, including the location of flooded areas by sub-village boundary (see more about this data at :ref:`datasets`.)
id: Selanjutnya, tambahkan data :file:`Jakarta Flood 18113 WGS84` dari :file:`Run Intermediate InaSAFE > DKI Jakarta > 01 Hazard Data`. Data ini merupakan data ancaman banjir Jakarta berdasarkan kejadian banjir Jakarta pada Januari 2013. Saat itu, BPBD DKI Jakarta mengumpulkan informasi tentang banjir, termasuk lokasi yang terdampak banjir berdasarkan batas RW (lihat lebih lanjut di :ref:`datasets`.)

source: Let us symbolise this layer so that it shows only affected areas (if you forget how to symbolise, you can go to :ref:`introduction_to_qgis`.) The layer should look like this:
id: Mari ubah simbologi layer banjir sehingga hanya area terdampak banjir saja yang ditampilkan di kanvas peta (jika lupa cara mengubahnya, Anda bisa menuju :ref:`introduction_to_qgis`.) Layer akan terlihat seperti ini:

source: Using this layer, we will be able to see which area in Jakarta are categorized as flooded/affected area by analysing the data using |project_name|. On the InaSAFE Dock, you will notice that the hazard is not there and only exposure data (population) is visible, even though you already turned ON the data layer.
id: Dengan menggunakan layer ini, kita akan dapat melihat area mana di Jakarta yang dikategorikan sebagai area terdampak banjir dengan menganalisis data menggunakan |project_name|. Pada dek InaSAFE, Anda akan menyadari bahwa layer ancaman tidak nampak dan hanya data keterpaparan (populasi) yang terlihat, meskipun Anda sudah mengaktifkan layer ancaman tersebut.

source: Do you know why |project_name| did not display the Jakarta Flood Vector Hazard data on the dock? The answer will be provided in the next section.
id: Tahukah Anda mengapa |project_name| tidak menampilkan data ancaman *Jakarta Flood* pada dek? Jawabannya akan dibahas pada sesi selanjutnya.

source: B. Define keyword for hazard data
id: B. Menentukan kata kunci untuk data ancaman

source: |project_name| need a keyword to determine what type of data the user provide for analysis (hazard data, exposure data or aggregation data). If the data provided does not have a keyword, it will show a warning message “Layer Keyword Missing” in the |project_name| Dock. Try selecting :guilabel:`Jakarta_Flood_18113_WGS84` layer and look at the |project_name| dock, You will see the following:
id: |project_name| membutuhkan sebuah kata kunci untuk menentukan tipe data apa yang disediakan oleh pengguna untuk analisis (data ancaman, keterpaparan, atau data agregasi). Jika data yang tersedia tidak memiliki kata kunci, maka akan tampil pesan peringatan “Kata Kunci Layer Hilang” pada dek |project_name|. Coba pilih layer :guilabel:`Jakarta_Flood_18113_WGS84` dan lihat dek |project_name|, Anda akan melihat tampilan seperti ini:

source: As you can see from the picture above, this layer keywords are missing and we need to open the keyword wizard to solve this problem. The keywords wizard will take you through a step-by-step process of assigning keywords to your data.
id: Seperti yang Anda dapat lihat pada gambar di atas, kata kunci pada layer ini tidak ada dan kita perlu membuka Wizard Pembuat Keyword untuk menyelesaikan masalah ini. Wizard Pembuat Keyword akan membawa Anda melalui proses langkah demi langkah menentukan kata kunci pada data Anda.

source: Select **Jakarta_Flood_18113_WGS84** layer and click :guilabel:`Keyword Creation Wizard`. A window will appear and follow the steps provided by the :guilabel:`Keyword Creation Wizard.` If you get stuck, you can follow the diagram below to understand the steps and the choices you will be offered.
id: Pilih layer **Jakarta_Flood_18113_WGS84** layer dan klik :guilabel:`Wizard Pembuat Keyword`. Sebuah jendela akan muncul dan ikuti langkah-langkah yang tersedia pada :guilabel:`Wizard Pembuat Keyword.` Jika Anda mengalami kebuntuan, Anda dapat mengikuti diagram di bawah untuk memahami langkah-langkah tersebut dan pilihan yang tersedia.

source: Steps in the Keyword Creation Wizard
id: Langkah-langkah pada Wizard Pembuat Keyword

source: Starting at the top of the diagram and working down; in the first step you will choose if your data are hazard, exposure or aggregation data. Your choice will determine the next options offered. You can always go back and change things later.
id: Dimulai pada bagian atas diagram lalu ke bawah; pada langkah awal Anda akan memilih apakah data Anda termasuk data ancaman, keterpaparan atau agregasi. Pilihan Anda akan menentukan pilihan berikutnya yang diberikan. Anda dapat kembali ke langkah sebelumnya dan mengubah informasi yang ingin diubah nantinya.

source: If you choose Hazard or Exposure, you will need to select the type of hazard or exposure. Next, you will choose whether the layer mode is continuous or classified (if you forget what Continuous or Classified means, you can reference the `Key Concept of Disaster Management section <http://docs.inasafe.org/en/training/socialisation/inasafe_concepts.html>`__). Both Hazard and Exposure types have the same step after you define the layer mode: defining which unit or attribute represents the hazard.
id: Jika Anda memilih Ancaman atau Keterpaparan, Anda perlu pilih jenis ancaman atau keterpaparan nya. Selanjutnya, Anda pilih apakah mode layer tersebut adalah kontinyu atau terklasifikasi (jika Anda lupa arti dari kontinyu atau terklasifikasi, Anda dapat melihat referensi dari `Key Concept of Disaster Management section <http://docs.inasafe.org/en/training/socialisation/inasafe_concepts.html>`__). Ancaman dan keterpaparan memiliki langkah yang sama setelah menentukan mode layer: mendefinisikan unit atau atribut yang merepresentaikan ancaman tersebut.

source: The steps will be different for aggregation data. After you define the data as aggregation data, you will select the attribute to represent the names of aggregation areas. After you select it, you will be asked to define the population ratio. Finally, you will need to enter the source of data and the name of your layer to be displayed in the |project_name| dock.
id: Langkah-langkah tersebut akan berbeda untuk data agregasi. Setelah Anda menentukan data tersebut sebagai data agregasi, Anda akan memilih atribut untuk merepresentasikan nama dari area agregasi. Setelah Anda memilihnya, Anda akan diminta untuk menentukan rasio populasi. Kemudian Anda harus memasukkan sumber data dan nama layer yang akan ditampilkan pada dek |project_name|.

source: After you set the keyword using the Keyword Wizard, you can see in the |project_name| panel on the right side that the layer keyword has been set. Verify that it looks like the image below? If it does not, you should go back and try to define the keyword again.
id: Setelah Anda mengatur kata kunci menggunakan Wizard Pembuat Keyword, Anda dapat melihat pada panel |project_name| panel di sisi kanan bahwa kata kunci sudah diatur. Untuk memastikan apakah tampilannya seperti gambar di bawah ini? Jika tidak, Anda harus kembali dan mencoba menentukan kata kunci lagi.

source: After you set the keyword to match the image above, the hazard data will appear in the hazard panel of the |project_name| Dock.
id: Setelah Anda menentukan kata kunci persis seperti gambar di atas, data ancaman akan muncul pada panel ancaman dek |project_name|.

source: Now all the keyword data has been set and we can move into the next section to run |project_name| with population data.
id: Sekarang semua data kata kunci telah ditentukan dan kita dapat berpindah ke sesi selanjutnya untuk menjalankan |project_name| untuk data populasi.

source: C. Run |project_name| for population with aggregation
id: C. Menjalankan |project_name| untuk populasi dengan agregasi

source: We have seen the result of |project_name| on buildings and populations with raster hazard data. Now we will run |project_name| analysis using flood vector hazard data and raster population as exposure data. This time, however, we will use aggregated data. Using |project_name| with aggregated data will help you to get detailed result since the aggregated data can provide detailed information on specific administrative (or other) area. |project_name| allows us to add administrative data with specific boundaries that we can use to aggregate results.
id: Kita telah melihat hasil |project_name| untuk bangunan dan populasi dengan data ancaman raster. Sekarang kita akan menjalankan analisis |project_name| menggunakan data ancaman vektor banjir dan raster populasi sebagai data keterpaparan. Namun kali ini kita akan menggunakan data agregasi. Menggunakan |project_name| dengan data agregasi akan membantu Anda mendapatkan hasil yang rinci karena data agregasi dapat memberikan informasi yang rinci mengenai wilayah administrasi tertentu (atau lainnya). |project_name| memungkinkan kita untuk menambahkan data administrasi dengan batas-batas tertentu yang dapat kita gunakan untuk mengagregasi hasil analisis.

source: To do this, look at the Layer List and make sure to turn ON the **Jakarta District** layer. Next, take a look at the |project_name| dock under the heading *Summarise the results by*.
id: Untuk melakukan ini, lihat pada Daftar Layer dan pastikan layer **Jakarta District** diaktifkan. Kemudian, lihat pada dek |project_name| di bawah tulisan *Simpulkan hasil dengan*.

source: Why are we not able to see the **Jakarta District** layer that we just turned ON before? Check the layer by selecting it on the Layer List. Did you see the keyword? The reason why this layer did not appear in the |project_name| Dock is because it did not have keyword data defube. Go ahead and add a keyword for **Jakarta District** using the :guilabel:`Keyword Creation Wizard`. For your reference, refer to the keyword diagram as explained above.
id: Mengapa layer **Jakarta District** yang sudah diaktifkan sebelumnya tidak tampak? Cek layer dengan memilih layer tersebut di Daftar Layer. Apakah Anda melihat kata kunci layer tersebut? Alasan mengapa layer ini tidak muncul pada dek |project_name| karena layer tersebut tidak memiliki kata kunci. Silakan tambahkan kata kunci untuk **Jakarta District** menggunakan :guilabel:`Wizard Pembuat Keyword`. Untuk referensi, lihat diagram kata kunci yang sebelumnya sudah dijelaskan.

source: Now you will able to select **Jakarta District** under 'Summarise the results by' in the |project_name| Dock. The |project_name| Dock should look like this:
id: Sekarang Anda dapat memilih **Jakarta District** di bawah 'Simpulkan hasil dengan' pada dek |project_name|. Dek |project_name| akan terlihat seperti ini:

source: Click :guilabel:`Run` and wait until |project_name| finishes analysing the data. A new impact layer will be added to the Layer List. When you look at the result, it looks the same as |project_name| analysis result without aggregation, but if you scroll down to the bottom you will see the detailed result. As explained before, using aggregation will let you get detailed information for a specific area or administration region.
id: Klik :guilabel:`Hitung` dan tunggu hingga |project_name| selesai menganalisis data. Layer terdampak baru akan ditambahkan pada Daftar Layer. Ketika Anda melihat hasilnya, hasilnya akan terlihat sama seperti hasil analisis |project_name| tanpa agregasi, tapi jika Anda menggeser ke bawah, Anda akan melihat hasil terperincinya. Seperti yang sudah dijelaskan sebelumnya, dengan menggunakan agregasi Anda akan mendapatkan hasil yang terperinci untuk area atau wilayah administrasi tertentu.

source: In the screenshot above, we see detailed impact results for each district in Jakarta for the detailed minimum needs report. You can also use *jakarta subdistrict* rather than using *jakarta_district* for aggregation if you want to get more detailed results. Try running the analysis again using *jakarta subdistrict*. The aggregation option in |project_name| can also be applied for buildings and roads (in addition to population). In the next exercise, we will learn to run |project_name| for roads and buildings.
id: Pada *screenshot* di atas, kita melihat hasil terdampak yang terperinci untuk tiap kotamadya di Jakarta untuk laporan rinci kebutuhan minimum. Anda juga dapat menggunakan *jakarta subdistrict* selain menggunakan *jakarta_district* untuk data agregasi jika Anda ingin mendapatkan hasil yang lebih rinci lagi. Coba jalankan lagi analisis menggunakan *jakarta subdistrict*. Opsi agregasi pada |project_name| dapat diaplikasikan juga untuk bangunan dan jalan (selain populasi). Pada materi selanjutnya, kita akan mempelajari menjalankan |project_name| untuk jalan dan bangunan.

source: 2. Running |project_name| for roads and buildings
id: 2. Menjalankan |project_name| untuk data jalan dan bangunan

source: A. Download building polygons and roads with OpenStreetMap Downloader
id: A. Mengunduh poligon bangunan dan jalan menggunakan *OpenStreetMap Downloader*

source: We have completed running |project_name| with population and vector hazard data. Now, we will run |project_name| with different type of vector exposure data: roads and buildings polygons. We will obtain these dataset using one of |project_name| features, :guilabel:`OpenStreetMap Downloader`. :guilabel:`OpenStreetMap Downloader` is a feature that enables downloading OpenStreetMap data and directly loading it into QGIS. This feature requires an internet connection as it fetches the data via a web service. Once downloaded, the data will be available as shapefiles and symbolised neatly (more information at `OpenStreetMap Downloader page <http://docs.inasafe.org/en/user-docs/application-help/openstreetmap_downloader.html>`__).
id: Kita telah menyelesaikan proses analisis |project_name| dengan data populasi dan data vektor ancaman. Sekarang, kita akan menjalankan |project_name| dengan jenis data vektor keterpaparan yang berbeda: jalan dan poligon bangunan. Kita akan mendapatkan dataset ini menggunakan salah satu fitur |project_name|, :guilabel:`OpenStreetMap Downloader`. :guilabel:`OpenStreetMap Downloader` adalah sebuah fitur yang memungkinkan kita untuk mengunduh data OpenStreetMap dan langsung memuatnya ke dalam QGIS. Fitur ini membutuhkan koneksi internet karena fitur ini mengambil data melalui layanan situs. Setelah data berhasil diunduh, data akan tersedia sebagai shapefile dan sudah diberi simbol (informasi lebih lanjut kunjungi `halaman OpenStreetMap Downloader <http://docs.inasafe.org/en/user-docs/application-help/openstreetmap_downloader.html>`__).

source: To use this feature for our next exercise, follow these steps:
id: Untuk menggunakan fitur ini di materi berikutnya, ikuti langkah-langkah berikut:

source: :guilabel:`Zoom in` to any flooded area that you prefer.
id: :guilabel:`Perbesar` area banjir yang Anda inginkan.

source: Click the :guilabel:`OpenStreetMap Downloader` icon.
id: Klik ikon :guilabel:`OpenStreetMap Downloader`.

source: Select :guilabel:`Building Polygons` and :guilabel:`Roads` as the feature types to download.
id: Pilih :guilabel:`Poligon Bangunan` dan :guilabel:`Jalan` sebagai jenis fitur yang akan diunduh.

source: Click :guilabel:`Drag on Map` to select the boundary box from which data will be downloaded.
id: Klik :guilabel:`Geser pada peta` untuk memilih kotak batas dari data yang akan diunduh.

source: Choose your output directory, where OSM data will be stored. Adding a file name prefix makes it easier to identify the data downloaded.
id: Pilih direktori *output* Anda, dimana data OSM akan disimpan. Tambahkan awalan nama file untuk memudahkan dalam identifikasi data yang diunduh.

source: Click :guilabel:`OK`.
id: Klik :guilabel:`OK`.

source: It may take a while to download all the data in the given area based on how big the area is (generally dataset at city level and below should work well). After you download the data, a new layer will appear in the Layer List. The amount of data available depends on the OpenStreetMap data available in the downloaded region. If you want to get more data in your area, you can participate in OpenStreetMap and start map the area.
id: Lamanya waktu mengunduh data akan bergantung pada besarnya area dan banyaknya data OSM (pada umumnya dataset pada tingkat kota ke bawah berjalan lancar). Setelah Anda mengunduh data, sebuah layer baru akan muncul di Daftar Layer. Banyaknya data yang tersedia bergantung pada data OpenStreetMap yang tersedia di lokasi yang diunduh datanya. Jika Anda ingin mendapatkan data yang lebih lengkap dan banyak, Anda dapat berpartisipasi menggunakan OpenStreetMap dan mulai memetakan area tersebut.

source: Since the data already downloaded, we are ready to run |project_name| analysis. But can |project_name| run the data for only the small part of the whole hazard data? We will find the answer in the next section.
id: Setelah data sudah diunduh, kita siap menjalankan analisis |project_name|. Tetapi dapatkah |project_name| menjalankan data hanya untuk sebagian kecil dari keseluruhan data ancaman? Kita akan menemukan jawabannya pada sesi selanjutnya.

source: B. Define your custom analysis area
id: B. Menentukan area analisis kustom

source: |project_name| has a feature that allows you specify exactly which area should be used for your analysis. If you have exposure data that is not the same size, you can use this feature to define your own analysis area.
id: |project_name| memiliki sebuah fitur yang memungkinkan Anda menentukan area mana yang akan digunakan untuk analisis Anda. Jika Anda memiliki data keterpaparan yang ukurannya tidak sama, Anda dapat menggunakan fitur ini untuk menentukan area analisis Anda sendiri.

source: Click :guilabel:`Set Analysis Area` to show set analysis extent feature.
id: Klik :guilabel:`Tentukan Daerah Analisis` untuk menampilkan fitur penentuan daerah analisis.

source: Select :guilabel:`Use intersection of hazard, exposure and this bounding box`.
id: Pilih :guilabel:`Gunakan perpotongan dari ancaman, keterpaparan dan kotak batas ini`.

source: Click :guilabel:`Drag on Map` to draw the bounding box around building polygons and roads.
id: Klik :guilabel:`Geser pada peta` untuk menggambar kotak batas sekitar poligon bangunan dan jalan.

source: Click :guilabel:`OK`
id: Klik :guilabel:`OK`

source: if you click Draw on Map, the window will be temporarily hidden so that you can drag a rectangle on the map. After you have finished dragging the rectangle, the window will reappear.
id: Jika Anda mengklik Geser pada peta, jendela akan tersembunyi sementara sehingga Anda dapat menggeser sebuah kotak pada peta. Setelah Anda selesai menggeser kotak, jendela akan muncul kembali.

source: To verify that your analysis area has been successfully defined, click :guilabel:`Toggle Scenario Outlines`. A green box will appear around your data.
id: Untuk memastikan bahwa area analisis Anda telah selesai ditentukan, klik :guilabel:`Tombol untuk beralih ke garis bantu skenario`. Sebuah kotak hijau akan muncul di sekeliling data Anda.

source: Using Toggle Scenario Outlines help you understand which area that |project_name| will analyse. It is also an important step before running |project_name| analysis because not all of the data you put in the Layer List will be automatically defined by |project_name|.
id: Menggunakan Tombol untuk beralih ke garis bantu skenario membantu Anda memahami area yang akan dianalisis |project_name|. Ini merupakan langkah penting sebelum menjalankan analisis |project_name| karena tidak semua data yang Anda masukkan ke Daftar Layer akan secara otomatis didefinisikan oleh |project_name|.
